{
  "items": {
    "https://darkhorsepressnow.com/news/2026-02-17/oxford-lafayette-community-assistance-fund-launched-to-aid-winter-storm-fern-recovery": {
      "author": "Therese Apel",
      "content_html": "<p>OXFORD — Community leaders, churches and nonprofit organizations in Oxford and Lafayette County have launched a coordinated relief effort to assist residents recovering from Winter Storm Fern.</p><p>The Oxford-Lafayette Community Assistance Fund was created as a collaborative response to provide financial assistance to individuals and families facing storm-related hardship. Organizers say the effort is designed to bridge the gap while residents wait for potential state or federal assistance.</p><p>Rather than establishing a single centralized donation site, participating churches and nonprofit partners are working through their own networks and channels to coordinate giving and distribute aid quickly where it is most needed.</p><p>Initial assistance will focus on urgent needs affecting safety and housing stability, including electrical repairs, plumbing repairs, tree removal and debris hazards. Organizers said additional categories of support may be added as needs are assessed and resources grow.</p><p>Residents of the city of Oxford or Lafayette County experiencing verified storm-related hardship may request assistance through a community intake process. Walk-up intake hours will be held from 9 a.m. to noon Feb. 18 through Feb. 28 at the Old OPC Building, located under the Blue Oxford Water tower at 310 S. 15th St.</p><p>Requests may also be submitted online at https://tinyurl.com/fernhelp or by calling 662-234-1100.</p><p>Applications will be reviewed by a collaborative assessment team led by Doors of Hope in partnership with the North Mississippi Exchange Family Center. The team will verify eligibility, prioritize urgent safety concerns and match approved cases with available resources. When possible, payments will be made directly to licensed vendors or service providers for verified repairs.</p><p>Participating church partners include Oxford-University United Methodist Church , First Baptist Church Oxford , First Presbyterian Church and St. Peter’s Episcopal Church . Community and nonprofit partners include Doors of Hope and the North Mississippi Exchange Family Center .</p><p>Organizers are also building a network of licensed local vendors to assist with recovery work, prioritizing electrical and plumbing repairs and tree removal. Community members may submit vendor information through an online form. Participation in the network does not guarantee work assignments but allows businesses to be considered as recovery needs arise.</p><p>Organizations interested in joining the coordinated fundraising effort may contact Chris McAlilly, lead pastor of Oxford-University United Methodist Church, at [email protected] .</p><p>Organizers said the goal of the fund is to help neighbors recover, rebuild and remain safely housed through a shared community response.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-17/oxford-lafayette-community-assistance-fund-launched-to-aid-winter-storm-fern-recovery",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/01/622124330_1240416211531849_9211823942130337927_n.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-17/oxford-lafayette-community-assistance-fund-launched-to-aid-winter-storm-fern-recovery",
      "pub_date": "Tue, 17 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-17T00:00:00+00:00",
      "summary": "OXFORD — Community leaders, churches and nonprofit organizations in Oxford and Lafayette County have launched a coordinated relief effort to assist residents recovering from Winter Storm Fern.",
      "title": "Oxford-Lafayette Community Assistance Fund Launched to Aid Winter Storm Fern Recovery - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-17/random-acts-of-kindness-day-encourages-small-gestures-with-big-impact": {
      "author": "Therese Apel",
      "content_html": "<p>A cup of coffee paid for in the drive-thru line. A handwritten note left on a coworker’s desk. A stranger offering to carry groceries.</p><p>Those simple moments are at the heart of Random Acts of Kindness Day, observed annually on Feb. 17, a day dedicated to encouraging people to intentionally spread compassion in their communities.</p><p>Founded in 1995 in Denver, Colorado, by the nonprofit Random Acts of Kindness Foundation, the observance has grown into an international movement promoting everyday generosity. The organization later expanded the celebration into Random Acts of Kindness Week, emphasizing that kindness should extend far beyond a single day.</p><p>“Make Kindness the Norm, Not the Exception,” the foundation urges on its website, highlighting the social and emotional benefits of thoughtful actions.</p><p>Research cited by the organization suggests kindness carries measurable health benefits. Acts of generosity can release hormones such as oxytocin and serotonin, which are associated with reduced stress and increased happiness. According to statistics shared by the foundation, people who regularly engage in kind behavior have 23% lower cortisol levels, and a 2020 survey found that 63% of adults reported improved mental health both from receiving and giving kindness.</p><p>Organizers say kindness also strengthens relationships in schools, workplaces and neighborhoods, helping build trust and empathy while breaking down social barriers.</p><p>The movement has attracted more than 261,000 self-described “RAKtivists” in 89 countries, according to RandomActsOfKindness.org . Participants receive a “Daily Dose of Kindness®” email with ideas and inspiration for incorporating compassion into everyday life.</p><p>While the observance is modern, advocates note that kindness itself is timeless. From community volunteers to global humanitarian figures, history has repeatedly shown how small actions can leave lasting impressions.</p><p>Supporters of the day say participation does not require money or grand gestures. Holding a door, offering encouragement, checking on a neighbor or simply listening can create a ripple effect.</p><p>Random Acts of Kindness Day serves as a reminder that meaningful change often begins with ordinary people choosing to act with care — one small gesture at a time.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-17/random-acts-of-kindness-day-encourages-small-gestures-with-big-impact",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/shutterstock_1095186722.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-17/random-acts-of-kindness-day-encourages-small-gestures-with-big-impact",
      "pub_date": "Tue, 17 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-17T00:00:00+00:00",
      "summary": "A cup of coffee paid for in the drive-thru line. A handwritten note left on a coworker’s desk. A stranger offering to carry groceries.",
      "title": "Random Acts of Kindness Day Encourages Small Gestures With Big Impact - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-17/saltillo-man-charged-with-felony-marijuana-trafficking-hydrocodone-possession-after-tupelo-stop": {
      "author": "Morgan Howard",
      "content_html": "<p>TUPELO — A Saltillo man was arrested and charged with felony marijuana trafficking and felony possession of hydrocodone after a traffic stop in Tupelo and a follow-up search at a residence, according to the North Mississippi Narcotics Unit.</p><p>Agents said they stopped a 2022 Ford Bronco on Feb. 10 on North Gloster Street for an equipment violation and identified the driver as Octavious Nathaniel Coleman, 38, of Saltillo.</p><p>Investigators said probable cause was developed during the stop, and a vehicle search led to the seizure of about one pound of suspected marijuana and several dosage units of suspected hydrocodone.</p><p>After the stop, agents executed a search warrant at a residence on Mandi Drive in Saltillo, where they said they found more than 15 pounds of suspected marijuana, additional dosage units of suspected hydrocodone, two firearms and $76,970 in U.S. currency.</p><p>Coleman was charged with felony trafficking of marijuana and felony possession of hydrocodone.</p><p>Lee County Justice Court Judge Marilyn Reed denied bond because Coleman was already out on a felony bond on a previous charge at the time of his arrest, officials said.</p><p>Authorities said the investigation remains ongoing and additional charges may be filed.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-17/saltillo-man-charged-with-felony-marijuana-trafficking-hydrocodone-possession-after-tupelo-stop",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/Screenshot-2026-02-17-143334.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-17/saltillo-man-charged-with-felony-marijuana-trafficking-hydrocodone-possession-after-tupelo-stop",
      "pub_date": "Tue, 17 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-17T00:00:00+00:00",
      "summary": "TUPELO — A Saltillo man was arrested and charged with felony marijuana trafficking and felony possession of hydrocodone after a traffic stop in Tupelo and a follow-up search at a residence, according to the North Mississippi Narcotics Unit.",
      "title": "Saltillo man charged with felony marijuana trafficking, hydrocodone possession after Tupelo stop - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-17/tupelo-police-investigate-shooting-that-injured-juvenile-on-fillmore-drive": {
      "author": "Morgan Howard",
      "content_html": "<p>Tupelo police are investigating a Friday night shooting that injured a juvenile in the 2100 block of Fillmore Drive.</p><p>Officers said they responded at about 10:13 p.m. Feb. 13 after the juvenile arrived at North Mississippi Medical Center by private vehicle with a gunshot wound.</p><p>According to a preliminary investigation, the juvenile had been attending a gathering at a home in the area when multiple shots were fired outside the residence.</p><p>Police said the victim was taken to the hospital before officers arrived and remains under medical care. Authorities said no additional medical details will be released.</p><p>Officers processed the residence and surrounding area for evidence, and detectives are continuing to investigate the circumstances of the shooting, police said.</p><p>No arrests have been made. Because a juvenile is involved, police said no additional identifying information will be released.</p><p>Anyone with information is asked to contact Tupelo police at 662-841-6491 or Crime Stoppers of Northeast Mississippi at 1-800-773-TIPS.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-17/tupelo-police-investigate-shooting-that-injured-juvenile-on-fillmore-drive",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/634708411_1361606992663433_8544543539978437859_n.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-17/tupelo-police-investigate-shooting-that-injured-juvenile-on-fillmore-drive",
      "pub_date": "Tue, 17 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-17T00:00:00+00:00",
      "summary": "Tupelo police are investigating a Friday night shooting that injured a juvenile in the 2100 block of Fillmore Drive.",
      "title": "Tupelo police investigate shooting that injured juvenile on Fillmore Drive - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-17/update-man-found-dead-outside-jackson-apartment-complex-on-raymond-road-identified": {
      "author": "Morgan Howard",
      "content_html": "<p>A man found dead outside of an apartment complex in Jackson has been identified by the coroner.</p><p>Man Found Shot to Death in Jackson Apartment Complex Parking Lot</p><p>According to JPD, the victim was identified as 30-year-old Kynjarious Rockingham.</p><p>He was found dead yesterday in the 1600 block of Raymond Road.</p><p>This is an ongoing investigation. If you have any information in reference to this case, please contact the Jackson Police Department at 601-960-1234 or Crime Stoppers at 601-355-TIPS (8477).</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-17/update-man-found-dead-outside-jackson-apartment-complex-on-raymond-road-identified",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2025/04/police-lights-1.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-17/update-man-found-dead-outside-jackson-apartment-complex-on-raymond-road-identified",
      "pub_date": "Tue, 17 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-17T00:00:00+00:00",
      "summary": "A man found dead outside of an apartment complex in Jackson has been identified by the coroner.",
      "title": "UPDATE: Man found dead outside Jackson apartment complex on Raymond Road Identified - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-18/como-man-sentenced-to-5-years-in-federal-prison-for-cocaine-distribution": {
      "author": "Therese Apel",
      "content_html": "<p>ABERDEEN — A Como man was sentenced Tuesday to five years in federal prison after pleading guilty to distributing cocaine, federal officials announced.</p><p>Irish Lee, 49, was sentenced to 60 months in prison followed by three years of supervised release by Senior U.S. District Judge Michael P. Mills. Lee was remanded to the custody of the U.S. Marshals Service following the hearing.</p><p>According to court records, Lee previously pleaded guilty Nov. 13, 2025, to cocaine distribution. He was charged in a federal indictment that also named Christopher Mack as a co-defendant. Mack has also pleaded guilty to distribution of cocaine and is scheduled to be sentenced March 19.</p><p>U.S. Attorney Scott F. Leary and FBI Special Agent in Charge Robert Eikhoff announced the sentence.</p><p>Leary said the case is part of the Homeland Security Task Force initiative, a multiagency effort targeting drug trafficking, cartels and related crimes. The Mississippi task force includes agents from the FBI, Homeland Security Investigations, the Bureau of Alcohol, Tobacco, Firearms and Explosives and the Drug Enforcement Administration, working alongside the U.S. Attorney’s Office.</p><p>“Through historic interagency collaboration, the HSTF directs the full might of United States law enforcement towards identifying, investigating and prosecuting such crimes,” Leary said in a statement.</p><p>Eikhoff said illegal drugs such as cocaine harm communities and vowed continued enforcement efforts.</p><p>“The FBI, the Cleveland Police Department, the Homeland Security Task Force and our law enforcement partners will continue to work tirelessly to pursue individuals like Mr. Lee who bring these harmful substances into our communities,” Eikhoff said.</p><p>Assistant U.S. Attorney Chad Doleac prosecuted the case.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-18/como-man-sentenced-to-5-years-in-federal-prison-for-cocaine-distribution",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2023/06/pexels-ekaterina-bolovtsova-6077447-scaled.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-18/como-man-sentenced-to-5-years-in-federal-prison-for-cocaine-distribution",
      "pub_date": "Wed, 18 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-18T00:00:00+00:00",
      "summary": "ABERDEEN — A Como man was sentenced Tuesday to five years in federal prison after pleading guilty to distributing cocaine, federal officials announced.",
      "title": "Como Man Sentenced to 5 Years in Federal Prison for Cocaine Distribution - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-18/father-charged-with-child-neglect-after-6-year-old-injured-in-greenville-shooting": {
      "author": "Morgan Howard",
      "content_html": "<p>GREENVILLE – A 6-year-old boy was injured Monday after he shot himself with a handgun, and his father has been arrested on a child neglect charge, according to Greenville police.</p><p>Officers responded about 5:40 p.m. Feb. 16 to Delta Health Systems at 1400 E. Union Avenue after a report of a juvenile with a gunshot wound, the Greenville Police Department said.</p><p>Police said they spoke with the child’s father, Justin Lowe Sr., who told officers his son shot himself with his 9mm handgun. The father told investigators he had gotten up to use the restroom when he heard a gunshot, then ran into the room and found his son had been shot in the leg.</p><p>The child was taken to the emergency room and was later transported to another medical facility for additional treatment. Police said the injury was considered non-life-threatening.</p><p>Investigators arrested Lowe on one count of child neglect. He is being held at the Washington County Regional Correctional Facility pending an initial court appearance.</p><p>All suspects are presumed innocent unless proven guilty.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-18/father-charged-with-child-neglect-after-6-year-old-injured-in-greenville-shooting",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/633906093_122206505000047818_771689681205204335_n.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-18/father-charged-with-child-neglect-after-6-year-old-injured-in-greenville-shooting",
      "pub_date": "Wed, 18 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-18T00:00:00+00:00",
      "summary": "GREENVILLE – A 6-year-old boy was injured Monday after he shot himself with a handgun, and his father has been arrested on a child neglect charge, according to Greenville police.",
      "title": "Father charged with child neglect after 6-year-old injured in Greenville shooting - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-18/jackson-woman-arrested-in-fatal-shooting-at-chapel-ridge-apartments": {
      "author": "Therese Apel",
      "content_html": "<p>UPDATE: On Wednesday, Jamecia Harper appeared before a Municipal Court Judge and received a $50K bond for the charge of Convicted Felon with a Firearm, and no bond on the Murder charge.</p><p>JACKSON — A 27-year-old Jackson woman has been arrested and charged with murder in connection with a fatal shooting earlier this week at an apartment complex on Raymond Road, police said.</p><p>Jackson Police Department officials said Jamecia Harper, 27, was taken into custody by Robbery/Homicide Unit detectives for her alleged involvement in the killing. Harper is charged with murder and felon in possession of a firearm.</p><p>The victim was identified as Kynjarious Rockingham, 30.</p><p>Precinct 1 officers were dispatched about 12:30 a.m. Feb. 16 to the Chapel Ridge Apartments in the 1600 block of Raymond Road after receiving a report of a deceased person in the parking lot.</p><p>When officers arrived, they found an adult male lying on the ground. Detectives with the Robbery/Homicide Unit, the Mobile Crime Unit and the Hinds County coroner responded to the scene.</p><p>Investigators determined Rockingham had suffered at least one gunshot wound and died from his injuries.</p><p>Authorities have not released a possible motive in the case. It was not immediately clear whether Harper has an attorney or when she is expected to appear in court.</p><p>The shooting marked the city’s seventh homicide of the year, according to police.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-18/jackson-woman-arrested-in-fatal-shooting-at-chapel-ridge-apartments",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/Screenshot-2026-02-18-075332.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-18/jackson-woman-arrested-in-fatal-shooting-at-chapel-ridge-apartments",
      "pub_date": "Wed, 18 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-18T00:00:00+00:00",
      "summary": "UPDATE: On Wednesday, Jamecia Harper appeared before a Municipal Court Judge and received a $50K bond for the charge of Convicted Felon with a Firearm, and no bond on the Murder charge.",
      "title": "Jackson Woman Charged in Fatal Shooting at Chapel Ridge Apartments - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-18/jones-county-crash-suspect-faces-dui-charges-ice-detainer-leads-to-transfer-from-detention-facility": {
      "author": "Morgan Howard",
      "content_html": "<p>JONES COUNTY — A driver arrested in an overnight crash on U.S. Highway 29 North that damaged Dixie Electric Power Association equipment and left hundreds without electricity was later taken into federal custody after an immigration detainer was discovered in court.</p><p>The Jones County Sheriff’s Department said it assisted the Mississippi Highway Patrol at a crash scene near 1961 Highway 29 North at the intersection of Justin Adams Drive.</p><p>Deputy Lou Lowe arrived and took the driver, Richard Castillo, 30, into custody pending the arrival of state troopers, the sheriff’s department said. Authorities said neither Castillo nor a passenger in the vehicle was injured.</p><p>Dixie EPA infrastructure was damaged when a power pole was broken and power lines fell across the roadway, the sheriff’s department said. The outage affected hundreds of Dixie EPA members.</p><p>Troopers arrested Castillo and charged him with DUI first offense, no insurance and failure to keep lane, authorities said. He was booked into the Jones County Adult Detention Facility pending an initial appearance in Jones County Justice Court.</p><p>Dixie EPA linemen and support crews worked to repair the damage and restore service, according to the sheriff’s department. Jones County Fire District 1 volunteer units also responded and assisted with traffic control.</p><p>Authorities said an Immigration and Customs Enforcement detainer was discovered when Castillo appeared in Jones County court before Judge Grant Hedgepeth. The sheriff’s department said Castillo was later picked up by ICE at the Jones County Adult Detention Facility and released to federal custody.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-18/jones-county-crash-suspect-faces-dui-charges-ice-detainer-leads-to-transfer-from-detention-facility",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/Screenshot-2026-02-18-153218.png",
      "link": "https://darkhorsepressnow.com/news/2026-02-18/jones-county-crash-suspect-faces-dui-charges-ice-detainer-leads-to-transfer-from-detention-facility",
      "pub_date": "Wed, 18 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-18T00:00:00+00:00",
      "summary": "JONES COUNTY — A driver arrested in an overnight crash on U.S. Highway 29 North that damaged Dixie Electric Power Association equipment and left hundreds without electricity was later taken into federal custody after an immigration detainer was discovered in court.",
      "title": "Jones County crash suspect faces DUI charges; ICE detainer leads to transfer from detention facility - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-18/natchez-woman-charged-in-atv-theft-investigation-on-scheffel-road": {
      "author": "Morgan Howard",
      "content_html": "<p>NATCHEZ — A Natchez woman has been charged in an ongoing investigation into the theft and recovery of an all-terrain vehicle from property on Scheffel Road, according to the Adams County Sheriff’s Office.</p><p>Sheriff’s officials said Amanda Breland, 40, was charged with grand larceny, trespassing and malicious mischief.</p><p>Deputies arrested Breland about 4 p.m. Tuesday, Feb. 17, after she was seen walking on Ogden Road in Adams County, the sheriff’s office said. She was taken into custody without incident and booked at the Adams County Sheriff’s Office.</p><p>Authorities said the charges are connected to an investigation into a stolen ATV that was recovered on Scheffel Road. Investigators determined the property was unlawfully entered and fencing was damaged to gain access and remove the vehicle, the sheriff’s office said.</p><p>The case remains an active investigation, and additional arrests are expected as investigators work to identify and pursue others involved.</p><p>Anyone with information is asked to contact the Adams County Sheriff’s Office at 601-442-2752 or Adams County E911.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-18/natchez-woman-charged-in-atv-theft-investigation-on-scheffel-road",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/634665675_775120608978829_2770222495695225443_n.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-18/natchez-woman-charged-in-atv-theft-investigation-on-scheffel-road",
      "pub_date": "Wed, 18 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-18T00:00:00+00:00",
      "summary": "NATCHEZ — A Natchez woman has been charged in an ongoing investigation into the theft and recovery of an all-terrain vehicle from property on Scheffel Road, according to the Adams County Sheriff’s Office.",
      "title": "Natchez woman charged in ATV theft investigation on Scheffel Road - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-18/pony-ride-day-set-for-april-4-at-strong-river-equine-center-in-brandon": {
      "author": "Therese Apel",
      "content_html": "<p>BRANDON — Families looking for an afternoon of outdoor fun or looking for an introduction into the world of horses can head to Brandon on April 4 for Pony Ride Day at Strong River Equine Center.</p><p>The three-hour event is scheduled from noon to 3 p.m. at the equine center, 5150 Highway 18, and will feature pony rides, food and photos for children.</p><p>Organizers said rides will be available for $4 each, with multiple horses on hand to accommodate participants. The event is designed to provide a safe and welcoming experience for children, whether it’s their first pony ride or they are already familiar with horses.</p><p>In addition to pony rides, families can purchase hamburgers and hot dogs during the event. Vintage-inspired photos with horses will also be offered as keepsakes.</p><p>Strong River Equine Center also offers birthday parties, horse boarding and English and Western riding lessons throughout the year.</p><p>For more information, call 505-235-2215 or 601-813-4128.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-18/pony-ride-day-set-for-april-4-at-strong-river-equine-center-in-brandon",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/635149417_1301697081767713_2817711368088087291_n.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-18/pony-ride-day-set-for-april-4-at-strong-river-equine-center-in-brandon",
      "pub_date": "Wed, 18 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-18T00:00:00+00:00",
      "summary": "BRANDON — Families looking for an afternoon of outdoor fun or looking for an introduction into the world of horses can head to Brandon on April 4 for Pony Ride Day at Strong River Equine Center.",
      "title": "Pony Ride Day Set for April 4 at Strong River Equine Center in Brandon - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-18/salvation-army-to-host-1920s-themed-senior-prom-in-jackson": {
      "author": "Therese Apel",
      "content_html": "<p>JACKSON — Senior citizens in the Jackson area are invited to step back into the Roaring ’20s this weekend during a vintage-themed prom hosted by The Salvation Army.</p><p>The event, titled “Southern Glamour of the 1920s: A Night of Vintage Elegance,” is scheduled for Saturday from 2 to 5 p.m. at The Salvation Army, 570 E. Beasley Road. The prom is sponsored by CenterWell Senior Primary Care.</p><p>Organizers say the afternoon celebration is designed specifically for older adults and will feature 1920s-inspired décor, music, light refreshments and dancing. Attendees are encouraged to wear vintage attire reflecting the era.</p><p>The Senior Prom is part of the organization’s ongoing efforts to serve and uplift older residents in the Jackson community by providing opportunities for fellowship and social connection.</p><p>“Our seniors are a treasured part of our community,” said Major Timothy Delaney, commanding officer of The Salvation Army in Jackson. “This event is a wonderful opportunity to honor them, celebrate their stories, and provide a space filled with dignity, fun and fellowship.”</p><p>The Salvation Army said the event aims to offer a safe and welcoming environment where seniors can build friendships and create lasting memories.</p><p>For more information about the Senior Prom or other programs, call 601-982-4881.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-18/salvation-army-to-host-1920s-themed-senior-prom-in-jackson",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/shutterstock_1707307105.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-18/salvation-army-to-host-1920s-themed-senior-prom-in-jackson",
      "pub_date": "Wed, 18 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-18T00:00:00+00:00",
      "summary": "JACKSON — Senior citizens in the Jackson area are invited to step back into the Roaring ’20s this weekend during a vintage-themed prom hosted by The Salvation Army.",
      "title": "Salvation Army to Host 1920s-Themed Senior Prom in Jackson - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-18/southern-pines-waives-reduces-dog-adoption-fees-during-weekend-event": {
      "author": "Therese Apel",
      "content_html": "<p>HATTIESBURG — Adoption fees for dogs and puppies will be waived or reduced this weekend at Southern Pines Animal Shelter as the shelter works to place dozens of animals in permanent homes.</p><p>The fee promotion runs Thursday through Sunday at three locations in Hattiesburg, making it “easier and more affordable than ever” for families to adopt, shelter officials said.</p><p>“It may be surprising, but January is one of our busiest puppy seasons in Hattiesburg,” said Amanda Paris, shelter director. “Our shelter is full of adorable puppies and adult dogs of all shapes, sizes and personalities, and they’re just waiting for you.”</p><p>Adoptable dogs and puppies will be available with reduced or waived fees at the shelter, 1901 N. 31st Ave., from noon to 5 p.m. Thursday through Sunday. Additional adoption events will be held Saturday and Sunday from 11 a.m. to 4 p.m. at PetSmart in Hattiesburg, and Sunday from 11 a.m. to 4 p.m. at Petco in Hattiesburg.</p><p>Saturday’s event at PetSmart coincides with “Adopt Joy,” a partnership with PetSmart Charities aimed at connecting families with pets. Shelter officials said research shows pet ownership can benefit cognitive, physical and emotional wellness and help children learn values such as patience and compassion.</p><p>All adoptions include age-appropriate vaccinations, spay or neuter surgery, a microchip, 30 days of pet health insurance and a sample bag of food. The shelter said the reduced fees cover those services.</p><p>Founded in 1952, Southern Pines operates a no-kill shelter that cares for more than 4,000 lost and unwanted dogs and cats each year. The organization also runs a transport program, thrift shops in Hattiesburg and Oak Grove and a low-cost veterinary clinic.</p><p>Shelter hours are noon to 5 p.m. Thursday through Tuesday. The shelter is closed Wednesdays.</p><p>Officials said those unable to adopt can support the effort through donations to assist with the care of animals awaiting homes.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-18/southern-pines-waives-reduces-dog-adoption-fees-during-weekend-event",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/Screenshot-2026-02-18-083014.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-18/southern-pines-waives-reduces-dog-adoption-fees-during-weekend-event",
      "pub_date": "Wed, 18 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-18T00:00:00+00:00",
      "summary": "HATTIESBURG — Adoption fees for dogs and puppies will be waived or reduced this weekend at Southern Pines Animal Shelter as the shelter works to place dozens of animals in permanent homes.",
      "title": "Southern Pines Waives, Reduces Dog Adoption Fees During Weekend Event - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-18/starkville-derby-dachshund-race-set-for-record-turnout-april-25": {
      "author": "Therese Apel",
      "content_html": "<p>STARKVILLE — The fourth annual Starkville Derby, billed as the world’s largest dachshund race, is expected to draw more than 250 racing dogs from over 20 states and crowds in the tens of thousands when it returns April 25.</p><p>Organizers of the Starkville Derby say this year’s event will be its largest yet, with competitors traveling from as far away as Rhode Island and Washington state. Past champions have come from outside Mississippi, including winners from Georgia in 2023 and 2024 and a Texas dog named Forest last year.</p><p>In addition to the races, the Derby features the Boardtown Pizza and Pints Arts Festival, with nearly 200 approved food and art vendors. Other attractions include live music, a children’s zone, flyovers, the Old Dominick Call to Post, Mutt Juleps and an appearance by the Oscar Mayer Wienermobile.</p><p>“We are so excited to welcome even more of our friends to the next edition of the world’s largest wiener dog race,” said Alden Thornhill, founder and host of the event. “Our team can’t wait to welcome so many new folks, both two- and four-legged, to the greatest show on turf on April 25th.”</p><p>The Derby has received multiple statewide and regional honors, including recognition from the Mississippi Tourism Association as Best Large Festival, the Mississippi Main Street Association as Best Creative Large Event and designation as a Top 20 Signature Event by the Southeast Tourism Society.</p><p>Founded in 2023 by a group of friends seeking to create a spring festival in Starkville, the event supports the Oktibbeha County Humane Society and has raised more than $150,000 for shelter pets, according to organizers.</p><p>The multi-camera HD broadcast of the races will begin at 11 a.m. CDT on the event’s YouTube channel and Facebook page. Organizers say the festival has generated millions of social media impressions while becoming one of Mississippi’s largest arts festivals.</p><p>More information is available at thestarkvillederby.com.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-18/starkville-derby-dachshund-race-set-for-record-turnout-april-25",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/starkville-derby-e1771424241243.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-18/starkville-derby-dachshund-race-set-for-record-turnout-april-25",
      "pub_date": "Wed, 18 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-18T00:00:00+00:00",
      "summary": "STARKVILLE — The fourth annual Starkville Derby, billed as the world’s largest dachshund race, is expected to draw more than 250 racing dogs from over 20 states and crowds in the tens of thousands when it returns April 25.",
      "title": "Starkville Derby dachshund race set for record turnout April 25 - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-18/student-taken-into-custody-after-handgun-found-in-vehicle-at-alcorn-central-high-school": {
      "author": "Morgan Howard",
      "content_html": "<p>ALCORN COUNTY — A student was taken into custody after a handgun was found inside a vehicle that entered Alcorn Central High School’s campus, according to the Alcorn School District.</p><p>District officials said the school received a tip Thursday morning about a potential safety concern involving a vehicle coming onto campus. School and district personnel responded and approached the vehicle as soon as it entered school grounds, officials said.</p><p>The district said the vehicle was searched and a handgun was located inside. The firearm was immediately seized, and the student was taken into custody by the Alcorn County Sheriff’s Department.</p><p>Based on information available, the district said officials believe the incident was isolated. The district said no additional details would be released because the matter is now under investigation by law enforcement.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-18/student-taken-into-custody-after-handgun-found-in-vehicle-at-alcorn-central-high-school",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2022/04/megan-lee-T8nLapDk1zM-unsplash-scaled.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-18/student-taken-into-custody-after-handgun-found-in-vehicle-at-alcorn-central-high-school",
      "pub_date": "Wed, 18 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-18T00:00:00+00:00",
      "summary": "ALCORN COUNTY — A student was taken into custody after a handgun was found inside a vehicle that entered Alcorn Central High School’s campus, according to the Alcorn School District.",
      "title": "Student taken into custody after handgun found in vehicle at Alcorn Central High School - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-18/suspect-in-raymond-road-homicide-given-no-bond-on-murder-charge": {
      "author": "Morgan Howard",
      "content_html": "<p>JACKSON – A suspect in Jackson’s seventh homicide of the year appeared in municipal court Wednesday and was ordered held without bond on a murder charge, according to the Jackson Police Department.</p><p>Police said Jamecia Harper appeared before a municipal court judge on Feb. 18, 2026, in connection with Homicide No. 7, which investigators have linked to a case in the 1600 block of Raymond Road.</p><p>Authorities said Harper received a $50,000 bond on a charge of convicted felon in possession of a firearm and was denied bond on the murder charge.</p><p>The case remains under investigation. Anyone with information is asked to contact the Jackson Police Department at 601-960-1234 or Crime Stoppers at 601-355-TIPS (8477).</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-18/suspect-in-raymond-road-homicide-given-no-bond-on-murder-charge",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/Screenshot-2026-02-18-075332.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-18/suspect-in-raymond-road-homicide-given-no-bond-on-murder-charge",
      "pub_date": "Wed, 18 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-18T00:00:00+00:00",
      "summary": "JACKSON – A suspect in Jackson’s seventh homicide of the year appeared in municipal court Wednesday and was ordered held without bond on a murder charge, according to the Jackson Police Department.",
      "title": "Suspect in Raymond Road homicide given no bond on murder charge - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-18/teen-arrested-charged-with-capital-murder-in-fatal-grove-circle-shooting": {
      "author": "Therese Apel",
      "content_html": "<p>UPDATE: On Wednesday, Javeon Wilson appeared before a Municipal Court Judge and received a $250K bond for the charge of Aggravated Assault and no bond for the Capital Murder charge.</p><p>JACKSON — A 17-year-old has been arrested and charged with capital murder in connection with a February shooting at a Jackson apartment complex that left one man dead and another injured, police said.</p><p>Jackson Police Department officials announced that Javeon Wilson, 17, has been taken into custody by the department’s Robbery/Homicide Unit. Wilson is charged with capital murder and aggravated assault in the death of Glen Blackwell III and the wounding of a second victim.</p><p>Wilson was booked into city holding and is awaiting his initial court appearance.</p><p>The shooting occurred Feb. 12 at an apartment complex on Grove Circle near North State Street. Precinct 4 officers responded to reports that several people had been shot. Robbery/Homicide detectives were called to the scene.</p><p>Investigators determined that two individuals were injured during the incident and were transported by ambulance to local hospitals. Hospital staff later informed detectives that one of the victims, Glen Blackwell III, died from his injuries. The second victim was treated for non-life-threatening injuries.</p><p>Police said the suspects were initially described as five to six unknown males wearing masks who fled the scene on foot. At the time of the initial release, no arrests had been made.</p><p>Authorities said the motive for the shooting appeared to be robbery. The investigation remains active.</p><p>Anyone with information is asked to contact the Jackson Police Department at 601-960-1234 or Crime Stoppers at 601-355-TIPS (8477).</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-18/teen-arrested-charged-with-capital-murder-in-fatal-grove-circle-shooting",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/Screenshot-2026-02-18-075808.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-18/teen-arrested-charged-with-capital-murder-in-fatal-grove-circle-shooting",
      "pub_date": "Wed, 18 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-18T00:00:00+00:00",
      "summary": "UPDATE: On Wednesday, Javeon Wilson appeared before a Municipal Court Judge and received a $250K bond for the charge of Aggravated Assault and no bond for the Capital Murder charge.",
      "title": "Teen Charged With Capital Murder in Fatal Grove Circle Shooting - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-18/three-arrested-after-joint-narcotics-operation-in-forrest-lamar-county": {
      "author": "Morgan Howard",
      "content_html": "<p>FORREST COUNTY — Three people were taken into custody Tuesday after a joint narcotics operation by the Forrest County Sheriff’s Office and the Lamar County Sheriff’s Office led to the seizure of suspected methamphetamine, marijuana and multiple firearms, authorities said.</p><p>Investigators from the two agencies executed search warrants Feb. 17 at two locations: one in the 2600 block of Oak Grove Road and another in the 700 block of Duane Street.</p><p>During the searches, agents recovered about 10 ounces of suspected methamphetamine, 18 pounds of suspected marijuana and 12 firearms, authorities said. Officials said the suspects were believed to be involved in drug activity impacting both Forrest and Lamar counties.</p><p>Those arrested were identified as:</p><p>Lorenzo Price, charged with aggravated trafficking of methamphetamine;</p><p>Dorothy Jackson, charged with trafficking of marijuana while in possession of a firearm; and</p><p>Jalavion Haynes, charged with possession with intent to distribute ecstasy while in possession of a firearm.</p><p>Authorities said the seized items will be submitted to the Mississippi Crime Laboratory for testing and analysis. Officials said the investigation remains ongoing.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-18/three-arrested-after-joint-narcotics-operation-in-forrest-lamar-county",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/Screenshot-2026-02-18-154044.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-18/three-arrested-after-joint-narcotics-operation-in-forrest-lamar-county",
      "pub_date": "Wed, 18 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-18T00:00:00+00:00",
      "summary": "FORREST COUNTY — Three people were taken into custody Tuesday after a joint narcotics operation by the Forrest County Sheriff’s Office and the Lamar County Sheriff’s Office led to the seizure of suspected methamphetamine, marijuana and multiple firearms, authorities said.",
      "title": "Three arrested after joint narcotics operation in Forrest, Lamar County - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-18/tupelo-man-sentenced-to-25-years-after-guilty-plea-in-2023-killing": {
      "author": "Morgan Howard",
      "content_html": "<p>TUPELO – A man has been sentenced to 25 years in prison after pleading guilty to second-degree murder in the 2023 death of Montavious Jemar Clifton, according to the First Circuit District Attorney’s Office.</p><p>Prosecutors said Jaedin Jacques Hatchett entered the guilty plea Feb. 12. Hatchett had been indicted on a second-degree murder charge in connection with Clifton’s death on March 5, 2023.</p><p>Circuit Court Judge John R. White sentenced Hatchett to 25 years in the custody of the Mississippi Department of Corrections, the district attorney’s office said. Prosecutors said Hatchett will be required to serve the full 25-year term and will not be eligible for parole or early release.</p><p>The district attorney’s office said an additional 15 years were suspended, and Hatchett will be required to complete five years of post-release supervision after he is released from prison.</p><p>The case was investigated by the Tupelo Police Department. Assistant District Attorney Sadie Gardner prosecuted the case.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-18/tupelo-man-sentenced-to-25-years-after-guilty-plea-in-2023-killing",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/637824765_1532218862242957_461448563448770491_n.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-18/tupelo-man-sentenced-to-25-years-after-guilty-plea-in-2023-killing",
      "pub_date": "Wed, 18 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-18T00:00:00+00:00",
      "summary": "TUPELO – A man has been sentenced to 25 years in prison after pleading guilty to second-degree murder in the 2023 death of Montavious Jemar Clifton, according to the First Circuit District Attorney’s Office.",
      "title": "Tupelo man sentenced to 25 years after guilty plea in 2023 killing - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-18/wednesday-weather-mostly-cloudy-and-warm-with-near-record-highs": {
      "author": "Mary Apel",
      "content_html": "<p>It appears we’ll have our next significant rain chances as we go into the weekend. Monitor updates concerning this system for changes related to storm coverage and rainfall.</p><p>Highs in the 70s nearing 80 later today with occasional sunshine peeking through the clouds.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-18/wednesday-weather-mostly-cloudy-and-warm-with-near-record-highs",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/Weather-11.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-18/wednesday-weather-mostly-cloudy-and-warm-with-near-record-highs",
      "pub_date": "Wed, 18 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-18T00:00:00+00:00",
      "summary": "It appears we’ll have our next significant rain chances as we go into the weekend. Monitor updates concerning this system for changes related to storm coverage and rainfall.",
      "title": "Wednesday Weather: Mostly cloudy and warm with near record highs - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-18/woman-charged-after-domestic-stabbing-in-lamar-county": {
      "author": "Morgan Howard",
      "content_html": "<p>LAMAR COUNTY – A 48-year-old woman has been charged with aggravated assault in a domestic violence case after deputies said a man was stabbed during a fight Monday night at an apartment on Shears Road.</p><p>Deputies responded around 9 p.m. Feb. 16, 2026, after a reported stabbing, according to authorities. Investigators said a 38-year-old man suffered a stab wound to the abdomen and was transported by ambulance to a local hospital, where he underwent surgery.</p><p>Authorities identified the woman as Demetra Holloway, 48. Deputies said Holloway suffered a cut to her hand during the incident and was also taken to a local hospital for treatment.</p><p>After she was released, Holloway was transported to the Lamar County Jail and charged with aggravated assault/domestic violence, authorities said. Bond was set at $25,000.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-18/woman-charged-after-domestic-stabbing-in-lamar-county",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/Screenshot-2026-02-18-115413.png",
      "link": "https://darkhorsepressnow.com/news/2026-02-18/woman-charged-after-domestic-stabbing-in-lamar-county",
      "pub_date": "Wed, 18 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-18T00:00:00+00:00",
      "summary": "LAMAR COUNTY – A 48-year-old woman has been charged with aggravated assault in a domestic violence case after deputies said a man was stabbed during a fight Monday night at an apartment on Shears Road.",
      "title": "Woman charged after domestic stabbing in Lamar County - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-19/air-national-guard-to-host-sentry-south-26-2-exercise-across-mississippi": {
      "author": "Therese Apel",
      "content_html": "<p>GULFPORT — The Air National Guard will host the Sentry South 26-2 training exercise from Feb. 20 through March 6 at multiple locations across Mississippi, including the Gulfport Combat Readiness Training Center and the Camp Shelby Joint Forces Training Center.</p><p>Approximately 1,100 service members from active-duty, National Guard and reserve components of the U.S. military are expected to participate in the large-scale combat training exercise.</p><p>Sentry South 26-2 is a Large Force Employment exercise focused on major combat operations and joint maritime opportunities in a contested or degraded operational environment, according to officials. The training applies joint and combined warfighting doctrine against realistic and robust enemy integrated threat systems under safe and controlled conditions.</p><p>Residents living near training sites may notice increased military activity during the exercise, including additional aircraft operations, low-flying helicopters and elevated noise levels.</p><p>The training will take place at facilities in Gulfport, Camp Shelby and other locations around the state.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-19/air-national-guard-to-host-sentry-south-26-2-exercise-across-mississippi",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2024/10/Screenshot-2024-10-10-073405.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-19/air-national-guard-to-host-sentry-south-26-2-exercise-across-mississippi",
      "pub_date": "Thu, 19 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-19T00:00:00+00:00",
      "summary": "GULFPORT — The Air National Guard will host the Sentry South 26-2 training exercise from Feb. 20 through March 6 at multiple locations across Mississippi, including the Gulfport Combat Readiness Training Center and the Camp Shelby Joint Forces Training Center.",
      "title": "Air National Guard to Host Sentry South 26-2 Exercise Across Mississippi - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-19/cheshire-abbey-rescues-dogs-surrendered-during-raid-at-jackson-home": {
      "author": "Morgan Howard",
      "content_html": "<p>JACKSON – An animal rescue group called Cheshire Abbey said four dogs were surrendered to its care after local and federal law enforcement conducted a raid at a home in Jackson’s Fondren area earlier today.</p><p>Cheshire Abbey Animal Rescue said in a social media post that responders found four large dogs chained in the front of the home. The group alleged the chains were too short and too heavy, and that the dogs did not have proper shelter or water. The rescue also said the animals did not have required rabies vaccinations.</p><p>Rather than face potential citations, the people at the home relinquished the animals.</p><p>Cheshire Abbey said it is currently at capacity following recent cold-weather rescues and plans to board the dogs while they are assessed. The rescue said it evaluates animals before adoption and does not place aggressive dogs.</p><p>The group praised law enforcement partners involved in the response and asked the community for donations to help cover boarding and veterinary costs.</p><p>You can donate to their care on the rescue’s Facebook post by clicking below.</p><p>These rescues cannot do this by themselves. It takes a village to help the forgotten dogs discarded in Mississippi every single day. It is exhausting for a small group to do alone…so whether you skip your daily $5 coffee and donate, that or reach out and offer to foster, we challenge you to do something.</p><p>It can be something big or small…but please do something.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-19/cheshire-abbey-rescues-dogs-surrendered-during-raid-at-jackson-home",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/Graduation-photo-collage-1.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-19/cheshire-abbey-rescues-dogs-surrendered-during-raid-at-jackson-home",
      "pub_date": "Thu, 19 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-19T00:00:00+00:00",
      "summary": "JACKSON – An animal rescue group called Cheshire Abbey said four dogs were surrendered to its care after local and federal law enforcement conducted a raid at a home in Jackson’s Fondren area earlier today.",
      "title": "Cheshire Abbey Rescues Dogs Surrendered During Raid at Jackson Home - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-19/crime-stoppers-tupelo-police-seek-publics-help-identifying-suspects-in-walmart-jewelry-theft": {
      "author": "Morgan Howard",
      "content_html": "<p>TUPELO – Crime Stoppers of Northeast Mississippi and the Tupelo Police Department are asking for the public’s help identifying a suspect in a false pretense case involving the theft of jewelry from a Tupelo Walmart.</p><p>According to investigators, the incident occurred Feb. 11, 2026, at about 1:25 p.m. at Walmart, 2270 W. Main St. Police said two unknown men entered the store and went to the jewelry section, where they concealed multiple jewelry items.</p><p>Authorities said the suspects then left the store without paying. The total value of the stolen merchandise exceeded $5,000, according to Crime Stoppers.</p><p>Anyone with information is asked to call Crime Stoppers of Northeast Mississippi at 800-773-TIPS (8477) or submit an anonymous tip through the P3 Tips app. Crime Stoppers said tips that lead to an arrest could be eligible for a cash reward of up to $2,000.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-19/crime-stoppers-tupelo-police-seek-publics-help-identifying-suspects-in-walmart-jewelry-theft",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/Screenshot-2026-02-19-124508.png",
      "link": "https://darkhorsepressnow.com/news/2026-02-19/crime-stoppers-tupelo-police-seek-publics-help-identifying-suspects-in-walmart-jewelry-theft",
      "pub_date": "Thu, 19 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-19T00:00:00+00:00",
      "summary": "TUPELO – Crime Stoppers of Northeast Mississippi and the Tupelo Police Department are asking for the public’s help identifying a suspect in a false pretense case involving the theft of jewelry from a Tupelo Walmart.",
      "title": "Crime Stoppers, Tupelo police seek public’s help identifying suspects in Walmart jewelry theft - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-19/cybersecurity-attack-forces-ummc-to-close-statewide-clinics-cancel-outpatient-procedures": {
      "author": "Morgan Howard",
      "content_html": "<p>JACKSON – The University of Mississippi Medical Center said Thursday that a cybersecurity attack has taken many of its information technology systems offline, including access to its electronic medical records system, Epic.</p><p>In a public notice dated Feb. 19, UMMC said all of its clinic locations statewide are closed for the day.</p><p>UMMC said outpatient and ambulatory surgeries and procedures, along with imaging appointments, have been canceled and will be rescheduled.</p><p>Hospital services are continuing using downtime procedures, the medical center said.</p><p>UMMC said it will provide additional updates as more information becomes available and apologized for the disruption.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-19/cybersecurity-attack-forces-ummc-to-close-statewide-clinics-cancel-outpatient-procedures",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2022/12/ummc.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-19/cybersecurity-attack-forces-ummc-to-close-statewide-clinics-cancel-outpatient-procedures",
      "pub_date": "Thu, 19 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-19T00:00:00+00:00",
      "summary": "JACKSON – The University of Mississippi Medical Center said Thursday that a cybersecurity attack has taken many of its information technology systems offline, including access to its electronic medical records system, Epic.",
      "title": "Cybersecurity attack forces UMMC to close statewide clinics, cancel outpatient procedures - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-19/historic-photo-recreation-exhibition-lectures-highlight-mcs-200th-birthday-celebration": {
      "author": "Special to Darkhorse Press",
      "content_html": "<p>When Joseph H. Hamilton was considering what college to attend, his father made the young high school graduate a generous offer.</p><p>“He told me, ‘You can go to any school you want to in the country,’ but the only school he took me to see was Mississippi College,” Hamilton said</p><p>The senior Hamilton, a 1914 MC graduate, may have been a bit biased. But his son earned his undergraduate degree at MC in 1954 and went on to become an internationally celebrated scientist and world-class researcher who co-discovered new elements 113, 115 and 117 in the Periodic Table of Chemistry Elements. He even had the honor of naming atomic element 117 – Tennessine – in honor of his home state of Tennessee.</p><p>For decades, Hamilton kept a relic of his father’s college days in Clinton: a black-and-white photo of his father and his classmates standing in front of Provine Chapel on the day of their graduation. With the arrival of MC’s Bicentennial year, he thought the photo belonged at the University.</p><p>On the warm and sunny afternoon of Thursday, Feb. 12, dozens of current MC faculty, staff, students and alumni crowded in front of Provine Chapel to recreate that photo taken more than a century before. Seated right in front on a wooden pew was Joseph H. Hamilton, representing his father in the modern image: two generations of Hamiltons spread 112 years apart.</p><p>“It was a special occasion that honored him as well as all the graduates of MC,” Hamilton said of the photo recreation.</p><p>The photo followed a recognition of the chapel’s addition to the National Register of Historic Places by MC President Blake Thompson and Stephanie Busbea, dean of the School of Christian Studies, Humanities and the Arts.</p><p>Following many camera clicks, the Choctaw Marching Band played and the crowd sang “Happy Birthday” to MC as Thompson, Tushka, MC’s on-field personality, and student representatives blew out the candles on a three-tier Bicentennial birthday cake.</p><p>“This once-in-a-lifetime celebration of MC’s 200th birthday united generations of students, faculty, staff, alumni and friends,” Thompson said. “I’m deeply grateful for those who have shaped our story and are inspired by the legacy we carry forward as we begin our next 200 years together.”</p><p>The event kicked off MC’s Bicentennial Birthday Party and other celebratory events, which had been partially postponed by inclement weather during Founders Week in January.</p><p>Students on the Campus Programming Board and MC’s Office of Student Engagement hosted a Bicentennial Birthday Party in the Piazza and Jennings Courtyard that included 200 cupcakes, a photo booth, food and drink vendors, and other activities.</p><p>The “1826: The Exhibition,” which highlights the University’s rich history in a spectacular display created by the Institute for Southern Storytelling at MC, debuted in its namesake campus building, 1826. The exhibit will be open for visitors throughout the Bicentennial year.</p><p>The new Bicentennial Time Capsule, scheduled to be packed with dozens of MC artifacts and reopened sometime in the future, was on display in one of the campus’s historic buildings, Jennings Hall.</p><p>Students and alumni who toured the exhibition and time capsule were simply astounded.</p><p>Cody Scruggs, a sophomore computer science major from Terry, was fascinated by the exhibit’s display of technology used by MC students through the years, especially the old Macintosh personal computer and the early generation iPhone.</p><p>“Seeing all of these things paints a picture in your head of what life in a dorm room could have been like,” Scruggs said. “I’ve been passing by MC since I was 6 years old. Being able to say I was a student here for MC’s 200th birthday celebration is a privilege. Seeing all the different people who have been affiliated with MC being here to celebrate this is amazing.”</p><p>Clinton residents Mary Alta Clark, a 1971 MC graduate, and her daughter, Kim Clark Pigott, who graduated from MC in 1986, participated in the photo recreation and stayed to tour the exhibit. They both recognized items from their respective college days.</p><p>“I remember my grandmother talking about being at Hillman College, which is represented (in the exhibit),” Pigott said. “A lot of our friends and my ex-classmates, people who I know through my children, are represented. I just love it.”</p><p>“I loved the diorama of the campus,” Clark said. “It brings back a lot of old memories. I’ve enjoyed watching the different decades. I want to come back, take my time and read about everything.”</p><p>Livi Cate Osborne, a junior Christian Studies major from Birmingham, is the first in her family to attend MC. She said the Bicentennial celebration provides an opportunity for her to share the University’s rich history with her relatives.</p><p>“I’ve loved being at MC, and it means so much to show them this place that I’ve made a home for myself,” she said. “I love history, so it’s special for me to be a part of the next 200 years.”</p><p>That evening, MC’s Department of Christian Studies hosted a Bicentennial edition of the annual Evangelism Lecture. Shane Pruitt, national next gen director for the North American Mission Board, inspired audience members to take their faith seriously and to share their beliefs with the next generation.</p><p>After a “Meet and Greet” with Mississippi College’s first Black graduates, the African American Studies program at MC presented “Success Starts at Mississippi College: Chronicles of MC’s African American Contributions to 200 Years of Celebration.” Moderated by Ellis Liddell ’80, co-chair of the Bicentennial Celebration Committee, the event featured MC alumni panelists Larry Myricks ’79, Maggie Wade ’20, Regina Schofield ’83, Camryn Johnson ’22, and Aaron Feazelle ’20.</p><p>On Friday morning, Feb. 13, Liddell, fellow members of the Bicentennial Celebration Committee, and guests witnessed Thompson unveil a sign outside Alumni Hall acknowledging the support of those “who helped ensure the success of this historic (Bicentennial) celebration.”</p><p>During the brunch that followed, Jim Turcotte, MC vice president and special assistant to the president, recognized members of the Bicentennial Celebration Committee and Bicentennial Working Group and their efforts to make the Bicentennial Celebration a success.</p><p>“I am immensely grateful for the contributions of the MC Bicentennial Celebration Committee, the MC Bicentennial Working Group, and many other MC faculty, staff and student volunteers who have been the driving force behind our celebration activities,” Turcotte said. “I appreciate each of you and thank you from the bottom of my heart.”</p><p>Liddell closed by encouraging the committee members to continue telling the story of Mississippi College throughout its Bicentennial year and beyond.</p><p>“There’s a certain culture that we have as a result of who we are and how we grew up here,” Liddell said. “We must take that culture and share it with the rest of the world. This college has a purpose, and that’s what makes Mississippi College special.”</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-19/historic-photo-recreation-exhibition-lectures-highlight-mcs-200th-birthday-celebration",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/MC.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-19/historic-photo-recreation-exhibition-lectures-highlight-mcs-200th-birthday-celebration",
      "pub_date": "Thu, 19 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-19T00:00:00+00:00",
      "summary": "When Joseph H. Hamilton was considering what college to attend, his father made the young high school graduate a generous offer.",
      "title": "Historic photo recreation, exhibition, lectures highlight MC’s 200th birthday celebration - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-19/jackson-police-seek-suspect-in-two-burglaries-at-hometown-bbq": {
      "author": "Therese Apel",
      "content_html": "<p>JACKSON — Jackson Police Department is asking for the public’s help identifying a suspect linked to two burglaries at a local restaurant earlier this month.</p><p>Police said Hometown BBQ, located at 3152 Medgar Evers Blvd., was first burglarized Feb. 2. The business was targeted again on Feb. 14.</p><p>According to investigators, surveillance footage indicates the same individual may be responsible for both break-ins.</p><p>Authorities released video from the incidents and said the investigation remains ongoing.</p><p>Anyone with information is urged to contact the Jackson Police Department at 601-960-1234 or Crime Stoppers at 601-355-TIPS (8477).</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-19/jackson-police-seek-suspect-in-two-burglaries-at-hometown-bbq",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/Screenshot-2026-02-19-150713.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-19/jackson-police-seek-suspect-in-two-burglaries-at-hometown-bbq",
      "pub_date": "Thu, 19 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-19T00:00:00+00:00",
      "summary": "JACKSON — Jackson Police Department is asking for the public’s help identifying a suspect linked to two burglaries at a local restaurant earlier this month.",
      "title": "Jackson Police Seek Suspect in Two Burglaries at Hometown BBQ - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-19/man-found-shot-to-death-after-domestic-disturbance-in-george-county": {
      "author": "Therese Apel",
      "content_html": "<p>GEORGE COUNTY — A 60-year-old man was found shot to death Friday night following a reported domestic violence altercation at a residence in the Central community, authorities said.</p><p>The George County Sheriff’s Office said deputies were dispatched at approximately 8:27 p.m. to the 100 block of Brock Road after receiving a 911 call from a 57-year-old woman reporting a domestic disturbance and a shooting at her home.</p><p>When deputies arrived, they made contact with the caller and discovered the man outside the residence suffering from an apparent gunshot wound. He was pronounced dead at the scene.</p><p>Investigators with the sheriff’s office Criminal Investigations Division responded and began processing evidence.</p><p>The woman was transported by ambulance under police escort to George County Regional Hospital for treatment of injuries sustained during the altercation. After being treated and released, she was interviewed by investigators and later released.</p><p>Authorities said there is no evidence at this time indicating any other individuals were directly involved in the incident.</p><p>The investigation remains active, and officials said no further details will be released to protect the integrity of the case.</p><p>Sheriff Keith Mixon is asking anyone with information about the shooting to contact the George County Sheriff’s Office Criminal Investigations Division at 601-947-4811.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-19/man-found-shot-to-death-after-domestic-disturbance-in-george-county",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2023/07/george-county-e1690222530949.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-19/man-found-shot-to-death-after-domestic-disturbance-in-george-county",
      "pub_date": "Thu, 19 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-19T00:00:00+00:00",
      "summary": "GEORGE COUNTY — A 60-year-old man was found shot to death Friday night following a reported domestic violence altercation at a residence in the Central community, authorities said.",
      "title": "Man Found Shot to Death After Domestic Disturbance in George County - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-19/man-found-shot-to-death-in-vacant-skyline-drive-home": {
      "author": "Therese Apel",
      "content_html": "<p>JACKSON — A man believed to have been reported missing earlier in the day was found shot to death Tuesday night inside a vacant residence in the 3600 block of Skyline Drive, authorities said.</p><p>Interim Police Chief and Hinds County Sheriff Tyree Jones said officers responded shortly after 9 p.m. after receiving information that a missing person might be at or near the location. Upon arrival, officers found a Black male deceased inside the vacant property.</p><p>“It’s apparent that he had been shot at least once,” Jones said during a press conference at the scene.</p><p>The killing marks Jackson’s eighth homicide of the year.</p><p>Authorities believe the victim may be the same individual reported missing earlier Tuesday in Jackson. However, Jones said investigators are awaiting formal identification and family notification before releasing the name. The victim is believed to be in his early 30s.</p><p>Investigators also reported that a 2020 gray Nissan Sentra belonging to the victim is missing from the scene.</p><p>Jones said officers were alerted to the area based on information that the missing person could be nearby. Family members of the missing individual were also in the area and spoke with officers, leading to the discovery of the body inside the vacant home.</p><p>Police do not believe the victim lived at the residence and said the property is unoccupied. Investigators are working to determine why the victim was at the location and what connection, if any, exists between him and the property.</p><p>Authorities have not identified a motive and said the case remains under investigation.</p><p>Anyone with information is asked to contact the Jackson Police Department.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-19/man-found-shot-to-death-in-vacant-skyline-drive-home",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2023/01/crimeeee.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-19/man-found-shot-to-death-in-vacant-skyline-drive-home",
      "pub_date": "Thu, 19 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-19T00:00:00+00:00",
      "summary": "JACKSON — A man believed to have been reported missing earlier in the day was found shot to death Tuesday night inside a vacant residence in the 3600 block of Skyline Drive, authorities said.",
      "title": "Man Found Shot to Death in Vacant Skyline Drive Home - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-19/meridian-police-department-makes-first-arrest-under-mississippi-grooming-statute": {
      "author": "Cash Matlock",
      "content_html": "<p>MERIDIAN – The Meridian Police Department has made its first arrest under Mississippi’s Grooming of a Child statute, marking what officials described as a significant milestone for the department.</p><p>Dennis Palmer was arrested Feb. 18 with assistance from the Lauderdale County Sheriff’s Department and the East Mississippi Drug Task Force. He was wanted on charges of Grooming of a Child under Mississippi State Code § 97-5-32 and Procurement of Sexual Servitude of a Minor under Mississippi State Code § 97-3-54.</p><p>The Grooming of a Child statute was enacted in July 2025 by the state of Mississippi. Authorities said this is the first arrest made by the Meridian Police Department under the new law.</p><p>Bond was set at $1 million, according to the department.</p><p>The case was investigated by the Meridian Police Department’s Human Trafficking/ICAC Unit, with assistance from the department’s Gang Unit, SWAT Team and K-9 Unit.</p><p>Officials said the arrest underscores the department’s ongoing efforts to protect children and hold accountable those accused of exploiting minors. The department said it will continue working with law enforcement partners to pursue similar cases in the future.</p><p>Palmer is presumed innocent unless and until proven guilty in a court of law.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-19/meridian-police-department-makes-first-arrest-under-mississippi-grooming-statute",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/Untitled-design-2026-02-19T085653.798.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-19/meridian-police-department-makes-first-arrest-under-mississippi-grooming-statute",
      "pub_date": "Thu, 19 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-19T00:00:00+00:00",
      "summary": "MERIDIAN – The Meridian Police Department has made its first arrest under Mississippi’s Grooming of a Child statute, marking what officials described as a significant milestone for the department.",
      "title": "Meridian Police Department makes first arrest under Mississippi grooming statute - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-19/nonprofit-honors-fallen-lee-county-deputy-rick-haggard-with-dog-tag-necklaces-gifts": {
      "author": "Morgan Howard",
      "content_html": "<p>ATLANTA — A global nonprofit organization said it has honored fallen Lee County Deputy Sheriff and school resource officer Rick Haggard, who was struck and killed by a vehicle earlier this month while directing traffic in front of Shannon Elementary School in Shannon.</p><p>Point 27, based in Georgia, said in a statement dated Feb. 19, 2026, that it sent Thin Blue Line “Shields of Strength” dog-tag necklaces to the Lee County Sheriff’s Office for Haggard’s partner and officers who served closely with him. The organization said the tags are inscribed with Matthew 5:9.</p><p>The nonprofit also said it provided Haggard’s family with keepsake folded-flag pendant necklaces inscribed with John 15:13.</p><p>“We want law enforcement officers and their families to know we value them and their sacrifices, that God loves them, and that they are never alone,” said Point 27 Director Col. Dodd, a retired U.S. Army officer, in the statement.</p><p>Point 27 said Dodd served 27 years in the military and founded the organization in 2014 to provide scripture-inscribed dog tags to members of the military, veterans and law enforcement.</p><p>Haggard died Feb. 2 while directing traffic outside Shannon Elementary School, the release said. A spokesperson listed for additional information was Marcia Davis.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-19/nonprofit-honors-fallen-lee-county-deputy-rick-haggard-with-dog-tag-necklaces-gifts",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/Point-27-Thin-blue-line-DogTag-and-Folded-Flag-Shields-of-Strength-Copy-3-Copy-1.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-19/nonprofit-honors-fallen-lee-county-deputy-rick-haggard-with-dog-tag-necklaces-gifts",
      "pub_date": "Thu, 19 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-19T00:00:00+00:00",
      "summary": "ATLANTA — A global nonprofit organization said it has honored fallen Lee County Deputy Sheriff and school resource officer Rick Haggard, who was struck and killed by a vehicle earlier this month while directing traffic in front of Shannon Elementary School in Shannon.",
      "title": "Nonprofit honors fallen Lee County deputy Rick Haggard with dog tag necklaces, gifts - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-19/officer-prisoner-killed-in-i-10-crash-involving-transport-van-in-jackson-county": {
      "author": "Morgan Howard",
      "content_html": "<p>JACKSON COUNTY – A prisoner and a transport officer were killed and three other people were seriously injured Wednesday morning when a private prisoner transport van crashed on Interstate 10 in Jackson County, according to WLOX.</p><p>WLOX reported the crash happened around 9:30 a.m. in the westbound lanes of I-10 near the Ocean Springs Exit 50 ramp to Mississippi Highway 609. The van struck a pole, overturned and collided with a utility truck.</p><p>The Mississippi Highway Patrol said there were four people inside the transport van and one person in the utility truck. Two people in the van, an officer and a prisoner, died, and the other two occupants in the van were critically injured, WLOX reported.</p><p>The utility truck driver was taken to a local hospital in stable condition.</p><p>WLOX reported a medical helicopter was called to transport one of the most critically injured victims. After the crash, the van caught fire, and the Jackson County Sheriff’s Office arrived first and put out the fire, according to the station. Jackson County Fire then cut into the van to rescue those inside.</p><p>The transport van was operated by St. Joseph Services, a private prisoner transport company, WLOX reported. The station said the trip began Tuesday night and involved prisoners picked up in Florida, with planned destinations including Ocean City, New Jersey, and Spaulding, Georgia. The van was also in Mississippi to pick up an inmate from the Harrison County Adult Detention Center when it crashed, according to the report.</p><p>Multiple agencies responded and a crash reconstruction was conducted. The cause of the crash had not been released as of Wednesday, WLOX reported.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-19/officer-prisoner-killed-in-i-10-crash-involving-transport-van-in-jackson-county",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2024/01/fatal-crash-4.png",
      "link": "https://darkhorsepressnow.com/news/2026-02-19/officer-prisoner-killed-in-i-10-crash-involving-transport-van-in-jackson-county",
      "pub_date": "Thu, 19 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-19T00:00:00+00:00",
      "summary": "JACKSON COUNTY – A prisoner and a transport officer were killed and three other people were seriously injured Wednesday morning when a private prisoner transport van crashed on Interstate 10 in Jackson County, according to WLOX.",
      "title": "Officer, prisoner killed in I-10 crash involving transport van in Jackson County - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-19/sheriff-no-more-deputies-standing-in-roadway-for-shannon-school-traffic-control": {
      "author": "Morgan Howard",
      "content_html": "<p>LEE COUNTY — The Lee County Sheriff’s Office said it will no longer place deputies in the middle of a highway to direct school traffic at Shannon Primary and Shannon Elementary schools, citing safety concerns.</p><p>In a statement, Sheriff Jim H. Johnson said the change is effective immediately and follows what he described as the recent loss of two school resource officers and another close call Monday morning.</p><p>Lee County deputy killed after being struck by vehicle near Shannon School</p><p>Johnson said the sheriff’s office is meeting with the school district superintendent and staff, along with representatives from the Mississippi Department of Transportation, to evaluate safer traffic options.</p><p>The sheriff said agencies are working together to implement changes aimed at improving traffic flow while protecting deputies, students, staff and families.</p><p>Johnson urged parents and guardians to allow extra time for student drop-off and pick-up as the changes are developed and put in place.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-19/sheriff-no-more-deputies-standing-in-roadway-for-shannon-school-traffic-control",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/lee-countytyty.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-19/sheriff-no-more-deputies-standing-in-roadway-for-shannon-school-traffic-control",
      "pub_date": "Thu, 19 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-19T00:00:00+00:00",
      "summary": "LEE COUNTY — The Lee County Sheriff’s Office said it will no longer place deputies in the middle of a highway to direct school traffic at Shannon Primary and Shannon Elementary schools, citing safety concerns.",
      "title": "Sheriff: No more deputies standing in roadway for Shannon school traffic control - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-19/street-sweeper-driver-killed-in-collision-with-18-wheeler-in-lowndes-county": {
      "author": "Morgan Howard",
      "content_html": "<p>LOWNDES COUNTY — The driver of a street sweeper was killed Wednesday afternoon in a crash involving an 18-wheeler on Industrial Park Road, according to the Lowndes County Sheriff’s Office.</p><p>Deputies responded to the crash at about 3 p.m. Feb. 18, 2026. A preliminary investigation indicates the street sweeper driver was fatally injured in the collision, authorities said.</p><p>The sheriff’s office said the 18-wheeler driver was not reported to have suffered life-threatening injuries.</p><p>Emergency responders and investigators remained at the scene for several hours while the crash was investigated and the roadway was cleared. Traffic on Industrial Park Road was temporarily affected.</p><p>The identity of the person killed is being withheld pending notification of next of kin.</p><p>The crash remains under investigation. Anyone with information is asked to contact the Lowndes County Sheriff’s Office.</p><p>“Our thoughts and prayers are with the victim’s family during this difficult time,” Sheriff Eddie Hawkins said in a statement. “We ask motorists to remain cautious and attentive, especially around commercial and maintenance vehicles operating on our roadways.”</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-19/street-sweeper-driver-killed-in-collision-with-18-wheeler-in-lowndes-county",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2025/08/shutterstock_722099620-e1755792249812.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-19/street-sweeper-driver-killed-in-collision-with-18-wheeler-in-lowndes-county",
      "pub_date": "Thu, 19 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-19T00:00:00+00:00",
      "summary": "LOWNDES COUNTY — The driver of a street sweeper was killed Wednesday afternoon in a crash involving an 18-wheeler on Industrial Park Road, according to the Lowndes County Sheriff’s Office.",
      "title": "Street sweeper driver killed in collision with 18-wheeler in Lowndes County - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-19/study-absolutely-nobody-checked-on-12659-mississippi-seniors-in-january": {
      "author": "Therese Apel",
      "content_html": "<p>JACKSON — Nearly one-third of Mississippi seniors who live alone went the entire month of January without a single meaningful check-in, underscoring concerns about what health officials have called a growing loneliness epidemic in America.</p><p>A new survey by Choice Mutual found that 32% of Mississippi residents age 65 and older who live alone reported no one had checked on them since Jan. 1. That equates to an estimated 12,659 seniors statewide who experienced a full month without meaningful social contact.</p><p>The findings come as national health experts warn that chronic loneliness can carry health risks comparable to smoking heavily. U.S. leaders, including the former U.S. surgeon general, have described social isolation as a public health crisis, particularly among older Americans.</p><p>Choice Mutual surveyed 3,025 seniors nationwide at the end of January, asking a single question: “Has anyone checked in on you since January 1?”</p><p>Overall, 26% said no, and Mississippi’s rate exceeded the national average.</p><p>The survey identified the five states with the highest share of seniors living alone who reported zero check-ins in January: Wyoming and Oklahoma at 50%, followed by Louisiana at 44%, and Arizona and Connecticut at 42%.</p><p>Beyond the headline number, the survey painted a broader picture of winter isolation.</p><p>Among seniors living alone nationwide:</p><p>The emotional toll appears to run deep. Sixty-eight percent said they feel forgotten or invisible during the winter. Nearly three in 10, or 29%, said they do not have even one person they can confide in during difficult times.</p><p>More than half, 58%, said they worry their loneliness is harming their health, and 62% reported that isolation affected their physical or mental health this winter.</p><p>Even seniors who do not live alone are not immune. The survey found that 65% of older adults who live with a partner still sometimes feel alone.</p><p>Anthony Martin, founder of Choice Mutual , said the results should be viewed as a warning.</p><p>“Loneliness is often dismissed as a soft issue, but the numbers show it’s anything but,” Martin said. “When a quarter of seniors go a full month without a check-in, that’s not just a social concern — it’s a public-health warning light.”</p><p>He said many seniors are not seeking major interventions, but simple connection.</p><p>“In many cases, a simple phone call or knock on the door would make a meaningful difference,” Martin said.</p><p>The survey also highlighted how difficult it can be for seniors to break the cycle of isolation. While 28% said they are very likely to reach out when feeling lonely, 40% said they are unlikely or very unlikely to do so.</p><p>Still, 64% said their well-being would improve if someone reached out more often.</p><p>As winter continues and social isolation remains a concern nationwide, advocates say small acts of connection — a call, a visit or a check-in — may be among the most powerful tools to combat what many now consider one of the country’s most overlooked health threats.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-19/study-absolutely-nobody-checked-on-12659-mississippi-seniors-in-january",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/shutterstock_1012812838.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-19/study-absolutely-nobody-checked-on-12659-mississippi-seniors-in-january",
      "pub_date": "Thu, 19 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-19T00:00:00+00:00",
      "summary": "JACKSON — Nearly one-third of Mississippi seniors who live alone went the entire month of January without a single meaningful check-in, underscoring concerns about what health officials have called a growing loneliness epidemic in America.",
      "title": "Study: Absolutely nobody checked on 12,659 Mississippi seniors in January - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-19/tate-county-sheriffs-office-k-9s-soul-and-stuccie-receive-donated-body-armor": {
      "author": "Morgan Howard",
      "content_html": "<p>SENATOBIA — The Tate County Sheriff’s Office said its K-9s, Soul and Stuccie, have received new bullet- and stab-protective vests through a donation arranged by the nonprofit Vested Interest in K9s Inc.</p><p>The sheriff’s office said the vests were sponsored by Don and Misty Fike of Galesburg, Illinois, and embroidered with the message: “Born to Love- Trained to Serve-Loyal Always.”</p><p>Vested Interest in K9s Inc., founded in 2009, is a 501(c)(3) organization that provides protective vests and other assistance to law enforcement K-9s nationwide. The group said the vests are U.S.-made, custom-fitted and certified to National Institute of Justice standards.</p><p>Since its founding, the nonprofit said it has provided more than 6,225 vests valued at about $6.9 million to K-9s in all 50 states through private and corporate donations.</p><p>The organization said its program is open to U.S. law enforcement dogs that are at least 20 months old and actively employed and certified, and K-9s with expired vests may also be eligible.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-19/tate-county-sheriffs-office-k-9s-soul-and-stuccie-receive-donated-body-armor",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/639155451_122255367278177884_3418483661092897555_n.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-19/tate-county-sheriffs-office-k-9s-soul-and-stuccie-receive-donated-body-armor",
      "pub_date": "Thu, 19 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-19T00:00:00+00:00",
      "summary": "SENATOBIA — The Tate County Sheriff’s Office said its K-9s, Soul and Stuccie, have received new bullet- and stab-protective vests through a donation arranged by the nonprofit Vested Interest in K9s Inc.",
      "title": "Tate County Sheriff’s Office K-9s Soul and Stuccie receive donated body armor - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-19/thursday-weather-cloudy-and-warm-slight-chance-of-rain-later": {
      "author": "Mary Apel",
      "content_html": "",
      "guid": "https://darkhorsepressnow.com/news/2026-02-19/thursday-weather-cloudy-and-warm-slight-chance-of-rain-later",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/Weather-12.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-19/thursday-weather-cloudy-and-warm-slight-chance-of-rain-later",
      "pub_date": "Thu, 19 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-19T00:00:00+00:00",
      "summary": "Isolated severe storms will be possibly on Saturday as a frontal boundary move across the area. Damaging winds up to 60 mph will be the main hazard.",
      "title": "Thursday Weather: Cloudy and warm, slight chance of rain later - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-19/two-arrested-third-sought-in-pearl-river-county-drive-by-shooting-investigation": {
      "author": "Morgan Howard",
      "content_html": "<p>PEARL RIVER COUNTY – Two people have been arrested and a third is being sought in connection with a drive-by shooting investigation in Pearl River County, according to the Pearl River County Sheriff’s Office.</p><p>Deputies responded Feb. 9, 2026, to Highland Hospital after a male victim arrived with a gunshot wound, authorities said. Investigators later determined the shooting occurred near the intersection of Mississippi Highway 53 and Barth Road in Poplarville.</p><p>The sheriff’s office said the suspected gunman was identified as Austyn Reynolds, and investigators also identified a Nissan Altima as the suspected vehicle involved.</p><p>Authorities said Michelle Rogers was identified as an accomplice who allegedly helped Reynolds attempt to evade law enforcement after the shooting.</p><p>In a coordinated effort between the Pearl River County Sheriff’s Office and the Bogalusa Police Department, Reynolds and Rogers were taken into custody without incident, the sheriff’s office said.</p><p>Investigators later determined that Shyanne Thibodeaux also assisted Reynolds and Rogers in evading law enforcement after the shooting, authorities said. An arrest warrant remains outstanding for Thibodeaux, the sheriff’s office said.</p><p>Reynolds was arrested and charged with drive-by shooting under Mississippi Code Section 97-3-109(1). Rogers was charged with accessory after the fact to drive-by shooting under Mississippi Code Section 97-1-5(1)(a)(i), authorities said. Thibodeaux faces an outstanding warrant for accessory after the fact to drive-by shooting under the same statute, officials said.</p><p>Sheriff David Allison thanked the Bogalusa Police Department and the Hancock County Sheriff’s Office for assisting in the investigation and said deputies and investigators worked to resolve what he described as a violent crime.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-19/two-arrested-third-sought-in-pearl-river-county-drive-by-shooting-investigation",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/638390225_1284655553685925_2289238445389970520_n.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-19/two-arrested-third-sought-in-pearl-river-county-drive-by-shooting-investigation",
      "pub_date": "Thu, 19 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-19T00:00:00+00:00",
      "summary": "PEARL RIVER COUNTY – Two people have been arrested and a third is being sought in connection with a drive-by shooting investigation in Pearl River County, according to the Pearl River County Sheriff’s Office.",
      "title": "Two arrested, third wanted in Pearl River County drive-by shooting investigation - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-19/woman-charged-after-man-shot-at-apartment-complex-in-greenville": {
      "author": "Morgan Howard",
      "content_html": "<p>GREENVILLE – A Greenville woman has been charged after police said a man was shot during a domestic dispute Tuesday at Riverwalk Apartments.</p><p>Officers with the Greenville Police Department responded Feb. 17 to a report of a shooting at 738 W. Union St., police said. When officers arrived, they made contact with a female inside the residence, who told them a male victim was in the bathroom with a gunshot wound.</p><p>The victim was transported to Delta Health System for treatment. Police said additional details about the circumstances surrounding the shooting remain under investigation.</p><p>Investigators charged 28-year-old Larineisha Askew of Greenville with one count of domestic aggravated assault. She is awaiting her initial appearance, police said.</p><p>All suspects are presumed innocent unless proven guilty.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-19/woman-charged-after-man-shot-at-apartment-complex-in-greenville",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2025/10/shutterstock_2230644523.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-19/woman-charged-after-man-shot-at-apartment-complex-in-greenville",
      "pub_date": "Thu, 19 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-19T00:00:00+00:00",
      "summary": "GREENVILLE – A Greenville woman has been charged after police said a man was shot during a domestic dispute Tuesday at Riverwalk Apartments.",
      "title": "Woman charged after man shot at apartment complex in Greenville - Darkhorse Press"
    }
  },
  "last_run_utc": "2026-02-20T03:08:25.659734+00:00",
  "seen_urls": [
    "https://darkhorsepressnow.com/news/2026-02-19/air-national-guard-to-host-sentry-south-26-2-exercise-across-mississippi",
    "https://darkhorsepressnow.com/news/2026-02-19/nonprofit-honors-fallen-lee-county-deputy-rick-haggard-with-dog-tag-necklaces-gifts",
    "https://darkhorsepressnow.com/news/2026-02-19/man-found-shot-to-death-after-domestic-disturbance-in-george-county",
    "https://darkhorsepressnow.com/news/2026-02-19/historic-photo-recreation-exhibition-lectures-highlight-mcs-200th-birthday-celebration",
    "https://darkhorsepressnow.com/news/2026-02-19/jackson-police-seek-suspect-in-two-burglaries-at-hometown-bbq",
    "https://darkhorsepressnow.com/news/2026-02-19/study-absolutely-nobody-checked-on-12659-mississippi-seniors-in-january",
    "https://darkhorsepressnow.com/news/2026-02-19/cheshire-abbey-rescues-dogs-surrendered-during-raid-at-jackson-home",
    "https://darkhorsepressnow.com/news/2026-02-19/sheriff-no-more-deputies-standing-in-roadway-for-shannon-school-traffic-control",
    "https://darkhorsepressnow.com/news/2026-02-19/woman-charged-after-man-shot-at-apartment-complex-in-greenville",
    "https://darkhorsepressnow.com/news/2026-02-19/tate-county-sheriffs-office-k-9s-soul-and-stuccie-receive-donated-body-armor",
    "https://darkhorsepressnow.com/news/2026-02-19/crime-stoppers-tupelo-police-seek-publics-help-identifying-suspects-in-walmart-jewelry-theft",
    "https://darkhorsepressnow.com/news/2026-02-19/street-sweeper-driver-killed-in-collision-with-18-wheeler-in-lowndes-county",
    "https://darkhorsepressnow.com/news/2026-02-19/meridian-police-department-makes-first-arrest-under-mississippi-grooming-statute",
    "https://darkhorsepressnow.com/news/2026-02-19/cybersecurity-attack-forces-ummc-to-close-statewide-clinics-cancel-outpatient-procedures",
    "https://darkhorsepressnow.com/news/2026-02-19/two-arrested-third-sought-in-pearl-river-county-drive-by-shooting-investigation",
    "https://darkhorsepressnow.com/news/2026-02-19/officer-prisoner-killed-in-i-10-crash-involving-transport-van-in-jackson-county",
    "https://darkhorsepressnow.com/news/2026-02-19/man-found-shot-to-death-in-vacant-skyline-drive-home",
    "https://darkhorsepressnow.com/news/2026-02-19/thursday-weather-cloudy-and-warm-slight-chance-of-rain-later",
    "https://darkhorsepressnow.com/news/2026-02-18/three-arrested-after-joint-narcotics-operation-in-forrest-lamar-county",
    "https://darkhorsepressnow.com/news/2026-02-18/suspect-in-raymond-road-homicide-given-no-bond-on-murder-charge",
    "https://darkhorsepressnow.com/news/2026-02-18/jones-county-crash-suspect-faces-dui-charges-ice-detainer-leads-to-transfer-from-detention-facility",
    "https://darkhorsepressnow.com/news/2026-02-18/father-charged-with-child-neglect-after-6-year-old-injured-in-greenville-shooting",
    "https://darkhorsepressnow.com/news/2026-02-18/woman-charged-after-domestic-stabbing-in-lamar-county",
    "https://darkhorsepressnow.com/news/2026-02-18/tupelo-man-sentenced-to-25-years-after-guilty-plea-in-2023-killing",
    "https://darkhorsepressnow.com/news/2026-02-18/natchez-woman-charged-in-atv-theft-investigation-on-scheffel-road",
    "https://darkhorsepressnow.com/news/2026-02-18/student-taken-into-custody-after-handgun-found-in-vehicle-at-alcorn-central-high-school",
    "https://darkhorsepressnow.com/news/2026-02-18/pony-ride-day-set-for-april-4-at-strong-river-equine-center-in-brandon",
    "https://darkhorsepressnow.com/news/2026-02-18/salvation-army-to-host-1920s-themed-senior-prom-in-jackson",
    "https://darkhorsepressnow.com/news/2026-02-18/southern-pines-waives-reduces-dog-adoption-fees-during-weekend-event",
    "https://darkhorsepressnow.com/news/2026-02-18/como-man-sentenced-to-5-years-in-federal-prison-for-cocaine-distribution",
    "https://darkhorsepressnow.com/news/2026-02-18/starkville-derby-dachshund-race-set-for-record-turnout-april-25",
    "https://darkhorsepressnow.com/news/2026-02-18/teen-arrested-charged-with-capital-murder-in-fatal-grove-circle-shooting",
    "https://darkhorsepressnow.com/news/2026-02-18/jackson-woman-arrested-in-fatal-shooting-at-chapel-ridge-apartments",
    "https://darkhorsepressnow.com/news/2026-02-18/wednesday-weather-mostly-cloudy-and-warm-with-near-record-highs",
    "https://darkhorsepressnow.com/news/2026-02-17/saltillo-man-charged-with-felony-marijuana-trafficking-hydrocodone-possession-after-tupelo-stop",
    "https://darkhorsepressnow.com/news/2026-02-17/tupelo-police-investigate-shooting-that-injured-juvenile-on-fillmore-drive",
    "https://darkhorsepressnow.com/news/2026-02-17/inmate-dies-after-being-found-unresponsive-in-alcorn-county-jail-cell",
    "https://darkhorsepressnow.com/news/2026-02-17/nettleton-man-charged-with-sexual-battery-of-child-under-14",
    "https://darkhorsepressnow.com/news/2026-02-17/jackson-police-seek-missing-32-year-old-man-last-seen-sunday",
    "https://darkhorsepressnow.com/news/2026-02-17/clinton-nature-center-to-host-spring-break-bird-camp-for-ages-9-12",
    "https://darkhorsepressnow.com/news/2026-02-17/update-man-found-dead-outside-jackson-apartment-complex-on-raymond-road-identified",
    "https://darkhorsepressnow.com/news/2026-02-17/jackson-state-awarded-14-5-million-nih-contract-to-extend-jackson-heart-study-training-center",
    "https://darkhorsepressnow.com/news/2026-02-17/jackson-police-investigate-fatal-hit-and-run-involving-man-in-wheelchair-on-mcdowell-road",
    "https://darkhorsepressnow.com/news/2026-02-17/arkansas-fugitive-found-in-rankin-county-after-controlled-drug-buy",
    "https://darkhorsepressnow.com/news/2026-02-17/driver-dies-after-vehicle-crashes-into-natchez-church",
    "https://darkhorsepressnow.com/news/2026-02-17/random-acts-of-kindness-day-encourages-small-gestures-with-big-impact",
    "https://darkhorsepressnow.com/news/2026-02-17/harrison-county-deputies-seek-suspect-in-attempted-business-break-in",
    "https://darkhorsepressnow.com/news/2026-02-17/oxford-lafayette-community-assistance-fund-launched-to-aid-winter-storm-fern-recovery",
    "https://darkhorsepressnow.com/news/2026-02-16/rodeo-royalty-bullfighters-visit-st-dominic-nicu-during-dixie-national-week",
    "https://darkhorsepressnow.com/news/2026-02-16/police-seek-publics-help-finding-missing-101-year-old-gulfport-man",
    "https://darkhorsepressnow.com/news/2026-02-19/man-found-dead-after-reported-domestic-altercation-in-george-county",
    "https://darkhorsepressnow.com/news/2026-02-16/gulfport-teen-charged-with-aggravated-assault-in-shooting-of-14-year-old",
    "https://darkhorsepressnow.com/news/2026-02-16/public-asked-to-help-identify-individual-in-recent-vicksburg-shooting",
    "https://darkhorsepressnow.com/news/2026-02-16/silver-alert-issued-for-missing-63-year-old-vicksburg-man",
    "https://darkhorsepressnow.com/news/2026-02-16/man-shot-multiple-times-in-jackson-drives-himself-to-safety",
    "https://darkhorsepressnow.com/news/2026-02-16/adams-county-deputies-recover-dirt-bike-reported-stolen-in-louisiana-in-2022",
    "https://darkhorsepressnow.com/news/2026-02-16/biloxi-police-seek-help-identifying-suspect-in-petit-larceny-case",
    "https://darkhorsepressnow.com/news/2026-02-16/natchez-man-found-dead-after-vehicle-crashes-into-tree",
    "https://darkhorsepressnow.com/news/2026-02-16/ocean-springs-police-seek-woman-wanted-on-felony-exploitation-charge",
    "https://darkhorsepressnow.com/news/2026-02-16/woman-arrested-on-felony-drug-and-child-endangerment-charges-at-fulton-safety-checkpoint",
    "https://darkhorsepressnow.com/news/2026-02-16/two-ef1-tornadoes-confirmed-in-lincoln-county-nws-storm-surveys-continue",
    "https://darkhorsepressnow.com/news/2026-02-16/man-found-shot-to-death-in-jackson-apartment-complex-parking-lot",
    "https://darkhorsepressnow.com/news/2026-02-16/presidents-day-weather-temps-warming-to-the-60s",
    "https://darkhorsepressnow.com/news/2026-02-16/celebrate-the-day-do-something-kind-for-the-grouch-in-your-life",
    "https://darkhorsepressnow.com/news/2026-02-16/missing-in-mississippi-vickie-ellington-attala-county-2",
    "https://darkhorsepressnow.com/news/2026-02-14/mbi-probes-officer-involved-shooting-near-crestview-street-in-jackson",
    "https://darkhorsepressnow.com/news/2026-02-13/natchez-man-arrested-on-statutory-rape-warrant-in-adams-county",
    "https://darkhorsepressnow.com/news/top-story/2026-02-13/vehicle-crashes-into-indianola-walmart-four-injured",
    "https://darkhorsepressnow.com/news/2026-02-13/reward-offered-for-missing-french-bulldog-last-seen-near-old-rice-road-in-canton",
    "https://darkhorsepressnow.com/news/2026-02-13/jackson-police-seek-publics-help-identifying-suspects-in-attempted-copper-theft",
    "https://darkhorsepressnow.com/news/top-story/2026-02-13/human-trafficking-investigation-in-pascagoula-leads-to-arrests-charges-against-66-year-old-man",
    "https://darkhorsepressnow.com/news/2026-02-13/waynesboro-man-arrested-after-near-head-on-encounter-with-jones-county-deputy"
  ]
}