{
  "items": {
    "https://darkhorsepressnow.com/news/2026-02-18/suspect-in-raymond-road-homicide-given-no-bond-on-murder-charge": {
      "author": "Morgan Howard",
      "content_html": "<p>JACKSON – A suspect in Jackson’s seventh homicide of the year appeared in municipal court Wednesday and was ordered held without bond on a murder charge, according to the Jackson Police Department.</p><p>Police said Jamecia Harper appeared before a municipal court judge on Feb. 18, 2026, in connection with Homicide No. 7, which investigators have linked to a case in the 1600 block of Raymond Road.</p><p>Authorities said Harper received a $50,000 bond on a charge of convicted felon in possession of a firearm and was denied bond on the murder charge.</p><p>The case remains under investigation. Anyone with information is asked to contact the Jackson Police Department at 601-960-1234 or Crime Stoppers at 601-355-TIPS (8477).</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-18/suspect-in-raymond-road-homicide-given-no-bond-on-murder-charge",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/Screenshot-2026-02-18-075332.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-18/suspect-in-raymond-road-homicide-given-no-bond-on-murder-charge",
      "pub_date": "Wed, 18 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-18T00:00:00+00:00",
      "summary": "JACKSON – A suspect in Jackson’s seventh homicide of the year appeared in municipal court Wednesday and was ordered held without bond on a murder charge, according to the Jackson Police Department.",
      "title": "Suspect in Raymond Road homicide given no bond on murder charge - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-18/teen-arrested-charged-with-capital-murder-in-fatal-grove-circle-shooting": {
      "author": "Therese Apel",
      "content_html": "<p>UPDATE: On Wednesday, Javeon Wilson appeared before a Municipal Court Judge and received a $250K bond for the charge of Aggravated Assault and no bond for the Capital Murder charge.</p><p>JACKSON — A 17-year-old has been arrested and charged with capital murder in connection with a February shooting at a Jackson apartment complex that left one man dead and another injured, police said.</p><p>Jackson Police Department officials announced that Javeon Wilson, 17, has been taken into custody by the department’s Robbery/Homicide Unit. Wilson is charged with capital murder and aggravated assault in the death of Glen Blackwell III and the wounding of a second victim.</p><p>Wilson was booked into city holding and is awaiting his initial court appearance.</p><p>The shooting occurred Feb. 12 at an apartment complex on Grove Circle near North State Street. Precinct 4 officers responded to reports that several people had been shot. Robbery/Homicide detectives were called to the scene.</p><p>Investigators determined that two individuals were injured during the incident and were transported by ambulance to local hospitals. Hospital staff later informed detectives that one of the victims, Glen Blackwell III, died from his injuries. The second victim was treated for non-life-threatening injuries.</p><p>Police said the suspects were initially described as five to six unknown males wearing masks who fled the scene on foot. At the time of the initial release, no arrests had been made.</p><p>Authorities said the motive for the shooting appeared to be robbery. The investigation remains active.</p><p>Anyone with information is asked to contact the Jackson Police Department at 601-960-1234 or Crime Stoppers at 601-355-TIPS (8477).</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-18/teen-arrested-charged-with-capital-murder-in-fatal-grove-circle-shooting",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/Screenshot-2026-02-18-075808.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-18/teen-arrested-charged-with-capital-murder-in-fatal-grove-circle-shooting",
      "pub_date": "Wed, 18 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-18T00:00:00+00:00",
      "summary": "UPDATE: On Wednesday, Javeon Wilson appeared before a Municipal Court Judge and received a $250K bond for the charge of Aggravated Assault and no bond for the Capital Murder charge.",
      "title": "Teen Charged With Capital Murder in Fatal Grove Circle Shooting - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-18/three-arrested-after-joint-narcotics-operation-in-forrest-lamar-county": {
      "author": "Morgan Howard",
      "content_html": "<p>FORREST COUNTY — Three people were taken into custody Tuesday after a joint narcotics operation by the Forrest County Sheriff’s Office and the Lamar County Sheriff’s Office led to the seizure of suspected methamphetamine, marijuana and multiple firearms, authorities said.</p><p>Investigators from the two agencies executed search warrants Feb. 17 at two locations: one in the 2600 block of Oak Grove Road and another in the 700 block of Duane Street.</p><p>During the searches, agents recovered about 10 ounces of suspected methamphetamine, 18 pounds of suspected marijuana and 12 firearms, authorities said. Officials said the suspects were believed to be involved in drug activity impacting both Forrest and Lamar counties.</p><p>Those arrested were identified as:</p><p>Lorenzo Price, charged with aggravated trafficking of methamphetamine;</p><p>Dorothy Jackson, charged with trafficking of marijuana while in possession of a firearm; and</p><p>Jalavion Haynes, charged with possession with intent to distribute ecstasy while in possession of a firearm.</p><p>Authorities said the seized items will be submitted to the Mississippi Crime Laboratory for testing and analysis. Officials said the investigation remains ongoing.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-18/three-arrested-after-joint-narcotics-operation-in-forrest-lamar-county",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/Screenshot-2026-02-18-154044.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-18/three-arrested-after-joint-narcotics-operation-in-forrest-lamar-county",
      "pub_date": "Wed, 18 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-18T00:00:00+00:00",
      "summary": "FORREST COUNTY — Three people were taken into custody Tuesday after a joint narcotics operation by the Forrest County Sheriff’s Office and the Lamar County Sheriff’s Office led to the seizure of suspected methamphetamine, marijuana and multiple firearms, authorities said.",
      "title": "Three arrested after joint narcotics operation in Forrest, Lamar County - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-18/tupelo-man-sentenced-to-25-years-after-guilty-plea-in-2023-killing": {
      "author": "Morgan Howard",
      "content_html": "<p>TUPELO – A man has been sentenced to 25 years in prison after pleading guilty to second-degree murder in the 2023 death of Montavious Jemar Clifton, according to the First Circuit District Attorney’s Office.</p><p>Prosecutors said Jaedin Jacques Hatchett entered the guilty plea Feb. 12. Hatchett had been indicted on a second-degree murder charge in connection with Clifton’s death on March 5, 2023.</p><p>Circuit Court Judge John R. White sentenced Hatchett to 25 years in the custody of the Mississippi Department of Corrections, the district attorney’s office said. Prosecutors said Hatchett will be required to serve the full 25-year term and will not be eligible for parole or early release.</p><p>The district attorney’s office said an additional 15 years were suspended, and Hatchett will be required to complete five years of post-release supervision after he is released from prison.</p><p>The case was investigated by the Tupelo Police Department. Assistant District Attorney Sadie Gardner prosecuted the case.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-18/tupelo-man-sentenced-to-25-years-after-guilty-plea-in-2023-killing",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/637824765_1532218862242957_461448563448770491_n.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-18/tupelo-man-sentenced-to-25-years-after-guilty-plea-in-2023-killing",
      "pub_date": "Wed, 18 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-18T00:00:00+00:00",
      "summary": "TUPELO – A man has been sentenced to 25 years in prison after pleading guilty to second-degree murder in the 2023 death of Montavious Jemar Clifton, according to the First Circuit District Attorney’s Office.",
      "title": "Tupelo man sentenced to 25 years after guilty plea in 2023 killing - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-18/wednesday-weather-mostly-cloudy-and-warm-with-near-record-highs": {
      "author": "Mary Apel",
      "content_html": "<p>It appears we’ll have our next significant rain chances as we go into the weekend. Monitor updates concerning this system for changes related to storm coverage and rainfall.</p><p>Highs in the 70s nearing 80 later today with occasional sunshine peeking through the clouds.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-18/wednesday-weather-mostly-cloudy-and-warm-with-near-record-highs",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/Weather-11.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-18/wednesday-weather-mostly-cloudy-and-warm-with-near-record-highs",
      "pub_date": "Wed, 18 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-18T00:00:00+00:00",
      "summary": "It appears we’ll have our next significant rain chances as we go into the weekend. Monitor updates concerning this system for changes related to storm coverage and rainfall.",
      "title": "Wednesday Weather: Mostly cloudy and warm with near record highs - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-18/woman-charged-after-domestic-stabbing-in-lamar-county": {
      "author": "Morgan Howard",
      "content_html": "<p>LAMAR COUNTY – A 48-year-old woman has been charged with aggravated assault in a domestic violence case after deputies said a man was stabbed during a fight Monday night at an apartment on Shears Road.</p><p>Deputies responded around 9 p.m. Feb. 16, 2026, after a reported stabbing, according to authorities. Investigators said a 38-year-old man suffered a stab wound to the abdomen and was transported by ambulance to a local hospital, where he underwent surgery.</p><p>Authorities identified the woman as Demetra Holloway, 48. Deputies said Holloway suffered a cut to her hand during the incident and was also taken to a local hospital for treatment.</p><p>After she was released, Holloway was transported to the Lamar County Jail and charged with aggravated assault/domestic violence, authorities said. Bond was set at $25,000.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-18/woman-charged-after-domestic-stabbing-in-lamar-county",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/Screenshot-2026-02-18-115413.png",
      "link": "https://darkhorsepressnow.com/news/2026-02-18/woman-charged-after-domestic-stabbing-in-lamar-county",
      "pub_date": "Wed, 18 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-18T00:00:00+00:00",
      "summary": "LAMAR COUNTY – A 48-year-old woman has been charged with aggravated assault in a domestic violence case after deputies said a man was stabbed during a fight Monday night at an apartment on Shears Road.",
      "title": "Woman charged after domestic stabbing in Lamar County - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-19/air-national-guard-to-host-sentry-south-26-2-exercise-across-mississippi": {
      "author": "Therese Apel",
      "content_html": "<p>GULFPORT — The Air National Guard will host the Sentry South 26-2 training exercise from Feb. 20 through March 6 at multiple locations across Mississippi, including the Gulfport Combat Readiness Training Center and the Camp Shelby Joint Forces Training Center.</p><p>Approximately 1,100 service members from active-duty, National Guard and reserve components of the U.S. military are expected to participate in the large-scale combat training exercise.</p><p>Sentry South 26-2 is a Large Force Employment exercise focused on major combat operations and joint maritime opportunities in a contested or degraded operational environment, according to officials. The training applies joint and combined warfighting doctrine against realistic and robust enemy integrated threat systems under safe and controlled conditions.</p><p>Residents living near training sites may notice increased military activity during the exercise, including additional aircraft operations, low-flying helicopters and elevated noise levels.</p><p>The training will take place at facilities in Gulfport, Camp Shelby and other locations around the state.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-19/air-national-guard-to-host-sentry-south-26-2-exercise-across-mississippi",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2024/10/Screenshot-2024-10-10-073405.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-19/air-national-guard-to-host-sentry-south-26-2-exercise-across-mississippi",
      "pub_date": "Thu, 19 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-19T00:00:00+00:00",
      "summary": "GULFPORT — The Air National Guard will host the Sentry South 26-2 training exercise from Feb. 20 through March 6 at multiple locations across Mississippi, including the Gulfport Combat Readiness Training Center and the Camp Shelby Joint Forces Training Center.",
      "title": "Air National Guard to Host Sentry South 26-2 Exercise Across Mississippi - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-19/cheshire-abbey-rescues-dogs-surrendered-during-raid-at-jackson-home": {
      "author": "Morgan Howard",
      "content_html": "<p>JACKSON – An animal rescue group called Cheshire Abbey said four dogs were surrendered to its care after local and federal law enforcement conducted a raid at a home in Jackson’s Fondren area earlier today.</p><p>Cheshire Abbey Animal Rescue said in a social media post that responders found four large dogs chained in the front of the home. The group alleged the chains were too short and too heavy, and that the dogs did not have proper shelter or water. The rescue also said the animals did not have required rabies vaccinations.</p><p>Rather than face potential citations, the people at the home relinquished the animals.</p><p>Cheshire Abbey said it is currently at capacity following recent cold-weather rescues and plans to board the dogs while they are assessed. The rescue said it evaluates animals before adoption and does not place aggressive dogs.</p><p>The group praised law enforcement partners involved in the response and asked the community for donations to help cover boarding and veterinary costs.</p><p>You can donate to their care on the rescue’s Facebook post by clicking below.</p><p>These rescues cannot do this by themselves. It takes a village to help the forgotten dogs discarded in Mississippi every single day. It is exhausting for a small group to do alone…so whether you skip your daily $5 coffee and donate, that or reach out and offer to foster, we challenge you to do something.</p><p>It can be something big or small…but please do something.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-19/cheshire-abbey-rescues-dogs-surrendered-during-raid-at-jackson-home",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/Graduation-photo-collage-1.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-19/cheshire-abbey-rescues-dogs-surrendered-during-raid-at-jackson-home",
      "pub_date": "Thu, 19 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-19T00:00:00+00:00",
      "summary": "JACKSON – An animal rescue group called Cheshire Abbey said four dogs were surrendered to its care after local and federal law enforcement conducted a raid at a home in Jackson’s Fondren area earlier today.",
      "title": "Cheshire Abbey Rescues Dogs Surrendered During Raid at Jackson Home - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-19/crime-stoppers-tupelo-police-seek-publics-help-identifying-suspects-in-walmart-jewelry-theft": {
      "author": "Morgan Howard",
      "content_html": "<p>TUPELO – Crime Stoppers of Northeast Mississippi and the Tupelo Police Department are asking for the public’s help identifying a suspect in a false pretense case involving the theft of jewelry from a Tupelo Walmart.</p><p>According to investigators, the incident occurred Feb. 11, 2026, at about 1:25 p.m. at Walmart, 2270 W. Main St. Police said two unknown men entered the store and went to the jewelry section, where they concealed multiple jewelry items.</p><p>Authorities said the suspects then left the store without paying. The total value of the stolen merchandise exceeded $5,000, according to Crime Stoppers.</p><p>Anyone with information is asked to call Crime Stoppers of Northeast Mississippi at 800-773-TIPS (8477) or submit an anonymous tip through the P3 Tips app. Crime Stoppers said tips that lead to an arrest could be eligible for a cash reward of up to $2,000.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-19/crime-stoppers-tupelo-police-seek-publics-help-identifying-suspects-in-walmart-jewelry-theft",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/Screenshot-2026-02-19-124508.png",
      "link": "https://darkhorsepressnow.com/news/2026-02-19/crime-stoppers-tupelo-police-seek-publics-help-identifying-suspects-in-walmart-jewelry-theft",
      "pub_date": "Thu, 19 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-19T00:00:00+00:00",
      "summary": "TUPELO – Crime Stoppers of Northeast Mississippi and the Tupelo Police Department are asking for the public’s help identifying a suspect in a false pretense case involving the theft of jewelry from a Tupelo Walmart.",
      "title": "Crime Stoppers, Tupelo police seek public’s help identifying suspects in Walmart jewelry theft - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-19/cybersecurity-attack-forces-ummc-to-close-statewide-clinics-cancel-outpatient-procedures": {
      "author": "Morgan Howard",
      "content_html": "<p>JACKSON – The University of Mississippi Medical Center said Thursday that a cybersecurity attack has taken many of its information technology systems offline, including access to its electronic medical records system, Epic.</p><p>In a public notice dated Feb. 19, UMMC said all of its clinic locations statewide are closed for the day.</p><p>UMMC said outpatient and ambulatory surgeries and procedures, along with imaging appointments, have been canceled and will be rescheduled.</p><p>Hospital services are continuing using downtime procedures, the medical center said.</p><p>UMMC said it will provide additional updates as more information becomes available and apologized for the disruption.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-19/cybersecurity-attack-forces-ummc-to-close-statewide-clinics-cancel-outpatient-procedures",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2022/12/ummc.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-19/cybersecurity-attack-forces-ummc-to-close-statewide-clinics-cancel-outpatient-procedures",
      "pub_date": "Thu, 19 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-19T00:00:00+00:00",
      "summary": "JACKSON – The University of Mississippi Medical Center said Thursday that a cybersecurity attack has taken many of its information technology systems offline, including access to its electronic medical records system, Epic.",
      "title": "Cybersecurity attack forces UMMC to close statewide clinics, cancel outpatient procedures - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-19/historic-photo-recreation-exhibition-lectures-highlight-mcs-200th-birthday-celebration": {
      "author": "Special to Darkhorse Press",
      "content_html": "<p>When Joseph H. Hamilton was considering what college to attend, his father made the young high school graduate a generous offer.</p><p>“He told me, ‘You can go to any school you want to in the country,’ but the only school he took me to see was Mississippi College,” Hamilton said</p><p>The senior Hamilton, a 1914 MC graduate, may have been a bit biased. But his son earned his undergraduate degree at MC in 1954 and went on to become an internationally celebrated scientist and world-class researcher who co-discovered new elements 113, 115 and 117 in the Periodic Table of Chemistry Elements. He even had the honor of naming atomic element 117 – Tennessine – in honor of his home state of Tennessee.</p><p>For decades, Hamilton kept a relic of his father’s college days in Clinton: a black-and-white photo of his father and his classmates standing in front of Provine Chapel on the day of their graduation. With the arrival of MC’s Bicentennial year, he thought the photo belonged at the University.</p><p>On the warm and sunny afternoon of Thursday, Feb. 12, dozens of current MC faculty, staff, students and alumni crowded in front of Provine Chapel to recreate that photo taken more than a century before. Seated right in front on a wooden pew was Joseph H. Hamilton, representing his father in the modern image: two generations of Hamiltons spread 112 years apart.</p><p>“It was a special occasion that honored him as well as all the graduates of MC,” Hamilton said of the photo recreation.</p><p>The photo followed a recognition of the chapel’s addition to the National Register of Historic Places by MC President Blake Thompson and Stephanie Busbea, dean of the School of Christian Studies, Humanities and the Arts.</p><p>Following many camera clicks, the Choctaw Marching Band played and the crowd sang “Happy Birthday” to MC as Thompson, Tushka, MC’s on-field personality, and student representatives blew out the candles on a three-tier Bicentennial birthday cake.</p><p>“This once-in-a-lifetime celebration of MC’s 200th birthday united generations of students, faculty, staff, alumni and friends,” Thompson said. “I’m deeply grateful for those who have shaped our story and are inspired by the legacy we carry forward as we begin our next 200 years together.”</p><p>The event kicked off MC’s Bicentennial Birthday Party and other celebratory events, which had been partially postponed by inclement weather during Founders Week in January.</p><p>Students on the Campus Programming Board and MC’s Office of Student Engagement hosted a Bicentennial Birthday Party in the Piazza and Jennings Courtyard that included 200 cupcakes, a photo booth, food and drink vendors, and other activities.</p><p>The “1826: The Exhibition,” which highlights the University’s rich history in a spectacular display created by the Institute for Southern Storytelling at MC, debuted in its namesake campus building, 1826. The exhibit will be open for visitors throughout the Bicentennial year.</p><p>The new Bicentennial Time Capsule, scheduled to be packed with dozens of MC artifacts and reopened sometime in the future, was on display in one of the campus’s historic buildings, Jennings Hall.</p><p>Students and alumni who toured the exhibition and time capsule were simply astounded.</p><p>Cody Scruggs, a sophomore computer science major from Terry, was fascinated by the exhibit’s display of technology used by MC students through the years, especially the old Macintosh personal computer and the early generation iPhone.</p><p>“Seeing all of these things paints a picture in your head of what life in a dorm room could have been like,” Scruggs said. “I’ve been passing by MC since I was 6 years old. Being able to say I was a student here for MC’s 200th birthday celebration is a privilege. Seeing all the different people who have been affiliated with MC being here to celebrate this is amazing.”</p><p>Clinton residents Mary Alta Clark, a 1971 MC graduate, and her daughter, Kim Clark Pigott, who graduated from MC in 1986, participated in the photo recreation and stayed to tour the exhibit. They both recognized items from their respective college days.</p><p>“I remember my grandmother talking about being at Hillman College, which is represented (in the exhibit),” Pigott said. “A lot of our friends and my ex-classmates, people who I know through my children, are represented. I just love it.”</p><p>“I loved the diorama of the campus,” Clark said. “It brings back a lot of old memories. I’ve enjoyed watching the different decades. I want to come back, take my time and read about everything.”</p><p>Livi Cate Osborne, a junior Christian Studies major from Birmingham, is the first in her family to attend MC. She said the Bicentennial celebration provides an opportunity for her to share the University’s rich history with her relatives.</p><p>“I’ve loved being at MC, and it means so much to show them this place that I’ve made a home for myself,” she said. “I love history, so it’s special for me to be a part of the next 200 years.”</p><p>That evening, MC’s Department of Christian Studies hosted a Bicentennial edition of the annual Evangelism Lecture. Shane Pruitt, national next gen director for the North American Mission Board, inspired audience members to take their faith seriously and to share their beliefs with the next generation.</p><p>After a “Meet and Greet” with Mississippi College’s first Black graduates, the African American Studies program at MC presented “Success Starts at Mississippi College: Chronicles of MC’s African American Contributions to 200 Years of Celebration.” Moderated by Ellis Liddell ’80, co-chair of the Bicentennial Celebration Committee, the event featured MC alumni panelists Larry Myricks ’79, Maggie Wade ’20, Regina Schofield ’83, Camryn Johnson ’22, and Aaron Feazelle ’20.</p><p>On Friday morning, Feb. 13, Liddell, fellow members of the Bicentennial Celebration Committee, and guests witnessed Thompson unveil a sign outside Alumni Hall acknowledging the support of those “who helped ensure the success of this historic (Bicentennial) celebration.”</p><p>During the brunch that followed, Jim Turcotte, MC vice president and special assistant to the president, recognized members of the Bicentennial Celebration Committee and Bicentennial Working Group and their efforts to make the Bicentennial Celebration a success.</p><p>“I am immensely grateful for the contributions of the MC Bicentennial Celebration Committee, the MC Bicentennial Working Group, and many other MC faculty, staff and student volunteers who have been the driving force behind our celebration activities,” Turcotte said. “I appreciate each of you and thank you from the bottom of my heart.”</p><p>Liddell closed by encouraging the committee members to continue telling the story of Mississippi College throughout its Bicentennial year and beyond.</p><p>“There’s a certain culture that we have as a result of who we are and how we grew up here,” Liddell said. “We must take that culture and share it with the rest of the world. This college has a purpose, and that’s what makes Mississippi College special.”</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-19/historic-photo-recreation-exhibition-lectures-highlight-mcs-200th-birthday-celebration",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/MC.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-19/historic-photo-recreation-exhibition-lectures-highlight-mcs-200th-birthday-celebration",
      "pub_date": "Thu, 19 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-19T00:00:00+00:00",
      "summary": "When Joseph H. Hamilton was considering what college to attend, his father made the young high school graduate a generous offer.",
      "title": "Historic photo recreation, exhibition, lectures highlight MC’s 200th birthday celebration - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-19/jackson-police-seek-suspect-in-two-burglaries-at-hometown-bbq": {
      "author": "Therese Apel",
      "content_html": "<p>JACKSON — Jackson Police Department is asking for the public’s help identifying a suspect linked to two burglaries at a local restaurant earlier this month.</p><p>Police said Hometown BBQ, located at 3152 Medgar Evers Blvd., was first burglarized Feb. 2. The business was targeted again on Feb. 14.</p><p>According to investigators, surveillance footage indicates the same individual may be responsible for both break-ins.</p><p>Authorities released video from the incidents and said the investigation remains ongoing.</p><p>Anyone with information is urged to contact the Jackson Police Department at 601-960-1234 or Crime Stoppers at 601-355-TIPS (8477).</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-19/jackson-police-seek-suspect-in-two-burglaries-at-hometown-bbq",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/Screenshot-2026-02-19-150713.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-19/jackson-police-seek-suspect-in-two-burglaries-at-hometown-bbq",
      "pub_date": "Thu, 19 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-19T00:00:00+00:00",
      "summary": "JACKSON — Jackson Police Department is asking for the public’s help identifying a suspect linked to two burglaries at a local restaurant earlier this month.",
      "title": "Jackson Police Seek Suspect in Two Burglaries at Hometown BBQ - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-19/man-found-shot-to-death-after-domestic-disturbance-in-george-county": {
      "author": "Therese Apel",
      "content_html": "<p>GEORGE COUNTY — A 60-year-old man was found shot to death Friday night following a reported domestic violence altercation at a residence in the Central community, authorities said.</p><p>The George County Sheriff’s Office said deputies were dispatched at approximately 8:27 p.m. to the 100 block of Brock Road after receiving a 911 call from a 57-year-old woman reporting a domestic disturbance and a shooting at her home.</p><p>When deputies arrived, they made contact with the caller and discovered the man outside the residence suffering from an apparent gunshot wound. He was pronounced dead at the scene.</p><p>Investigators with the sheriff’s office Criminal Investigations Division responded and began processing evidence.</p><p>The woman was transported by ambulance under police escort to George County Regional Hospital for treatment of injuries sustained during the altercation. After being treated and released, she was interviewed by investigators and later released.</p><p>Authorities said there is no evidence at this time indicating any other individuals were directly involved in the incident.</p><p>The investigation remains active, and officials said no further details will be released to protect the integrity of the case.</p><p>Sheriff Keith Mixon is asking anyone with information about the shooting to contact the George County Sheriff’s Office Criminal Investigations Division at 601-947-4811.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-19/man-found-shot-to-death-after-domestic-disturbance-in-george-county",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2023/07/george-county-e1690222530949.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-19/man-found-shot-to-death-after-domestic-disturbance-in-george-county",
      "pub_date": "Thu, 19 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-19T00:00:00+00:00",
      "summary": "GEORGE COUNTY — A 60-year-old man was found shot to death Friday night following a reported domestic violence altercation at a residence in the Central community, authorities said.",
      "title": "Man Found Shot to Death After Domestic Disturbance in George County - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-19/man-found-shot-to-death-in-vacant-skyline-drive-home": {
      "author": "Therese Apel",
      "content_html": "<p>JACKSON — A man believed to have been reported missing earlier in the day was found shot to death Tuesday night inside a vacant residence in the 3600 block of Skyline Drive, authorities said.</p><p>Interim Police Chief and Hinds County Sheriff Tyree Jones said officers responded shortly after 9 p.m. after receiving information that a missing person might be at or near the location. Upon arrival, officers found a Black male deceased inside the vacant property.</p><p>“It’s apparent that he had been shot at least once,” Jones said during a press conference at the scene.</p><p>The killing marks Jackson’s eighth homicide of the year.</p><p>Authorities believe the victim may be the same individual reported missing earlier Tuesday in Jackson. However, Jones said investigators are awaiting formal identification and family notification before releasing the name. The victim is believed to be in his early 30s.</p><p>Investigators also reported that a 2020 gray Nissan Sentra belonging to the victim is missing from the scene.</p><p>Jones said officers were alerted to the area based on information that the missing person could be nearby. Family members of the missing individual were also in the area and spoke with officers, leading to the discovery of the body inside the vacant home.</p><p>Police do not believe the victim lived at the residence and said the property is unoccupied. Investigators are working to determine why the victim was at the location and what connection, if any, exists between him and the property.</p><p>Authorities have not identified a motive and said the case remains under investigation.</p><p>Anyone with information is asked to contact the Jackson Police Department.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-19/man-found-shot-to-death-in-vacant-skyline-drive-home",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2023/01/crimeeee.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-19/man-found-shot-to-death-in-vacant-skyline-drive-home",
      "pub_date": "Thu, 19 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-19T00:00:00+00:00",
      "summary": "JACKSON — A man believed to have been reported missing earlier in the day was found shot to death Tuesday night inside a vacant residence in the 3600 block of Skyline Drive, authorities said.",
      "title": "Man Found Shot to Death in Vacant Skyline Drive Home - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-19/meridian-police-department-makes-first-arrest-under-mississippi-grooming-statute": {
      "author": "Cash Matlock",
      "content_html": "<p>MERIDIAN – The Meridian Police Department has made its first arrest under Mississippi’s Grooming of a Child statute, marking what officials described as a significant milestone for the department.</p><p>Dennis Palmer was arrested Feb. 18 with assistance from the Lauderdale County Sheriff’s Department and the East Mississippi Drug Task Force. He was wanted on charges of Grooming of a Child under Mississippi State Code § 97-5-32 and Procurement of Sexual Servitude of a Minor under Mississippi State Code § 97-3-54.</p><p>The Grooming of a Child statute was enacted in July 2025 by the state of Mississippi. Authorities said this is the first arrest made by the Meridian Police Department under the new law.</p><p>Bond was set at $1 million, according to the department.</p><p>The case was investigated by the Meridian Police Department’s Human Trafficking/ICAC Unit, with assistance from the department’s Gang Unit, SWAT Team and K-9 Unit.</p><p>Officials said the arrest underscores the department’s ongoing efforts to protect children and hold accountable those accused of exploiting minors. The department said it will continue working with law enforcement partners to pursue similar cases in the future.</p><p>Palmer is presumed innocent unless and until proven guilty in a court of law.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-19/meridian-police-department-makes-first-arrest-under-mississippi-grooming-statute",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/Untitled-design-2026-02-19T085653.798.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-19/meridian-police-department-makes-first-arrest-under-mississippi-grooming-statute",
      "pub_date": "Thu, 19 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-19T00:00:00+00:00",
      "summary": "MERIDIAN – The Meridian Police Department has made its first arrest under Mississippi’s Grooming of a Child statute, marking what officials described as a significant milestone for the department.",
      "title": "Meridian Police Department makes first arrest under Mississippi grooming statute - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-19/nonprofit-honors-fallen-lee-county-deputy-rick-haggard-with-dog-tag-necklaces-gifts": {
      "author": "Morgan Howard",
      "content_html": "<p>ATLANTA — A global nonprofit organization said it has honored fallen Lee County Deputy Sheriff and school resource officer Rick Haggard, who was struck and killed by a vehicle earlier this month while directing traffic in front of Shannon Elementary School in Shannon.</p><p>Point 27, based in Georgia, said in a statement dated Feb. 19, 2026, that it sent Thin Blue Line “Shields of Strength” dog-tag necklaces to the Lee County Sheriff’s Office for Haggard’s partner and officers who served closely with him. The organization said the tags are inscribed with Matthew 5:9.</p><p>The nonprofit also said it provided Haggard’s family with keepsake folded-flag pendant necklaces inscribed with John 15:13.</p><p>“We want law enforcement officers and their families to know we value them and their sacrifices, that God loves them, and that they are never alone,” said Point 27 Director Col. Dodd, a retired U.S. Army officer, in the statement.</p><p>Point 27 said Dodd served 27 years in the military and founded the organization in 2014 to provide scripture-inscribed dog tags to members of the military, veterans and law enforcement.</p><p>Haggard died Feb. 2 while directing traffic outside Shannon Elementary School, the release said. A spokesperson listed for additional information was Marcia Davis.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-19/nonprofit-honors-fallen-lee-county-deputy-rick-haggard-with-dog-tag-necklaces-gifts",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/Point-27-Thin-blue-line-DogTag-and-Folded-Flag-Shields-of-Strength-Copy-3-Copy-1.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-19/nonprofit-honors-fallen-lee-county-deputy-rick-haggard-with-dog-tag-necklaces-gifts",
      "pub_date": "Thu, 19 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-19T00:00:00+00:00",
      "summary": "ATLANTA — A global nonprofit organization said it has honored fallen Lee County Deputy Sheriff and school resource officer Rick Haggard, who was struck and killed by a vehicle earlier this month while directing traffic in front of Shannon Elementary School in Shannon.",
      "title": "Nonprofit honors fallen Lee County deputy Rick Haggard with dog tag necklaces, gifts - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-19/officer-prisoner-killed-in-i-10-crash-involving-transport-van-in-jackson-county": {
      "author": "Morgan Howard",
      "content_html": "<p>JACKSON COUNTY – A prisoner and a transport officer were killed and three other people were seriously injured Wednesday morning when a private prisoner transport van crashed on Interstate 10 in Jackson County, according to WLOX.</p><p>WLOX reported the crash happened around 9:30 a.m. in the westbound lanes of I-10 near the Ocean Springs Exit 50 ramp to Mississippi Highway 609. The van struck a pole, overturned and collided with a utility truck.</p><p>The Mississippi Highway Patrol said there were four people inside the transport van and one person in the utility truck. Two people in the van, an officer and a prisoner, died, and the other two occupants in the van were critically injured, WLOX reported.</p><p>The utility truck driver was taken to a local hospital in stable condition.</p><p>WLOX reported a medical helicopter was called to transport one of the most critically injured victims. After the crash, the van caught fire, and the Jackson County Sheriff’s Office arrived first and put out the fire, according to the station. Jackson County Fire then cut into the van to rescue those inside.</p><p>The transport van was operated by St. Joseph Services, a private prisoner transport company, WLOX reported. The station said the trip began Tuesday night and involved prisoners picked up in Florida, with planned destinations including Ocean City, New Jersey, and Spaulding, Georgia. The van was also in Mississippi to pick up an inmate from the Harrison County Adult Detention Center when it crashed, according to the report.</p><p>Multiple agencies responded and a crash reconstruction was conducted. The cause of the crash had not been released as of Wednesday, WLOX reported.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-19/officer-prisoner-killed-in-i-10-crash-involving-transport-van-in-jackson-county",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2024/01/fatal-crash-4.png",
      "link": "https://darkhorsepressnow.com/news/2026-02-19/officer-prisoner-killed-in-i-10-crash-involving-transport-van-in-jackson-county",
      "pub_date": "Thu, 19 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-19T00:00:00+00:00",
      "summary": "JACKSON COUNTY – A prisoner and a transport officer were killed and three other people were seriously injured Wednesday morning when a private prisoner transport van crashed on Interstate 10 in Jackson County, according to WLOX.",
      "title": "Officer, prisoner killed in I-10 crash involving transport van in Jackson County - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-19/sheriff-no-more-deputies-standing-in-roadway-for-shannon-school-traffic-control": {
      "author": "Morgan Howard",
      "content_html": "<p>LEE COUNTY — The Lee County Sheriff’s Office said it will no longer place deputies in the middle of a highway to direct school traffic at Shannon Primary and Shannon Elementary schools, citing safety concerns.</p><p>In a statement, Sheriff Jim H. Johnson said the change is effective immediately and follows what he described as the recent loss of two school resource officers and another close call Monday morning.</p><p>Lee County deputy killed after being struck by vehicle near Shannon School</p><p>Johnson said the sheriff’s office is meeting with the school district superintendent and staff, along with representatives from the Mississippi Department of Transportation, to evaluate safer traffic options.</p><p>The sheriff said agencies are working together to implement changes aimed at improving traffic flow while protecting deputies, students, staff and families.</p><p>Johnson urged parents and guardians to allow extra time for student drop-off and pick-up as the changes are developed and put in place.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-19/sheriff-no-more-deputies-standing-in-roadway-for-shannon-school-traffic-control",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/lee-countytyty.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-19/sheriff-no-more-deputies-standing-in-roadway-for-shannon-school-traffic-control",
      "pub_date": "Thu, 19 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-19T00:00:00+00:00",
      "summary": "LEE COUNTY — The Lee County Sheriff’s Office said it will no longer place deputies in the middle of a highway to direct school traffic at Shannon Primary and Shannon Elementary schools, citing safety concerns.",
      "title": "Sheriff: No more deputies standing in roadway for Shannon school traffic control - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-19/street-sweeper-driver-killed-in-collision-with-18-wheeler-in-lowndes-county": {
      "author": "Morgan Howard",
      "content_html": "<p>LOWNDES COUNTY — The driver of a street sweeper was killed Wednesday afternoon in a crash involving an 18-wheeler on Industrial Park Road, according to the Lowndes County Sheriff’s Office.</p><p>Deputies responded to the crash at about 3 p.m. Feb. 18, 2026. A preliminary investigation indicates the street sweeper driver was fatally injured in the collision, authorities said.</p><p>The sheriff’s office said the 18-wheeler driver was not reported to have suffered life-threatening injuries.</p><p>Emergency responders and investigators remained at the scene for several hours while the crash was investigated and the roadway was cleared. Traffic on Industrial Park Road was temporarily affected.</p><p>The identity of the person killed is being withheld pending notification of next of kin.</p><p>The crash remains under investigation. Anyone with information is asked to contact the Lowndes County Sheriff’s Office.</p><p>“Our thoughts and prayers are with the victim’s family during this difficult time,” Sheriff Eddie Hawkins said in a statement. “We ask motorists to remain cautious and attentive, especially around commercial and maintenance vehicles operating on our roadways.”</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-19/street-sweeper-driver-killed-in-collision-with-18-wheeler-in-lowndes-county",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2025/08/shutterstock_722099620-e1755792249812.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-19/street-sweeper-driver-killed-in-collision-with-18-wheeler-in-lowndes-county",
      "pub_date": "Thu, 19 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-19T00:00:00+00:00",
      "summary": "LOWNDES COUNTY — The driver of a street sweeper was killed Wednesday afternoon in a crash involving an 18-wheeler on Industrial Park Road, according to the Lowndes County Sheriff’s Office.",
      "title": "Street sweeper driver killed in collision with 18-wheeler in Lowndes County - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-19/study-absolutely-nobody-checked-on-12659-mississippi-seniors-in-january": {
      "author": "Therese Apel",
      "content_html": "<p>JACKSON — Nearly one-third of Mississippi seniors who live alone went the entire month of January without a single meaningful check-in, underscoring concerns about what health officials have called a growing loneliness epidemic in America.</p><p>A new survey by Choice Mutual found that 32% of Mississippi residents age 65 and older who live alone reported no one had checked on them since Jan. 1. That equates to an estimated 12,659 seniors statewide who experienced a full month without meaningful social contact.</p><p>The findings come as national health experts warn that chronic loneliness can carry health risks comparable to smoking heavily. U.S. leaders, including the former U.S. surgeon general, have described social isolation as a public health crisis, particularly among older Americans.</p><p>Choice Mutual surveyed 3,025 seniors nationwide at the end of January, asking a single question: “Has anyone checked in on you since January 1?”</p><p>Overall, 26% said no, and Mississippi’s rate exceeded the national average.</p><p>The survey identified the five states with the highest share of seniors living alone who reported zero check-ins in January: Wyoming and Oklahoma at 50%, followed by Louisiana at 44%, and Arizona and Connecticut at 42%.</p><p>Beyond the headline number, the survey painted a broader picture of winter isolation.</p><p>Among seniors living alone nationwide:</p><p>The emotional toll appears to run deep. Sixty-eight percent said they feel forgotten or invisible during the winter. Nearly three in 10, or 29%, said they do not have even one person they can confide in during difficult times.</p><p>More than half, 58%, said they worry their loneliness is harming their health, and 62% reported that isolation affected their physical or mental health this winter.</p><p>Even seniors who do not live alone are not immune. The survey found that 65% of older adults who live with a partner still sometimes feel alone.</p><p>Anthony Martin, founder of Choice Mutual , said the results should be viewed as a warning.</p><p>“Loneliness is often dismissed as a soft issue, but the numbers show it’s anything but,” Martin said. “When a quarter of seniors go a full month without a check-in, that’s not just a social concern — it’s a public-health warning light.”</p><p>He said many seniors are not seeking major interventions, but simple connection.</p><p>“In many cases, a simple phone call or knock on the door would make a meaningful difference,” Martin said.</p><p>The survey also highlighted how difficult it can be for seniors to break the cycle of isolation. While 28% said they are very likely to reach out when feeling lonely, 40% said they are unlikely or very unlikely to do so.</p><p>Still, 64% said their well-being would improve if someone reached out more often.</p><p>As winter continues and social isolation remains a concern nationwide, advocates say small acts of connection — a call, a visit or a check-in — may be among the most powerful tools to combat what many now consider one of the country’s most overlooked health threats.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-19/study-absolutely-nobody-checked-on-12659-mississippi-seniors-in-january",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/shutterstock_1012812838.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-19/study-absolutely-nobody-checked-on-12659-mississippi-seniors-in-january",
      "pub_date": "Thu, 19 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-19T00:00:00+00:00",
      "summary": "JACKSON — Nearly one-third of Mississippi seniors who live alone went the entire month of January without a single meaningful check-in, underscoring concerns about what health officials have called a growing loneliness epidemic in America.",
      "title": "Study: Absolutely nobody checked on 12,659 Mississippi seniors in January - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-19/tate-county-sheriffs-office-k-9s-soul-and-stuccie-receive-donated-body-armor": {
      "author": "Morgan Howard",
      "content_html": "<p>SENATOBIA — The Tate County Sheriff’s Office said its K-9s, Soul and Stuccie, have received new bullet- and stab-protective vests through a donation arranged by the nonprofit Vested Interest in K9s Inc.</p><p>The sheriff’s office said the vests were sponsored by Don and Misty Fike of Galesburg, Illinois, and embroidered with the message: “Born to Love- Trained to Serve-Loyal Always.”</p><p>Vested Interest in K9s Inc., founded in 2009, is a 501(c)(3) organization that provides protective vests and other assistance to law enforcement K-9s nationwide. The group said the vests are U.S.-made, custom-fitted and certified to National Institute of Justice standards.</p><p>Since its founding, the nonprofit said it has provided more than 6,225 vests valued at about $6.9 million to K-9s in all 50 states through private and corporate donations.</p><p>The organization said its program is open to U.S. law enforcement dogs that are at least 20 months old and actively employed and certified, and K-9s with expired vests may also be eligible.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-19/tate-county-sheriffs-office-k-9s-soul-and-stuccie-receive-donated-body-armor",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/639155451_122255367278177884_3418483661092897555_n.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-19/tate-county-sheriffs-office-k-9s-soul-and-stuccie-receive-donated-body-armor",
      "pub_date": "Thu, 19 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-19T00:00:00+00:00",
      "summary": "SENATOBIA — The Tate County Sheriff’s Office said its K-9s, Soul and Stuccie, have received new bullet- and stab-protective vests through a donation arranged by the nonprofit Vested Interest in K9s Inc.",
      "title": "Tate County Sheriff’s Office K-9s Soul and Stuccie receive donated body armor - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-19/thursday-weather-cloudy-and-warm-slight-chance-of-rain-later": {
      "author": "Mary Apel",
      "content_html": "",
      "guid": "https://darkhorsepressnow.com/news/2026-02-19/thursday-weather-cloudy-and-warm-slight-chance-of-rain-later",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/Weather-12.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-19/thursday-weather-cloudy-and-warm-slight-chance-of-rain-later",
      "pub_date": "Thu, 19 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-19T00:00:00+00:00",
      "summary": "Isolated severe storms will be possibly on Saturday as a frontal boundary move across the area. Damaging winds up to 60 mph will be the main hazard.",
      "title": "Thursday Weather: Cloudy and warm, slight chance of rain later - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-19/two-arrested-third-sought-in-pearl-river-county-drive-by-shooting-investigation": {
      "author": "Morgan Howard",
      "content_html": "<p>PEARL RIVER COUNTY – Two people have been arrested and a third is being sought in connection with a drive-by shooting investigation in Pearl River County, according to the Pearl River County Sheriff’s Office.</p><p>Deputies responded Feb. 9, 2026, to Highland Hospital after a male victim arrived with a gunshot wound, authorities said. Investigators later determined the shooting occurred near the intersection of Mississippi Highway 53 and Barth Road in Poplarville.</p><p>The sheriff’s office said the suspected gunman was identified as Austyn Reynolds, and investigators also identified a Nissan Altima as the suspected vehicle involved.</p><p>Authorities said Michelle Rogers was identified as an accomplice who allegedly helped Reynolds attempt to evade law enforcement after the shooting.</p><p>In a coordinated effort between the Pearl River County Sheriff’s Office and the Bogalusa Police Department, Reynolds and Rogers were taken into custody without incident, the sheriff’s office said.</p><p>Investigators later determined that Shyanne Thibodeaux also assisted Reynolds and Rogers in evading law enforcement after the shooting, authorities said. An arrest warrant remains outstanding for Thibodeaux, the sheriff’s office said.</p><p>Reynolds was arrested and charged with drive-by shooting under Mississippi Code Section 97-3-109(1). Rogers was charged with accessory after the fact to drive-by shooting under Mississippi Code Section 97-1-5(1)(a)(i), authorities said. Thibodeaux faces an outstanding warrant for accessory after the fact to drive-by shooting under the same statute, officials said.</p><p>Sheriff David Allison thanked the Bogalusa Police Department and the Hancock County Sheriff’s Office for assisting in the investigation and said deputies and investigators worked to resolve what he described as a violent crime.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-19/two-arrested-third-sought-in-pearl-river-county-drive-by-shooting-investigation",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/638390225_1284655553685925_2289238445389970520_n.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-19/two-arrested-third-sought-in-pearl-river-county-drive-by-shooting-investigation",
      "pub_date": "Thu, 19 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-19T00:00:00+00:00",
      "summary": "PEARL RIVER COUNTY – Two people have been arrested and a third is being sought in connection with a drive-by shooting investigation in Pearl River County, according to the Pearl River County Sheriff’s Office.",
      "title": "Two arrested, third wanted in Pearl River County drive-by shooting investigation - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-19/woman-charged-after-man-shot-at-apartment-complex-in-greenville": {
      "author": "Morgan Howard",
      "content_html": "<p>GREENVILLE – A Greenville woman has been charged after police said a man was shot during a domestic dispute Tuesday at Riverwalk Apartments.</p><p>Officers with the Greenville Police Department responded Feb. 17 to a report of a shooting at 738 W. Union St., police said. When officers arrived, they made contact with a female inside the residence, who told them a male victim was in the bathroom with a gunshot wound.</p><p>The victim was transported to Delta Health System for treatment. Police said additional details about the circumstances surrounding the shooting remain under investigation.</p><p>Investigators charged 28-year-old Larineisha Askew of Greenville with one count of domestic aggravated assault. She is awaiting her initial appearance, police said.</p><p>All suspects are presumed innocent unless proven guilty.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-19/woman-charged-after-man-shot-at-apartment-complex-in-greenville",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2025/10/shutterstock_2230644523.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-19/woman-charged-after-man-shot-at-apartment-complex-in-greenville",
      "pub_date": "Thu, 19 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-19T00:00:00+00:00",
      "summary": "GREENVILLE – A Greenville woman has been charged after police said a man was shot during a domestic dispute Tuesday at Riverwalk Apartments.",
      "title": "Woman charged after man shot at apartment complex in Greenville - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-20/darkhorse-dogs-from-abandoned-mall-to-looking-for-her-forever-home-nalas-ready-for-her-next-chapter": {
      "author": "Morgan Howard",
      "content_html": "<p>A dog once found living near an abandoned mall in Jackson is now looking for a permanent home after a turnaround that rescue volunteers describe as a “comeback” story.</p><p>Cheshire Abbey Animal Rescue said Nala, a young dog estimated to be about 2 years old, was initially wary and protective when she was first brought into care. Volunteers said she had been living outdoors and had recently cared for puppies, all of whom have since been adopted.</p><p>With time and consistent handling, the rescue said Nala has shown a calmer, affectionate side. She enjoys playing with other dogs to burn off energy but also settles in as a “cuddlebug,” according to the rescue.</p><p>Nala weighs about 50 to 55 pounds, is spayed and is up to date on vaccinations, the group said. Cheshire Abbey noted that, because of her rough start, Nala may need patience and a slow adjustment period as she settles into a new home.</p><p>Those interested in meeting or adopting Nala can contact Cheshire Abbey through its social media channels for adoption information.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-20/darkhorse-dogs-from-abandoned-mall-to-looking-for-her-forever-home-nalas-ready-for-her-next-chapter",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/638279847_1315304457290105_1470816865522118615_n-1.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-20/darkhorse-dogs-from-abandoned-mall-to-looking-for-her-forever-home-nalas-ready-for-her-next-chapter",
      "pub_date": "Fri, 20 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-20T00:00:00+00:00",
      "summary": "A dog once found living near an abandoned mall in Jackson is now looking for a permanent home after a turnaround that rescue volunteers describe as a “comeback” story.",
      "title": "DARKHORSE DOGS: From abandoned mall to looking for her forever home: Nala's ready for her next chapter - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-20/fitch-urges-passage-of-gun-crime-bills-targeting-juvenile-offenders-gang-activity": {
      "author": "Therese Apel",
      "content_html": "<p>JACKSON — Attorney General Lynn Fitch is urging Mississippi lawmakers to pass legislation that would increase penalties for certain firearm-related crimes involving minors and crack down on gang activity across the state.</p><p>Earlier this month, Fitch called on the Legislature to approve House Bill 1165 and Senate Bill 2710. The measures would give circuit courts original jurisdiction over certain firearm-related offenses committed by minors, increase penalties for the transfer of stolen firearms and create a new criminal penalty for shooting a firearm into a group.</p><p>The proposals have been endorsed by the Mississippi Prosecutors Association, the Mississippi Sheriffs’ Association and the Mississippi Association of Chiefs of Police.</p><p>Fitch said the legislation is aimed at addressing gang recruitment of minors and ensuring penalties match the severity of the crimes.</p><p>“There are more than 200 gangs in Mississippi, and they recruit minors to do a lot of their dirty work, knowing that punishment is often disproportionate to the severity of the crime,” Fitch said in a newsletter to supporters.</p><p>She said the bills would make juvenile recruitment less attractive to gangs and help remove violent offenders from the streets.</p><p>Lawmakers are considering the measures during the current legislative session.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-20/fitch-urges-passage-of-gun-crime-bills-targeting-juvenile-offenders-gang-activity",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/gangs-and-legislation-1.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-20/fitch-urges-passage-of-gun-crime-bills-targeting-juvenile-offenders-gang-activity",
      "pub_date": "Fri, 20 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-20T00:00:00+00:00",
      "summary": "JACKSON — Attorney General Lynn Fitch is urging Mississippi lawmakers to pass legislation that would increase penalties for certain firearm-related crimes involving minors and crack down on gang activity across the state.",
      "title": "Fitch Urges Passage of Gun Crime Bills Targeting Juvenile Offenders, Gang Activity - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-20/genealogical-dna-identifies-natchez-john-doe-as-kentucky-man": {
      "author": "Therese Apel",
      "content_html": "<p>NATCHEZ — Even as national headlines focus on genealogical DNA in the disappearance of Nancy Guthrie, skeletal remains discovered after a routine traffic stop in Natchez two years ago have been identified through similar means.</p><p>The set of remains found in March of 2024 were identified as a Kentucky man through advanced DNA testing and forensic genetic genealogy, according to Othram Labs.</p><p>The remains, long known as “Natchez John Doe,” were identified as William Francis Harrington after scientists developed a comprehensive DNA profile and confirmed a close biological relationship with a potential relative, Othram said.</p><p>The case began in 2024 when two Natchez police officers conducted a traffic stop near the intersection of Sgt. Prentiss Drive and Fatherland Road, according to previous reporting by WLBT and statements from Natchez Police Department Commander Jerry Ford.</p><p>Ford told reporters that officers noticed drug paraphernalia inside the small pickup truck after making contact with the driver.</p><p>“The officer who was backing up went up to the driver door, made contact with the driver and noticed paraphernalia inside of his vehicle,” Ford said.</p><p>After the driver was detained, he told officers he had information about a corpse in the nearby area.</p><p>“The suspect at that time stated to him that he had information about a corpse in the nearby area,” Ford said.</p><p>Officers called for backup and searched a wooded area about 10 feet off the road between Fatherland Road and the turnoff to First Lutheran Church. Beneath fallen leaves, they discovered skeletal remains buried in a shallow grave about 10 feet into the woods.</p><p>The remains were largely intact, but the head was missing. Authorities said the body had been there for a significant amount of time. At the time, no missing persons reports appeared to match the victim’s identity, and investigators declined to speculate about the detainee’s potential role or knowledge.</p><p>The Mississippi State Medical Examiner’s Office determined the remains belonged to an adult male estimated to be between 5 feet 9 inches and 6 feet 4 inches tall. An identification card found nearby suggested the man could have been around 70 years old, but officials could not confirm his identity. The case was entered into the National Missing and Unidentified Persons System as UP124871.</p><p>In June 2024, the Medical Examiner’s Office partnered with Othram, a forensic laboratory based in The Woodlands, Texas, to apply advanced DNA testing. According to Othram Labs, scientists used Forensic-Grade Genome Sequencing® to develop a DNA profile and conducted a forensic genetic genealogy search that generated new investigative leads.</p><p>Investigators later collected a reference DNA sample from a possible relative. Using Othram’s KinSNP® rapid relationship testing, scientists confirmed a close relationship, leading to the identification of the remains as Harrington, who was from Kentucky.</p><p>Othram said the advanced DNA testing and genealogy work in the case were funded through donations made via its DNASolves® crowdfunding platform.</p><p>The company said the identification marks the 38th publicly announced case in Mississippi in which officials have used Othram’s identity inference technology to help name unidentified remains.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-20/genealogical-dna-identifies-natchez-john-doe-as-kentucky-man",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/Screenshot-2026-02-20-132446.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-20/genealogical-dna-identifies-natchez-john-doe-as-kentucky-man",
      "pub_date": "Fri, 20 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-20T00:00:00+00:00",
      "summary": "NATCHEZ — Even as national headlines focus on genealogical DNA in the disappearance of Nancy Guthrie, skeletal remains discovered after a routine traffic stop in Natchez two years ago have been identified through similar means.",
      "title": "Genealogical DNA Identifies ‘Natchez John Doe’ as Kentucky Man - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-20/great-jones-county-donkey-roundup-ends-with-three-donkeys-in-safe-custody": {
      "author": "Morgan Howard",
      "content_html": "<p>JONES COUNTY — The Jones County Sheriff’s Department is asking for the public’s help locating the owner of three male donkeys found roaming near Quit Graves Road and Forest Holifield Road.</p><p>In a social media post, the sheriff’s department said deputies and residents tracked down the donkeys during what officials jokingly dubbed the “Great Jones County Donkey Roundup.” The department said Lee Stringer, Sam Smith, David Hare and Deputy R.H. Stockman helped take the animals into custody.</p><p>The sheriff’s department said the donkeys are now being cared for, fed and sheltered by Stringer while officials work to identify the owner.</p><p>Anyone who owns the three donkeys is asked to contact Stringer at 601-670-6345 to arrange pickup.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-20/great-jones-county-donkey-roundup-ends-with-three-donkeys-in-safe-custody",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/638432739_1225076146472985_3897556310918766738_n.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-20/great-jones-county-donkey-roundup-ends-with-three-donkeys-in-safe-custody",
      "pub_date": "Fri, 20 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-20T00:00:00+00:00",
      "summary": "JONES COUNTY — The Jones County Sheriff’s Department is asking for the public’s help locating the owner of three male donkeys found roaming near Quit Graves Road and Forest Holifield Road.",
      "title": "“Great Jones County Donkey Roundup” ends with three donkeys in safe custody - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-20/hattiesburg-police-arrest-armed-robbery-suspect-hiding-in-attic-after-hours-long-standoff": {
      "author": "Morgan Howard",
      "content_html": "<p>HATTIESBURG — Hattiesburg police arrested a 32-year-old man on an armed robbery charge after a standoff Friday in the 300 block of East Scooba Street.</p><p>Officers responded about 10:30 a.m. Feb. 20 while attempting to locate Brandon Rice, 32, of Hattiesburg, who police said was wanted in connection with an armed robbery reported about 9 a.m. in the 900 block of Broadway Drive.</p><p>Detectives identified Rice as the suspect and believed he was inside a residence on East Scooba Street, police said. Officers attempted to make contact for more than two hours before entering the home.</p><p>During a search, Rice was found hiding in an attic and was taken into custody without incident at about 2:10 p.m., police said.</p><p>Rice was charged with one count of armed robbery. Police said the investigation remains ongoing.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-20/hattiesburg-police-arrest-armed-robbery-suspect-hiding-in-attic-after-hours-long-standoff",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/01/Screenshot-2026-01-26-122528.png",
      "link": "https://darkhorsepressnow.com/news/2026-02-20/hattiesburg-police-arrest-armed-robbery-suspect-hiding-in-attic-after-hours-long-standoff",
      "pub_date": "Fri, 20 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-20T00:00:00+00:00",
      "summary": "HATTIESBURG — Hattiesburg police arrested a 32-year-old man on an armed robbery charge after a standoff Friday in the 300 block of East Scooba Street.",
      "title": "Hattiesburg police arrest armed robbery suspect hiding in attic after hours-long standoff - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-20/jackson-police-seek-suspects-in-early-morning-vehicle-burglaries": {
      "author": "Therese Apel",
      "content_html": "<p>JACKSON — Jackson Police Department is asking for the public’s help identifying suspects linked to a series of vehicle burglaries earlier this month.</p><p>Police said several vehicles were broken into during the early morning hours of Feb. 11 in the 5600 block of Keele Street and the 200 block of Briarwood Drive.</p><p>According to investigators, the suspects entered multiple vehicles and stole personal property. Authorities have released still images of individuals captured in the area at the time of the incidents.</p><p>The investigation remains ongoing.</p><p>Anyone who recognizes the individuals or has surveillance footage from the area is urged to contact the Jackson Police Department or submit an anonymous tip through Crime Stoppers.</p><p>Residents are also reminded to lock their vehicles and remove valuables to help prevent theft.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-20/jackson-police-seek-suspects-in-early-morning-vehicle-burglaries",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/Screenshot-2026-02-20-074859.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-20/jackson-police-seek-suspects-in-early-morning-vehicle-burglaries",
      "pub_date": "Fri, 20 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-20T00:00:00+00:00",
      "summary": "JACKSON — Jackson Police Department is asking for the public’s help identifying suspects linked to a series of vehicle burglaries earlier this month.",
      "title": "Jackson Police Seek Suspects in Early-Morning Vehicle Burglaries - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-20/jones-county-deputies-seek-woman-suspected-of-taking-black-2016-volkswagen-jetta": {
      "author": "Morgan Howard",
      "content_html": "<p>JONES COUNTY — The Jones County Sheriff’s Department is asking for the public’s help locating a woman investigators describe as the primary suspect in the felony taking of a motor vehicle.</p><p>Investigators said Lisa Crews is suspected of taking a black 2016 Volkswagen Jetta from a residence on Jeff Byrd Road in eastern Jones County. The vehicle is described as displaying a Jones County disabled tag, DB 5896R, authorities said.</p><p>Deputies said anyone with information about Crews’ whereabouts or the location of the vehicle is asked to contact the Jones County Sheriff’s Department at 601-425-3147 or Jones County Crime Stoppers at 601-428-STOP (7867). Officials said tips can be made anonymously.</p><p>The sheriff’s department said a booking photo of Crews from 2018 was released, noting that her appearance may have changed. Authorities also shared a stock photo of a black 2016 Volkswagen Jetta, emphasizing it is not the actual victim’s vehicle.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-20/jones-county-deputies-seek-woman-suspected-of-taking-black-2016-volkswagen-jetta",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/IMG_4305.jpeg",
      "link": "https://darkhorsepressnow.com/news/2026-02-20/jones-county-deputies-seek-woman-suspected-of-taking-black-2016-volkswagen-jetta",
      "pub_date": "Fri, 20 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-20T00:00:00+00:00",
      "summary": "JONES COUNTY — The Jones County Sheriff’s Department is asking for the public’s help locating a woman investigators describe as the primary suspect in the felony taking of a motor vehicle.",
      "title": "Jones County deputies seek woman suspected of taking black 2016 Volkswagen Jetta - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-20/judge-sentences-man-to-20-years-in-pontotoc-county-meth-trafficking-case": {
      "author": "Morgan Howard",
      "content_html": "<p>PONTOTOC COUNTY – A Pontotoc County man has been sentenced to 20 years in prison after pleading guilty to trafficking methamphetamine, according to the First Circuit District Attorney’s Office.</p><p>Prosecutors said Adrian Rashad McCoy entered the guilty plea Feb. 19, 2026. McCoy had been indicted by a Pontotoc County grand jury on a charge of trafficking of methamphetamine, officials said.</p><p>Judge Kelly Mims sentenced McCoy to 20 years in the custody of the Mississippi Department of Corrections, the district attorney’s office said. Prosecutors said McCoy will be required to serve the full sentence and is not eligible for parole or early release.</p><p>The case was investigated by Kory Clowers, the Pontotoc County Sheriff’s Department and the North Mississippi Narcotics Unit, according to the district attorney’s office. Assistant District Attorneys Megan French and Sidra Winter prosecuted the case.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-20/judge-sentences-man-to-20-years-in-pontotoc-county-meth-trafficking-case",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/639472196_1534164528715057_7770683558911172077_n.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-20/judge-sentences-man-to-20-years-in-pontotoc-county-meth-trafficking-case",
      "pub_date": "Fri, 20 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-20T00:00:00+00:00",
      "summary": "PONTOTOC COUNTY – A Pontotoc County man has been sentenced to 20 years in prison after pleading guilty to trafficking methamphetamine, according to the First Circuit District Attorney’s Office.",
      "title": "Judge sentences man to 20 years in Pontotoc County meth trafficking case - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-20/kemper-county-sheriff-seeks-publics-help-locating-man-wanted-on-aggravated-assault-charge": {
      "author": "Morgan Howard",
      "content_html": "<p>KEMPER COUNTY – The Kemper County Sheriff’s Office is asking for the public’s help locating a man wanted in connection with an aggravated assault case.</p><p>Authorities identified the suspect as Roosevelt Daniels. The sheriff’s office said Daniels is wanted on an aggravated assault charge and urged anyone with information about his whereabouts to contact investigators.</p><p>Anyone with information is asked to call the Kemper County Sheriff’s Office at 601-743-2255.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-20/kemper-county-sheriff-seeks-publics-help-locating-man-wanted-on-aggravated-assault-charge",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/638778556_122204097812372239_3104429549738146486_n.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-20/kemper-county-sheriff-seeks-publics-help-locating-man-wanted-on-aggravated-assault-charge",
      "pub_date": "Fri, 20 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-20T00:00:00+00:00",
      "summary": "KEMPER COUNTY – The Kemper County Sheriff’s Office is asking for the public’s help locating a man wanted in connection with an aggravated assault case.",
      "title": "Kemper County sheriff seeks public’s help locating man wanted on aggravated assault charge - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-20/mississippis-fire-on-the-forty-initiative-receives-national-land-stewardship-award": {
      "author": "Therese Apel",
      "content_html": "<p>JACKSON — Mississippi’s Fire on the Forty Initiative has received the Land Stewardship Award from the National Wild Turkey Federation, state wildlife officials announced.</p><p>The award, which honors outstanding efforts to promote wildlife habitat management, was presented during the federation’s 50th annual Convention and Sport Show in Nashville.</p><p>The initiative, led by the Mississippi Department of Wildlife, Fisheries, and Parks, is designed to expand the use of prescribed fire on privately owned fields and upland forests. The program provides hands-on workshops for landowners and offers cost-sharing assistance to help apply prescribed burns.</p><p>“We are honored to see Fire on the Forty recognized for its impact on wildlife habitat across Mississippi,” said MDWFP Executive Director Lynn Posey. “We look forward to seeing the continued impact prescribed burning has on Mississippi.”</p><p>The Fire on the Forty program is funded through multiple sources, including the U.S. Fish and Wildlife Service’s Partners for Fish and Wildlife Program, the National Fish and Wildlife Foundation, the National Wild Turkey Federation and the Mississippi Forestry Commission.</p><p>The initiative is administered by a committee of resource professionals from MDWFP, the U.S. Fish and Wildlife Service, Mississippi State University, Wildlife Mississippi, the Mississippi Forestry Commission, the National Wild Turkey Federation and the Mississippi Wildlife, Fisheries, Parks Marine Foundation.</p><p>“This award reflects the strong partnerships and dedicated landowners who make Fire on the Forty possible, and the lasting benefits prescribed fire provides for wildlife habitat and forest health across Mississippi,” said John Gruchy, MDWFP private lands program coordinator.</p><p>More information about the program is available at mdwfp.com/privatelands .</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-20/mississippis-fire-on-the-forty-initiative-receives-national-land-stewardship-award",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/Screenshot-2026-02-20-110112.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-20/mississippis-fire-on-the-forty-initiative-receives-national-land-stewardship-award",
      "pub_date": "Fri, 20 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-20T00:00:00+00:00",
      "summary": "JACKSON — Mississippi’s Fire on the Forty Initiative has received the Land Stewardship Award from the National Wild Turkey Federation, state wildlife officials announced.",
      "title": "Mississippi’s Fire on the Forty Initiative Receives National Land Stewardship Award - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-20/national-caregivers-day-shines-light-on-millions-providing-unseen-unpaid-care": {
      "author": "Therese Apel",
      "content_html": "<p>USA — National Caregivers Day, observed the third Friday in February, honors the millions of Americans who provide daily care to loved ones, patients and residents, often with little recognition and, in most cases, no pay at all.</p><p>The observance was established in 2015 by the Providers Association for Home Health &amp; Hospice Agencies, known as PAHHHA, according to NationalToday.com. The first celebration took place in 2016, with the goal of dedicating a day each year to recognize and appreciate caregivers everywhere.</p><p>Caregivers provide everything from medical aid to personal grooming, feeding, and providing comfort and companionship. Yet across the board, many are underappreciated, underpaid or unpaid.</p><p>The scope of caregiving in the United States is vast. The National Alliance for Caregiving and AARP reported that in 2020, an estimated 53 million Americans provided unpaid care to an adult or child. One in five U.S. adults offers unpaid care to an adult family member, according to surveys cited by Radiant Senior Living .</p><p>The Gallup-Healthways Well-Being Index found caregivers spend an average of six days each month grooming, feeding, dressing, bathing and walking those in their care. They spend 13 days a month commuting, cleaning, doing laundry, monitoring medication, shopping and preparing special meals. Another 13 hours monthly are devoted to coordinating doctor visits, researching symptoms and managing finances, NationalToday.com reports.</p><p>Those are black and white averages in articles written on the internet. To many Americans, it’s 24 hours a day, 7 days a week, 365 days a year.</p><p>Women shoulder much of that responsibility. The Institute on Aging reports that more than three-quarters of caregivers are female and spend 50% more time providing essential services than men. Nearly 75% of caregivers are women, according to data cited by RadiantSeniorLiving.com.</p><p>Caregiving can take a toll. Per the National Alliance for Caregiving, 23% of Americans say caregiving has harmed their health. Nearly 40% of caregivers over age 50 describe the emotional strain as highly demanding, and 42% report a financial impact from their caregiving responsibilities.</p><p>Many caregivers are older adults themselves. NationalToday.com reports the average age of someone caring for a person 65 or older is 63. As the number of hours devoted to caregiving increases, many report their own health challenges.</p><p>Professional caregivers also face demanding schedules and emotional labor. Radiant Senior Living notes that professional caregivers “frequently treat their patients and residents as if they were members of their own families,” providing consistent care and compassion.</p><p>National Caregivers Day recognizes both professional and informal caregivers, including friends, family members, pastors, and even surviving parents navigating grief while supporting children who have lost a parent.</p><p>Psychology Today highlights the unique challenges facing grieving caregivers, especially surviving parents.</p><p>“The well-being of a caregiver who is grieving is essential to their child’s well-being,” Rebecca Hobbs-Lawrence, M.A., of the Dougy Center for Grieving Children &amp; Families, told the publication. “Caregivers need space to grieve themselves and to seek the support of others.”</p><p>She said it is helpful for caregivers to dedicate time to their own thoughts and feelings, whether through walking, journaling, making art or simply sitting quietly.</p><p>Experts and advocacy groups say small gestures can make a significant difference. Writing a positive review, sending a handwritten thank-you note, offering respite care, assisting with errands or simply acknowledging a caregiver’s efforts are meaningful ways to show appreciation.</p><p>For that son or daughter who is caring for their ailing parent, which is physically, financially, personally, spiritually, and emotionally devastating, simply taking them to lunch or coffee, listening to them talk about what they’re going through, and letting them know they’re seen and not alone is a priceless gift.</p><p>NationalToday.com notes that caregivers’ “special kindness and patience” deserve year-round recognition. On National Caregivers Day, supporters are encouraged to check in, offer help and remember that caring for the caregiver is just as important as caring for those they serve.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-20/national-caregivers-day-shines-light-on-millions-providing-unseen-unpaid-care",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/01/shutterstock_2484505015.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-20/national-caregivers-day-shines-light-on-millions-providing-unseen-unpaid-care",
      "pub_date": "Fri, 20 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-20T00:00:00+00:00",
      "summary": "USA — National Caregivers Day, observed the third Friday in February, honors the millions of Americans who provide daily care to loved ones, patients and residents, often with little recognition and, in most cases, no pay at all.",
      "title": "National Caregivers Day Shines Light on Millions Providing Unseen, Unpaid Care - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-20/pedestrian-hit-by-vehicle-in-tupelo": {
      "author": "Morgan Howard",
      "content_html": "<p>TUPELO — Tupelo police were responding Friday to a vehicle-versus-pedestrian crash on North Gloster Street near McCullough Boulevard.</p><p>The Tupelo Police Department said an adult pedestrian was injured and transported to North Mississippi Medical Center for treatment. The extent of the injuries was not released.</p><p>Police urged motorists to use caution in the area and consider alternate routes while emergency crews worked the scene.</p><p>Authorities said additional information may be released as it becomes available.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-20/pedestrian-hit-by-vehicle-in-tupelo",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2022/01/michael-fortsch-y5LaV9IEC_g-unsplash-scaled-e1646618817809.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-20/pedestrian-hit-by-vehicle-in-tupelo",
      "pub_date": "Fri, 20 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-20T00:00:00+00:00",
      "summary": "TUPELO — Tupelo police were responding Friday to a vehicle-versus-pedestrian crash on North Gloster Street near McCullough Boulevard.",
      "title": "Pedestrian hit by vehicle in Tupelo - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-20/second-suspect-arrested-in-scheffel-road-atv-theft-case-in-adams-county": {
      "author": "Morgan Howard",
      "content_html": "<p>ADAMS COUNTY – A second suspect has been arrested in an ongoing investigation into the theft and recovery of an all-terrain vehicle from property on Scheffel Road, according to the Adams County Sheriff’s Office.</p><p>Sheriff’s officials said Jerry W. Rodgers Jr., 49, of Natchez, was taken into custody Friday, Feb. 20, 2026, at about 7:54 a.m. He was charged with receiving, possessing, or disposing of stolen property.</p><p>Rodgers was booked into the Adams County Jail, and bond was set at $60,000.</p><p>Authorities said the arrest follows the recovery of the stolen ATV and the earlier arrest of Amanda Breland on related charges. Investigators said the case remains active and additional arrests are possible.</p><p>Anyone with information is asked to contact the Adams County Sheriff’s Office at 601-442-2752 or Adams County E911.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-20/second-suspect-arrested-in-scheffel-road-atv-theft-case-in-adams-county",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/637292357_777326268758263_2762445419532721302_n.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-20/second-suspect-arrested-in-scheffel-road-atv-theft-case-in-adams-county",
      "pub_date": "Fri, 20 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-20T00:00:00+00:00",
      "summary": "ADAMS COUNTY – A second suspect has been arrested in an ongoing investigation into the theft and recovery of an all-terrain vehicle from property on Scheffel Road, according to the Adams County Sheriff’s Office.",
      "title": "Second suspect arrested in Scheffel Road ATV theft case in Adams County - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-20/traffic-stop-in-picayune-leads-to-drug-arrests-after-deputies-find-meth-pills": {
      "author": "Morgan Howard",
      "content_html": "<p>PICAYUNE — Two men were arrested following a traffic stop in Picayune after narcotics investigators reported finding methamphetamine and prescription pills inside a vehicle, according to the Pearl River County Sheriff’s Department.</p><p>Sheriff’s officials said narcotics investigators stopped a 2005 Infiniti QX56 on Ceasar Road on Wednesday, Feb. 4, 2026, for disregard of traffic devices.</p><p>Authorities identified the driver as James Spence, 43, of Carriere, and the passenger as Cameron Franks, 20, also of Carriere. Investigators said Spence was arrested during the stop for having no driver’s license.</p><p>During an inventory of the vehicle, investigators reported locating methamphetamine, Adderall and oxycodone. Both Spence and Franks were taken into custody, the sheriff’s department said.</p><p>Spence was charged with felony possession with intent to distribute, felony possession of controlled substances and misdemeanor possession of controlled substances, according to the department. Franks was charged with felony possession of controlled substances.</p><p>Sheriff David Allison credited deputies and investigators for their work in drug enforcement efforts in the county.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-20/traffic-stop-in-picayune-leads-to-drug-arrests-after-deputies-find-meth-pills",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/639580247_1285560423595438_4634490268553075677_n.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-20/traffic-stop-in-picayune-leads-to-drug-arrests-after-deputies-find-meth-pills",
      "pub_date": "Fri, 20 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-20T00:00:00+00:00",
      "summary": "PICAYUNE — Two men were arrested following a traffic stop in Picayune after narcotics investigators reported finding methamphetamine and prescription pills inside a vehicle, according to the Pearl River County Sheriff’s Department.",
      "title": "Traffic stop in Picayune leads to drug arrests after deputies find meth, pills - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-20/two-arrested-in-madison-auto-burglaries-third-suspect-sought": {
      "author": "Therese Apel",
      "content_html": "<p>MADISON — Two Jackson men have been arrested and charged in connection with a series of vehicle burglaries reported across Madison, and authorities are searching for a third suspect.</p><p>The Madison Police Department said officers responded Thursday, Feb. 19, to reports of multiple auto burglaries throughout the city.</p><p>Investigators quickly developed leads that led them to Jackson, where a vehicle of interest was located on Maria Drive. With assistance from the Mississippi Capitol Police and the Hinds County Sheriff’s Department, authorities arrested 25-year-old Willie Deonta Thomas and 23-year-old Harold Stiff, both of Jackson.</p><p>Police said evidence connected to the burglaries was recovered during the investigation.</p><p>Both men have been charged with eight counts of auto burglary. Additional charges are possible.</p><p>Authorities also issued a warrant for Christian B. Stiff of Jackson on eight counts of auto burglary and are seeking information that could lead to his arrest.</p><p>During the investigation, officers determined Thomas was on parole from the Mississippi Department of Corrections at the time of his arrest. Investigators also said Harold Stiff is currently out on bond in Hinds County on an aggravated assault charge.</p><p>The suspects are scheduled for an initial appearance in City of Madison Municipal Court. The case will be forwarded to District Attorney Bubba Bramlett for prosecution.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-20/two-arrested-in-madison-auto-burglaries-third-suspect-sought",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/Screenshot-2026-02-20-074048.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-20/two-arrested-in-madison-auto-burglaries-third-suspect-sought",
      "pub_date": "Fri, 20 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-20T00:00:00+00:00",
      "summary": "MADISON — Two Jackson men have been arrested and charged in connection with a series of vehicle burglaries reported across Madison, and authorities are searching for a third suspect.",
      "title": "Two Arrested in Madison Auto Burglaries; Third Suspect Sought - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-20/ummc-says-fbi-teams-assisting-onsite-as-cyberattack-response-continues": {
      "author": "Morgan Howard",
      "content_html": "<p>JACKSON – The University of Mississippi Medical Center said Friday that teams are working “around the clock” to respond to a cyberattack that disrupted systems Thursday, with federal authorities and specialized FBI teams assisting onsite.</p><p>Cybersecurity attack forces UMMC to close statewide clinics, cancel outpatient procedures</p><p>In an update dated Feb. 20, 2026, UMMC said it has also engaged three national vendors specializing in cyber forensics, recovery and security. The medical center said it remains unknown how extensive the intrusion is or how long it will take to return to normal operations.</p><p>UMMC said its phone systems and its ability to send or receive emails remain down or unreliable.</p><p>Hospital services and emergency departments continue operating, UMMC said, adding that it has notified other hospitals it can again accept patient transfers requiring higher levels of care. UMMC directed facilities seeking transfers to contact Mississippi MED-COM at 601-362-4264 and said ambulance services have been notified that the medical center is no longer on diversion.</p><p>UMMC said it is developing a way for patients to contact the medical center regarding routine medical or medication needs and will announce that process once available. The medical center said it is also reaching out to patients who need time-sensitive treatments, including chemotherapy, to arrange appointments.</p><p>UMMC apologized for the disruption and said it hopes to return to normal operations as soon as possible.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-20/ummc-says-fbi-teams-assisting-onsite-as-cyberattack-response-continues",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2022/12/ummc.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-20/ummc-says-fbi-teams-assisting-onsite-as-cyberattack-response-continues",
      "pub_date": "Fri, 20 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-20T00:00:00+00:00",
      "summary": "JACKSON – The University of Mississippi Medical Center said Friday that teams are working “around the clock” to respond to a cyberattack that disrupted systems Thursday, with federal authorities and specialized FBI teams assisting onsite.",
      "title": "UMMC says FBI teams assisting onsite as cyberattack response continues - Darkhorse Press"
    }
  },
  "last_run_utc": "2026-02-22T01:12:26.643451+00:00",
  "seen_urls": [
    "https://darkhorsepressnow.com/news/2026-02-20/pedestrian-hit-by-vehicle-in-tupelo",
    "https://darkhorsepressnow.com/news/2026-02-20/hattiesburg-police-arrest-armed-robbery-suspect-hiding-in-attic-after-hours-long-standoff",
    "https://darkhorsepressnow.com/news/2026-02-20/great-jones-county-donkey-roundup-ends-with-three-donkeys-in-safe-custody",
    "https://darkhorsepressnow.com/news/2026-02-20/ummc-says-fbi-teams-assisting-onsite-as-cyberattack-response-continues",
    "https://darkhorsepressnow.com/news/2026-02-20/genealogical-dna-identifies-natchez-john-doe-as-kentucky-man",
    "https://darkhorsepressnow.com/news/2026-02-20/second-suspect-arrested-in-scheffel-road-atv-theft-case-in-adams-county",
    "https://darkhorsepressnow.com/news/2026-02-20/traffic-stop-in-picayune-leads-to-drug-arrests-after-deputies-find-meth-pills",
    "https://darkhorsepressnow.com/news/2026-02-20/jones-county-deputies-seek-woman-suspected-of-taking-black-2016-volkswagen-jetta",
    "https://darkhorsepressnow.com/news/2026-02-20/mississippis-fire-on-the-forty-initiative-receives-national-land-stewardship-award",
    "https://darkhorsepressnow.com/news/2026-02-20/darkhorse-dogs-from-abandoned-mall-to-looking-for-her-forever-home-nalas-ready-for-her-next-chapter",
    "https://darkhorsepressnow.com/news/2026-02-20/national-caregivers-day-shines-light-on-millions-providing-unseen-unpaid-care",
    "https://darkhorsepressnow.com/news/2026-02-20/kemper-county-sheriff-seeks-publics-help-locating-man-wanted-on-aggravated-assault-charge",
    "https://darkhorsepressnow.com/news/2026-02-20/judge-sentences-man-to-20-years-in-pontotoc-county-meth-trafficking-case",
    "https://darkhorsepressnow.com/news/2026-02-20/fitch-urges-passage-of-gun-crime-bills-targeting-juvenile-offenders-gang-activity",
    "https://darkhorsepressnow.com/news/2026-02-20/jackson-police-seek-suspects-in-early-morning-vehicle-burglaries",
    "https://darkhorsepressnow.com/news/2026-02-20/two-arrested-in-madison-auto-burglaries-third-suspect-sought",
    "https://darkhorsepressnow.com/news/2026-02-19/air-national-guard-to-host-sentry-south-26-2-exercise-across-mississippi",
    "https://darkhorsepressnow.com/news/2026-02-19/nonprofit-honors-fallen-lee-county-deputy-rick-haggard-with-dog-tag-necklaces-gifts",
    "https://darkhorsepressnow.com/news/2026-02-19/man-found-shot-to-death-after-domestic-disturbance-in-george-county",
    "https://darkhorsepressnow.com/news/2026-02-19/historic-photo-recreation-exhibition-lectures-highlight-mcs-200th-birthday-celebration",
    "https://darkhorsepressnow.com/news/2026-02-19/jackson-police-seek-suspect-in-two-burglaries-at-hometown-bbq",
    "https://darkhorsepressnow.com/news/2026-02-19/study-absolutely-nobody-checked-on-12659-mississippi-seniors-in-january",
    "https://darkhorsepressnow.com/news/2026-02-19/cheshire-abbey-rescues-dogs-surrendered-during-raid-at-jackson-home",
    "https://darkhorsepressnow.com/news/2026-02-19/sheriff-no-more-deputies-standing-in-roadway-for-shannon-school-traffic-control",
    "https://darkhorsepressnow.com/news/2026-02-19/woman-charged-after-man-shot-at-apartment-complex-in-greenville",
    "https://darkhorsepressnow.com/news/2026-02-19/tate-county-sheriffs-office-k-9s-soul-and-stuccie-receive-donated-body-armor",
    "https://darkhorsepressnow.com/news/2026-02-19/crime-stoppers-tupelo-police-seek-publics-help-identifying-suspects-in-walmart-jewelry-theft",
    "https://darkhorsepressnow.com/news/2026-02-19/street-sweeper-driver-killed-in-collision-with-18-wheeler-in-lowndes-county",
    "https://darkhorsepressnow.com/news/2026-02-19/meridian-police-department-makes-first-arrest-under-mississippi-grooming-statute",
    "https://darkhorsepressnow.com/news/2026-02-19/cybersecurity-attack-forces-ummc-to-close-statewide-clinics-cancel-outpatient-procedures",
    "https://darkhorsepressnow.com/news/2026-02-19/two-arrested-third-sought-in-pearl-river-county-drive-by-shooting-investigation",
    "https://darkhorsepressnow.com/news/2026-02-19/officer-prisoner-killed-in-i-10-crash-involving-transport-van-in-jackson-county",
    "https://darkhorsepressnow.com/news/2026-02-19/man-found-shot-to-death-in-vacant-skyline-drive-home",
    "https://darkhorsepressnow.com/news/2026-02-19/thursday-weather-cloudy-and-warm-slight-chance-of-rain-later",
    "https://darkhorsepressnow.com/news/2026-02-18/three-arrested-after-joint-narcotics-operation-in-forrest-lamar-county",
    "https://darkhorsepressnow.com/news/2026-02-18/suspect-in-raymond-road-homicide-given-no-bond-on-murder-charge",
    "https://darkhorsepressnow.com/news/2026-02-18/jones-county-crash-suspect-faces-dui-charges-ice-detainer-leads-to-transfer-from-detention-facility",
    "https://darkhorsepressnow.com/news/2026-02-18/father-charged-with-child-neglect-after-6-year-old-injured-in-greenville-shooting",
    "https://darkhorsepressnow.com/news/2026-02-18/woman-charged-after-domestic-stabbing-in-lamar-county",
    "https://darkhorsepressnow.com/news/2026-02-18/tupelo-man-sentenced-to-25-years-after-guilty-plea-in-2023-killing",
    "https://darkhorsepressnow.com/news/2026-02-18/natchez-woman-charged-in-atv-theft-investigation-on-scheffel-road",
    "https://darkhorsepressnow.com/news/2026-02-18/student-taken-into-custody-after-handgun-found-in-vehicle-at-alcorn-central-high-school",
    "https://darkhorsepressnow.com/news/2026-02-18/pony-ride-day-set-for-april-4-at-strong-river-equine-center-in-brandon",
    "https://darkhorsepressnow.com/news/2026-02-18/salvation-army-to-host-1920s-themed-senior-prom-in-jackson",
    "https://darkhorsepressnow.com/news/2026-02-18/southern-pines-waives-reduces-dog-adoption-fees-during-weekend-event",
    "https://darkhorsepressnow.com/news/2026-02-18/como-man-sentenced-to-5-years-in-federal-prison-for-cocaine-distribution",
    "https://darkhorsepressnow.com/news/2026-02-18/starkville-derby-dachshund-race-set-for-record-turnout-april-25",
    "https://darkhorsepressnow.com/news/2026-02-18/teen-arrested-charged-with-capital-murder-in-fatal-grove-circle-shooting",
    "https://darkhorsepressnow.com/news/2026-02-18/jackson-woman-arrested-in-fatal-shooting-at-chapel-ridge-apartments",
    "https://darkhorsepressnow.com/news/2026-02-18/wednesday-weather-mostly-cloudy-and-warm-with-near-record-highs",
    "https://darkhorsepressnow.com/news/2026-02-17/saltillo-man-charged-with-felony-marijuana-trafficking-hydrocodone-possession-after-tupelo-stop",
    "https://darkhorsepressnow.com/news/2026-02-17/tupelo-police-investigate-shooting-that-injured-juvenile-on-fillmore-drive",
    "https://darkhorsepressnow.com/news/2026-02-17/inmate-dies-after-being-found-unresponsive-in-alcorn-county-jail-cell",
    "https://darkhorsepressnow.com/news/2026-02-17/nettleton-man-charged-with-sexual-battery-of-child-under-14",
    "https://darkhorsepressnow.com/news/2026-02-17/jackson-police-seek-missing-32-year-old-man-last-seen-sunday",
    "https://darkhorsepressnow.com/news/2026-02-17/clinton-nature-center-to-host-spring-break-bird-camp-for-ages-9-12",
    "https://darkhorsepressnow.com/news/2026-02-17/update-man-found-dead-outside-jackson-apartment-complex-on-raymond-road-identified",
    "https://darkhorsepressnow.com/news/2026-02-17/jackson-state-awarded-14-5-million-nih-contract-to-extend-jackson-heart-study-training-center",
    "https://darkhorsepressnow.com/news/2026-02-17/jackson-police-investigate-fatal-hit-and-run-involving-man-in-wheelchair-on-mcdowell-road",
    "https://darkhorsepressnow.com/news/2026-02-17/arkansas-fugitive-found-in-rankin-county-after-controlled-drug-buy",
    "https://darkhorsepressnow.com/news/2026-02-17/driver-dies-after-vehicle-crashes-into-natchez-church",
    "https://darkhorsepressnow.com/news/2026-02-17/random-acts-of-kindness-day-encourages-small-gestures-with-big-impact",
    "https://darkhorsepressnow.com/news/2026-02-17/harrison-county-deputies-seek-suspect-in-attempted-business-break-in",
    "https://darkhorsepressnow.com/news/2026-02-17/oxford-lafayette-community-assistance-fund-launched-to-aid-winter-storm-fern-recovery",
    "https://darkhorsepressnow.com/news/2026-02-16/rodeo-royalty-bullfighters-visit-st-dominic-nicu-during-dixie-national-week",
    "https://darkhorsepressnow.com/news/2026-02-16/police-seek-publics-help-finding-missing-101-year-old-gulfport-man",
    "https://darkhorsepressnow.com/news/2026-02-19/man-found-dead-after-reported-domestic-altercation-in-george-county",
    "https://darkhorsepressnow.com/news/2026-02-16/gulfport-teen-charged-with-aggravated-assault-in-shooting-of-14-year-old",
    "https://darkhorsepressnow.com/news/2026-02-16/public-asked-to-help-identify-individual-in-recent-vicksburg-shooting",
    "https://darkhorsepressnow.com/news/2026-02-16/silver-alert-issued-for-missing-63-year-old-vicksburg-man",
    "https://darkhorsepressnow.com/news/2026-02-16/man-shot-multiple-times-in-jackson-drives-himself-to-safety",
    "https://darkhorsepressnow.com/news/2026-02-16/adams-county-deputies-recover-dirt-bike-reported-stolen-in-louisiana-in-2022",
    "https://darkhorsepressnow.com/news/2026-02-16/biloxi-police-seek-help-identifying-suspect-in-petit-larceny-case",
    "https://darkhorsepressnow.com/news/2026-02-16/natchez-man-found-dead-after-vehicle-crashes-into-tree",
    "https://darkhorsepressnow.com/news/2026-02-16/ocean-springs-police-seek-woman-wanted-on-felony-exploitation-charge",
    "https://darkhorsepressnow.com/news/2026-02-16/woman-arrested-on-felony-drug-and-child-endangerment-charges-at-fulton-safety-checkpoint",
    "https://darkhorsepressnow.com/news/2026-02-16/two-ef1-tornadoes-confirmed-in-lincoln-county-nws-storm-surveys-continue",
    "https://darkhorsepressnow.com/news/2026-02-16/man-found-shot-to-death-in-jackson-apartment-complex-parking-lot",
    "https://darkhorsepressnow.com/news/2026-02-16/presidents-day-weather-temps-warming-to-the-60s",
    "https://darkhorsepressnow.com/news/2026-02-16/celebrate-the-day-do-something-kind-for-the-grouch-in-your-life",
    "https://darkhorsepressnow.com/news/2026-02-16/missing-in-mississippi-vickie-ellington-attala-county-2",
    "https://darkhorsepressnow.com/news/2026-02-14/mbi-probes-officer-involved-shooting-near-crestview-street-in-jackson",
    "https://darkhorsepressnow.com/news/2026-02-13/natchez-man-arrested-on-statutory-rape-warrant-in-adams-county",
    "https://darkhorsepressnow.com/news/top-story/2026-02-13/vehicle-crashes-into-indianola-walmart-four-injured",
    "https://darkhorsepressnow.com/news/2026-02-13/reward-offered-for-missing-french-bulldog-last-seen-near-old-rice-road-in-canton",
    "https://darkhorsepressnow.com/news/2026-02-13/jackson-police-seek-publics-help-identifying-suspects-in-attempted-copper-theft",
    "https://darkhorsepressnow.com/news/top-story/2026-02-13/human-trafficking-investigation-in-pascagoula-leads-to-arrests-charges-against-66-year-old-man",
    "https://darkhorsepressnow.com/news/2026-02-13/waynesboro-man-arrested-after-near-head-on-encounter-with-jones-county-deputy"
  ]
}