{
  "items": {
    "https://darkhorsepressnow.com/news/2026-02-16/missing-in-mississippi-vickie-ellington-attala-county-2": {
      "author": "Therese Apel",
      "content_html": "<p>LOUISVILLE — Vickie Ellington, a 53-year-old business owner and grandmother, was last heard from Jan. 27, 2011, after sending text messages to friends saying she was going to meet someone in Louisville.</p><p>Friends became concerned and began to search for Vickie when they were unable to reach her on the phone. They later found her Chevrolet Suburban parked in the Wal-Mart parking lot in Louisville. She wasn’t with the vehicle and never returned to it, which people said didn’t make sense since she had custody of her grandson, who was 8 years old at the time.</p><p>Authorities reviewed surveillance footage from the parking lot. Video showed Vickie’s Suburban parking, and a person getting out of it and walking toward the nearby McDonald’s and Taco Bell before leaving the camera’s range. No one ever returned to the vehicle, according to investigators.</p><p>It’s unclear if there was ever a lead on who that person might have been.</p><p>It also remains unclear whether it was actually Vickie who sent the text messages about meeting someone in Louisville. The person she was reportedly supposed to meet told others the two had not made plans that day.</p><p>Vickie Ellington had light brown or blonde hair, was 5 feet 7 inches tall and weighed about 150 pounds. She also owned a gym in Kosciusko.</p><p>Ellington has not been found. She was declared dead by her family in 2018, and her disappearance remains unsolved.</p><p>The Attala County Sheriff’s Department is the lead agency on the case. Anyone with information is asked to contact the department at (662) 289-5556.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-16/missing-in-mississippi-vickie-ellington-attala-county-2",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-Copy-of-in-Mississippi-3.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-16/missing-in-mississippi-vickie-ellington-attala-county-2",
      "pub_date": "Mon, 16 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-16T00:00:00+00:00",
      "summary": "LOUISVILLE — Vickie Ellington, a 53-year-old business owner and grandmother, was last heard from Jan. 27, 2011, after sending text messages to friends saying she was going to meet someone in Louisville.",
      "title": "MISSING IN MISSISSIPPI: Vickie Ellington, Attala County - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-16/natchez-man-found-dead-after-vehicle-crashes-into-tree": {
      "author": "Morgan Howard",
      "content_html": "<p>NATCHEZ – An Adams County man was found dead Saturday after his vehicle left the roadway and struck a tree near North Palestine Road, according to the Adams County Sheriff’s Office.</p><p>Adams County E911 received a call at about 1:53 p.m. Feb. 14 reporting a vehicle in a ditch near North Palestine Road, the sheriff’s office said. Deputies responding to the scene located a vehicle that had left the roadway and hit a tree.</p><p>The driver, identified as Charles Michael Smith, 71, of Natchez, was found unresponsive behind the wheel. American Medical Response personnel responded and confirmed Smith was deceased, according to the release.</p><p>A preliminary investigation indicates Smith appeared to have overcorrected his steering, causing the vehicle to leave the roadway and collide with the tree, the sheriff’s office said.</p><p>The Adams County coroner responded and took possession of the body. A wrecker service removed the vehicle from the scene.</p><p>The incident remains under investigation. No foul play is suspected at this time.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-16/natchez-man-found-dead-after-vehicle-crashes-into-tree",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/631576358_773111592513064_8182585226474558438_n.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-16/natchez-man-found-dead-after-vehicle-crashes-into-tree",
      "pub_date": "Mon, 16 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-16T00:00:00+00:00",
      "summary": "NATCHEZ – An Adams County man was found dead Saturday after his vehicle left the roadway and struck a tree near North Palestine Road, according to the Adams County Sheriff’s Office.",
      "title": "Natchez man found dead after vehicle crashes into tree - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-16/ocean-springs-police-seek-woman-wanted-on-felony-exploitation-charge": {
      "author": "Therese Apel",
      "content_html": "<p>OCEAN SPRINGS — Ocean Springs police are searching for a 30-year-old woman wanted on a charge of felony exploitation of a vulnerable adult.</p><p>According to the Ocean Springs Police Department, Kiera Gaines drives a silver Nissan Altima bearing Mississippi tag HEE163. She is known to frequently travel throughout the Mississippi Coast, including Gulfport, Biloxi and Ocean Springs.</p><p>No further details were released about the situation leading to her charges.</p><p>Authorities are asking anyone with information about her whereabouts to contact Crime Stoppers by downloading the P3 Tips app or by calling **TIPS. To be eligible for a reward, information must be submitted directly through Crime Stoppers.</p><p>All persons are presumed innocent until proven guilty in a court of law.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-16/ocean-springs-police-seek-woman-wanted-on-felony-exploitation-charge",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/Kiera-Gaines.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-16/ocean-springs-police-seek-woman-wanted-on-felony-exploitation-charge",
      "pub_date": "Mon, 16 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-16T00:00:00+00:00",
      "summary": "OCEAN SPRINGS — Ocean Springs police are searching for a 30-year-old woman wanted on a charge of felony exploitation of a vulnerable adult.",
      "title": "Ocean Springs police seek woman wanted on felony exploitation charge - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-16/police-seek-publics-help-finding-missing-101-year-old-gulfport-man": {
      "author": "Therese Apel",
      "content_html": "<p>GULFPORT — The Gulfport Police Department is asking for the public’s help in locating a 101-year-old man who was last seen Saturday.</p><p>Joseph Edward Hyland, of Gulfport, was last seen Feb. 14 in the 1800 block of Beach Drive, according to police.</p><p>Hyland is described as 5 feet 10 inches tall and weighing approximately 180 pounds. He has green eyes and gray hair.</p><p>Police said he is believed to be driving a white 2005 Honda Accord.</p><p>Anyone with information about Hyland’s whereabouts is urged to contact the Gulfport Police Department at 228-868-5959 or Mississippi Coast Crime Stoppers at 877-787-5898.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-16/police-seek-publics-help-finding-missing-101-year-old-gulfport-man",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/Screenshot-2026-02-16-144026.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-16/police-seek-publics-help-finding-missing-101-year-old-gulfport-man",
      "pub_date": "Mon, 16 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-16T00:00:00+00:00",
      "summary": "GULFPORT — The Gulfport Police Department is asking for the public’s help in locating a 101-year-old man who was last seen Saturday.",
      "title": "Police Seek Public’s Help Finding Missing 101-Year-Old Gulfport Man - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-16/presidents-day-weather-temps-warming-to-the-60s": {
      "author": "Mary Apel",
      "content_html": "",
      "guid": "https://darkhorsepressnow.com/news/2026-02-16/presidents-day-weather-temps-warming-to-the-60s",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/Weather-9.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-16/presidents-day-weather-temps-warming-to-the-60s",
      "pub_date": "Mon, 16 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-16T00:00:00+00:00",
      "summary": "Max/Min temperatures this week will warm through Thursday before cooler temperatures return for the weekend.",
      "title": "Presidents’ Day Weather: Temps warming to the 60s - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-16/public-asked-to-help-identify-individual-in-recent-vicksburg-shooting": {
      "author": "Morgan Howard",
      "content_html": "<p>VICKSBURG — The Vicksburg Police Department is asking for the public’s help identifying a person of interest in connection with a recent shooting.</p><p>In a BOLO notice tied to Case No. 26-644, police released a photo of the individual and asked anyone with information to come forward.</p><p>Authorities said tips can be directed to Investigator Gladys Kersh at 601-876-8045, the Vicksburg Police Department at 601-636-2511, or CrimeStoppers at 601-355-8477.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-16/public-asked-to-help-identify-individual-in-recent-vicksburg-shooting",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/Screenshot-2026-02-16-133703.png",
      "link": "https://darkhorsepressnow.com/news/2026-02-16/public-asked-to-help-identify-individual-in-recent-vicksburg-shooting",
      "pub_date": "Mon, 16 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-16T00:00:00+00:00",
      "summary": "VICKSBURG — The Vicksburg Police Department is asking for the public’s help identifying a person of interest in connection with a recent shooting.",
      "title": "Public asked to help identify individual in recent Vicksburg shooting - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-16/rodeo-royalty-bullfighters-visit-st-dominic-nicu-during-dixie-national-week": {
      "author": "Morgan Howard",
      "content_html": "<p>JACKSON — St. Dominic said rodeo royalty and professional bullfighters from the Dixie National Rodeo visited the hospital’s Neonatal Intensive Care Unit last week to read to infants.</p><p>According to St. Dominic, Miss Rodeo America Olivia Favero and Miss Rodeo Canada Abbey Hartey took part in the NICU visit, where babies were dressed in western-themed outfits to mark the occasion.</p><p>Hospital officials said reading aloud to infants supports neurodevelopment and can help reduce stress, making the visit both celebratory and beneficial for patients and families.</p><p>The NICU event also coincided with FMOL Health | St. Dominic’s first sponsorship of the 2026 Dixie National Livestock Show and Rodeo, the hospital said. As part of the partnership, St. Dominic branding appears with rodeo programming, including with professional bullfighters, and healthcare staff are offering free screenings at select events, including blood pressure checks.</p><p>St. Dominic said the 61st annual Dixie National Livestock Show and Rodeo runs through Feb. 21.</p><p>Source: FMOL Health | St. Dominic press release, Feb. 16, 2026.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-16/rodeo-royalty-bullfighters-visit-st-dominic-nicu-during-dixie-national-week",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/unnamed-9.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-16/rodeo-royalty-bullfighters-visit-st-dominic-nicu-during-dixie-national-week",
      "pub_date": "Mon, 16 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-16T00:00:00+00:00",
      "summary": "JACKSON — St. Dominic said rodeo royalty and professional bullfighters from the Dixie National Rodeo visited the hospital’s Neonatal Intensive Care Unit last week to read to infants.",
      "title": "STEPPING UP TO SERVE: Rodeo royalty, bullfighters visit St. Dominic NICU during Dixie National week - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-16/silver-alert-issued-for-missing-63-year-old-vicksburg-man": {
      "author": "Morgan Howard",
      "content_html": "<p>VICKSBURG — The Mississippi Bureau of Investigation has issued a Silver Alert for a 63-year-old Vicksburg man reported missing and considered at risk.</p><p>The alert, issued Monday on behalf of the Vicksburg Police Department, identifies the missing man as Arthur Hicks, 63. He is described as 5 feet 11 inches tall, about 220 pounds, with salt-and-pepper hair, brown eyes and a salt-and-pepper beard.</p><p>Authorities said Hicks was last seen Tuesday, Feb. 10, at about 1 p.m. in the 700 block of Harris Street in Warren County, walking in an unknown direction. He was last seen wearing a blue Nike T-shirt, shorts and gray shoes.</p><p>Family members told investigators that Hicks has a medical condition that may impair his judgment.</p><p>Anyone who sees Hicks is asked to call the Vicksburg Police Department at 601-636-2511 or call 911.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-16/silver-alert-issued-for-missing-63-year-old-vicksburg-man",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/Screenshot-2026-02-16-113501.png",
      "link": "https://darkhorsepressnow.com/news/2026-02-16/silver-alert-issued-for-missing-63-year-old-vicksburg-man",
      "pub_date": "Mon, 16 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-16T00:00:00+00:00",
      "summary": "VICKSBURG — The Mississippi Bureau of Investigation has issued a Silver Alert for a 63-year-old Vicksburg man reported missing and considered at risk.",
      "title": "Silver Alert issued for missing 63-year-old Vicksburg man - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-16/two-ef1-tornadoes-confirmed-in-lincoln-county-nws-storm-surveys-continue": {
      "author": "Therese Apel",
      "content_html": "<p>UPDATE : Lawrence County EMA Director Tony Norwood posted the following on Facebook this morning.</p><p>“Update on the weather yesterday here in Lawrence county. We had 2 tornados both were classified as Ef1 tornados with maximum winds of 105 mph. The damaged areas was John Peyton Rd for the strom that came out of Pike Co. The other storm came out of Lincoln and that damage was mainly on Foster Rd. We are very blessed we had no injuries.”</p><p>Original story:</p><p>LINCOLN/LAWRENCE COUNTIES — Two EF1 tornadoes have been confirmed in Lincoln County following severe storms that swept across southwest Mississippi late Saturday night, causing structural damage, downed trees and power outages, according to information first reported by the Brookhaven Daily Leader.</p><p>The National Weather Service in Jackson said meteorologists surveyed damage Sunday from storms that occurred during the night of Saturday, Feb. 14, 2026, and the morning of Sunday, Feb. 15, 2026. Four preliminary tornado tracks were identified in Lincoln and Lawrence counties, with additional surveys planned Monday, Feb. 16, in Lawrence, Jefferson Davis and Covington counties.</p><p>In Lincoln County, the National Weather Service confirmed two EF1 tornadoes after assessing damage, much of it concentrated in and around Bogue Chitto. Lincoln County Emergency Management Director Chris Reid told the Daily Leader that the storm system moved through the area around midnight, damaging homes and outbuildings. Some of the destruction was caused by fallen trees and high winds.</p><p>A mobile home was destroyed after being moved off its blocks, Reid said. As of Sunday, no injuries had been reported, though damage reports were still being received from across the county.</p><p>The first tornado, rated EF1, traveled approximately 6.8 miles along the Norfield track. It began in Summit and ended in Bogue Chitto. Tree damage was most extensive west of Interstate 55, particularly along Jack Lane, Summit Drive, Beechnut Trail, Wallace Drive, Montgomery Road, Dry Creek Trail and Homesville Road.</p><p>The second EF1 tornado, along the Enterprise track, traveled about 2.1 miles from Bogue Chitto to Brookhaven. It began near Mount Olive Road and tracked northeast across Shell Oil Lane and Mississippi Highway 583 before lifting near Highway 583 and Bethel Road.</p><p>Authorities said crews worked through the night and into Sunday morning clearing roads and assessing damage.</p><p>The National Weather Service said the Norfield and Enterprise tornado tracks may receive additional survey work, meaning track details and damage information could be updated as assessments continue.</p><p>The Lawrence County Emergency Management Association said Sunday that the county was “very blessed” during the storms. The agency reported damage to three homes and two mobile homes on John Payton Lane south of Monticello. No injuries were reported. Power outages occurred throughout the county, and numerous trees were down, blocking roads.</p><p>According to Lawrence County EMA, first responders and supervisors cleared debris, and all roads were reopened as of Sunday.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-16/two-ef1-tornadoes-confirmed-in-lincoln-county-nws-storm-surveys-continue",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/1.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-16/two-ef1-tornadoes-confirmed-in-lincoln-county-nws-storm-surveys-continue",
      "pub_date": "Mon, 16 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-16T00:00:00+00:00",
      "summary": "UPDATE : Lawrence County EMA Director Tony Norwood posted the following on Facebook this morning.",
      "title": "EF1 Tornadoes Confirmed in Lincoln and Lawrence Counties; Surveys Continue - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-16/woman-arrested-on-felony-drug-and-child-endangerment-charges-at-fulton-safety-checkpoint": {
      "author": "Therese Apel",
      "content_html": "<p>FULTON — A woman was arrested Thursday during a safety checkpoint in Fulton and charged with multiple felony drug offenses and child endangerment, authorities said.</p><p>Amy Lauren Tillotson was taken into custody Feb. 12 during a checkpoint on Country Club Road within the city limits of Fulton. The arrest was made by the Fulton Police Department, with assistance from the Itawamba County Sheriff’s Department and the North Mississippi Narcotics Unit.</p><p>Tillotson was charged with felony possession of fentanyl, felony possession of cocaine and felony tampering with physical evidence, along with several misdemeanor charges. She was also charged with felony child endangerment stemming from a previous investigation.</p><p>Authorities said the arrest is part of an ongoing investigation conducted by the Fulton Police Department and Mississippi Child Protection Services.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-16/woman-arrested-on-felony-drug-and-child-endangerment-charges-at-fulton-safety-checkpoint",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/Amy-Tillotson-e1771251166673.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-16/woman-arrested-on-felony-drug-and-child-endangerment-charges-at-fulton-safety-checkpoint",
      "pub_date": "Mon, 16 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-16T00:00:00+00:00",
      "summary": "FULTON — A woman was arrested Thursday during a safety checkpoint in Fulton and charged with multiple felony drug offenses and child endangerment, authorities said.",
      "title": "Woman arrested on felony drug and child endangerment charges at Fulton safety checkpoint - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-17/arkansas-fugitive-found-in-rankin-county-after-controlled-drug-buy": {
      "author": "Morgan Howard",
      "content_html": "<p>RANKIN COUNTY – A suspect wanted in Arkansas was found and arrested in Rankin County during a joint fentanyl investigation by local law enforcement.</p><p>According to the Rankin County Sheriff’s Office and Pearl Police Department, deputies and officers conducted a controlled purchase of fentanyl and suboxone on Sunday, Feb. 15, 2026, involving Kendall Wayne Peden.</p><p>Peden was taken into custody and booked into the Rankin County Jail on charges of sale of a Schedule II controlled substance and sale of a Schedule III controlled substance. Authorities said both charges were enhanced because the alleged sales occurred within 1,500 feet of a church.</p><p>After he was booked, deputies determined Peden was also wanted in Arkansas.</p><p>The Rankin County District Attorney’s Office is expected to bring Peden before Rankin County Court Judge David Morrow for an initial appearance.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-17/arkansas-fugitive-found-in-rankin-county-after-controlled-drug-buy",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/unnamed-11.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-17/arkansas-fugitive-found-in-rankin-county-after-controlled-drug-buy",
      "pub_date": "Tue, 17 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-17T00:00:00+00:00",
      "summary": "RANKIN COUNTY – A suspect wanted in Arkansas was found and arrested in Rankin County during a joint fentanyl investigation by local law enforcement.",
      "title": "Arkansas fugitive found in Rankin County after controlled drug buy - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-17/clinton-nature-center-to-host-spring-break-bird-camp-for-ages-9-12": {
      "author": "Therese Apel",
      "content_html": "<p>CLINTON — The Clinton Community Nature Center is partnering with the Jackson Audubon Society to offer a Spring Break Bird Camp for children ages 9 to 12 from March 9-13.</p><p>The five-day camp will run from 8 a.m. to 2 p.m. daily at the nature center, 617 Dunton Road in Clinton. The cost is $250 per child, and organizers encourage families to secure a spot and complete a registration form for each participant.</p><p>Campers will explore the outdoors while learning how to identify birds using field guides and binoculars. Participants will also build a bluebird nest box and take part in imaginative play in the center’s Play Forest.</p><p>Organizers said the camp is designed to combine hands-on education with outdoor adventure, giving children an opportunity to connect with nature during spring break.</p><p>Free exploration time in the Play Forest will be offered at the beginning and end of each day. Drop-off is available between 8 a.m. and 9 a.m., and pickup is scheduled between 1 p.m. and 2 p.m., allowing families flexibility without missing instructional time led by Jackson Audubon Society educators.</p><p>An email with a detailed schedule, clothing recommendations and food information will be sent to registered families one week prior to camp.</p><p>The Clinton Community Nature Center, a nonprofit organization founded in 1997, operates on 32.2 acres of native vegetation and hardwood forest trails. Its 2.5-mile trail system includes a portion of the historic Natchez Trace and the site of the 1872 Sumner Hill School, the first public school for African Americans in Hinds County. The center’s trails are free and open to the public seven days a week.</p><p>The organization’s mission is to conserve land and historic features while providing a place for the appreciation, enjoyment and study of nature. The center serves the Jackson metro area and hosts more than 20,000 visitors annually through its trails and events.</p><p>For more information about Spring Break Bird Camp, visit www.clintonnaturecenter.org or call 601-926-1104. Families with questions may email [email protected] or [email protected] .</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-17/clinton-nature-center-to-host-spring-break-bird-camp-for-ages-9-12",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/Screenshot-2026-02-17-120315.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-17/clinton-nature-center-to-host-spring-break-bird-camp-for-ages-9-12",
      "pub_date": "Tue, 17 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-17T00:00:00+00:00",
      "summary": "CLINTON — The Clinton Community Nature Center is partnering with the Jackson Audubon Society to offer a Spring Break Bird Camp for children ages 9 to 12 from March 9-13.",
      "title": "Clinton Nature Center to Host Spring Break Bird Camp for Ages 9-12 - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-17/driver-dies-after-vehicle-crashes-into-natchez-church": {
      "author": "Therese Apel",
      "content_html": "<p>NATCHEZ — A driver died Monday after a vehicle left U.S. Highway 61 and crashed into a church property in Natchez, authorities said.</p><p>Deputies with the Adams County Sheriff’s Office were dispatched at approximately 5:05 p.m. to Smithland Baptist Church, 1360 U.S. Highway 61 North, in reference to a vehicle that had struck the church.</p><p>When deputies arrived, they found a blue Mercury passenger vehicle had left the highway, traveled through the church gate, up a hill and collided with the front of the building. Initial findings indicate the driver suffered an apparent medical emergency before leaving the roadway, authorities said.</p><p>Deputies initiated life-saving measures after determining the driver had a weak pulse. Adams County Emergency Medical Services responded and continued medical intervention efforts, but the driver was pronounced dead at the scene. The incident is being investigated as a fatal crash.</p><p>Because the crash originated on a state highway, the Mississippi Highway Patrol was notified and has assumed primary responsibility for the investigation.</p><p>The driver’s next of kin has been notified. The sheriff’s office extended condolences to the family and said further updates will be provided by the Mississippi Highway Patrol.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-17/driver-dies-after-vehicle-crashes-into-natchez-church",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/adams-county.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-17/driver-dies-after-vehicle-crashes-into-natchez-church",
      "pub_date": "Tue, 17 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-17T00:00:00+00:00",
      "summary": "NATCHEZ — A driver died Monday after a vehicle left U.S. Highway 61 and crashed into a church property in Natchez, authorities said.",
      "title": "Driver Dies After Vehicle Crashes Into Natchez Church - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-17/harrison-county-deputies-seek-suspect-in-attempted-business-break-in": {
      "author": "Therese Apel",
      "content_html": "<p>HARRISON COUNTY — The Harrison County Sheriff’s Office is asking for the public’s help in identifying a man accused of attempting to break into a business earlier this month.</p><p>Investigators said an unknown male attempted to pry open the front door of a business Feb. 10 on Mississippi Highway 53 near County Farm Road.</p><p>Authorities released information about the incident and are seeking assistance in identifying the individual involved.</p><p>Anyone with information about the crime or the identity of the suspect is urged to contact Crime Stoppers by downloading the P3 Tips app or by calling **TIPS. To qualify for a reward, information must be submitted directly through Crime Stoppers.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-17/harrison-county-deputies-seek-suspect-in-attempted-business-break-in",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/Harrison-crowbar.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-17/harrison-county-deputies-seek-suspect-in-attempted-business-break-in",
      "pub_date": "Tue, 17 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-17T00:00:00+00:00",
      "summary": "HARRISON COUNTY — The Harrison County Sheriff’s Office is asking for the public’s help in identifying a man accused of attempting to break into a business earlier this month.",
      "title": "Harrison County Deputies Seek Suspect in Attempted Business Break-In - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-17/inmate-dies-after-being-found-unresponsive-in-alcorn-county-jail-cell": {
      "author": "Morgan Howard",
      "content_html": "<p>ALCORN COUNTY – An inmate at the Alcorn County Jail was found unresponsive early Tuesday during routine cell checks and was later pronounced dead, according to the Alcorn County Sheriff’s Office.</p><p>Sheriff’s officials said jail staff discovered the inmate at about 6:30 a.m. in a single-occupancy cell.</p><p>Staff began CPR immediately and called for medical assistance, authorities said. Magnolia EMS responded and pronounced the inmate dead at the jail.</p><p>Alcorn County deputies and investigators secured the scene, and the Mississippi Bureau of Investigation was called to conduct an independent investigation, the sheriff’s office said.</p><p>The Alcorn County coroner is expected to transport the body to the state crime lab for an autopsy. Authorities said additional information will be released when available.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-17/inmate-dies-after-being-found-unresponsive-in-alcorn-county-jail-cell",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2024/12/s-1.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-17/inmate-dies-after-being-found-unresponsive-in-alcorn-county-jail-cell",
      "pub_date": "Tue, 17 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-17T00:00:00+00:00",
      "summary": "ALCORN COUNTY – An inmate at the Alcorn County Jail was found unresponsive early Tuesday during routine cell checks and was later pronounced dead, according to the Alcorn County Sheriff’s Office.",
      "title": "Inmate dies after being found unresponsive in Alcorn County Jail cell - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-17/jackson-police-investigate-fatal-hit-and-run-involving-man-in-wheelchair-on-mcdowell-road": {
      "author": "Morgan Howard",
      "content_html": "<p>JACKSON — A 31-year-old man was killed in a hit-and-run crash Monday night on East McDowell Road, according to the Jackson Police Department.</p><p>Police said officers were dispatched at about 8:41 p.m. to the 400 block of East McDowell Road, near 411 E. McDowell Road, after a report of a fatal vehicle-versus-pedestrian crash.</p><p>According to an accident investigator’s preliminary report, an unknown vehicle traveling east on McDowell Road struck a male pedestrian who was believed to be in a wheelchair in the middle of the street. Police said the driver did not remain at the scene.</p><p>The victim was pronounced dead, and his body was recovered by the coroner. His identity is being withheld pending notification of next of kin.</p><p>The crash remains under investigation. Anyone with information is asked to call Jackson police at 601-960-1234 or Crime Stoppers at 601-355-TIPS (8477).</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-17/jackson-police-investigate-fatal-hit-and-run-involving-man-in-wheelchair-on-mcdowell-road",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2025/08/shutterstock_722099620-e1755792249812.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-17/jackson-police-investigate-fatal-hit-and-run-involving-man-in-wheelchair-on-mcdowell-road",
      "pub_date": "Tue, 17 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-17T00:00:00+00:00",
      "summary": "JACKSON — A 31-year-old man was killed in a hit-and-run crash Monday night on East McDowell Road, according to the Jackson Police Department.",
      "title": "Jackson police investigate fatal hit-and-run involving man in wheelchair on McDowell Road - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-17/jackson-police-seek-missing-32-year-old-man-last-seen-sunday": {
      "author": "Morgan Howard",
      "content_html": "<p>JACKSON – The Jackson Police Department is asking for the public’s help locating a missing 32-year-old man.</p><p>Police said Terrance Gardner was last seen Sunday, Feb. 15, 2026, wearing a red hoodie, blue jeans and tennis shoes of an unknown color.</p><p>According to police, Gardner was reportedly riding in a yellow-and-blue Dodge Charger with an unknown driver when he was last seen.</p><p>Authorities said Gardner has been entered into the National Crime Information Center database by Cpl. Mayfield.</p><p>Anyone with information on Gardner’s whereabouts is urged to contact the Jackson Police Department.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-17/jackson-police-seek-missing-32-year-old-man-last-seen-sunday",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/635152627_1216671780641969_7687683910830053802_n.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-17/jackson-police-seek-missing-32-year-old-man-last-seen-sunday",
      "pub_date": "Tue, 17 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-17T00:00:00+00:00",
      "summary": "JACKSON – The Jackson Police Department is asking for the public’s help locating a missing 32-year-old man.",
      "title": "Jackson police seek missing 32-year-old man last seen Sunday - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-17/jackson-state-awarded-14-5-million-nih-contract-to-extend-jackson-heart-study-training-center": {
      "author": "Morgan Howard",
      "content_html": "<p>JACKSON – Jackson State University has received a 10-year, $14.5 million federal contract to continue its Jackson Heart Study Graduate Training and Education Center, the university announced Tuesday.</p><p>The award comes from the National Heart, Lung, and Blood Institute and the National Institute on Minority Health and Health Disparities, both part of the National Institutes of Health. University officials said the funding renews Jackson State’s role in the long-running Jackson Heart Study collaboration, which they describe as the largest investigation of cardiovascular disease in African Americans.</p><p>Jackson State said it has received more than $25 million in NIH funding related to the study since 2013.</p><p>Interim President Denise Jones Gregory said the new award reflects the university’s ability to secure major federal research partnerships and support health outcomes for families.</p><p>Heart disease remains a leading cause of death in the United States, and African Americans face higher rates, according to the Centers for Disease Control and Prevention. The university said related conditions, including hypertension, obesity and diabetes, also disproportionately affect Black communities and contribute to cardiovascular risk.</p><p>Launched in 1998, the Jackson Heart Study has followed more than 5,300 participants ages 34 to 85 in the Jackson metropolitan area, building long-term health data and biological samples used for research and prevention efforts. The program marked a 25-year milestone last year tied to its first participant clinical exam in 2000.</p><p>The Graduate Training and Education Center at Jackson State was established in 2013 to prepare graduate students for careers in biomedical and public health sciences, with an emphasis on disease prevention and health promotion in underserved communities.</p><p>Dr. Marinelle Payton, principal investigator of the center at Jackson State, said the renewed funding will help train future public health leaders to translate cardiovascular research into prevention strategies and earlier care.</p><p>Dr. Almesha Campbell, the university’s vice president for research and economic development, said the award strengthens Jackson State’s research role while expanding workforce development focused on health disparities.</p><p>Partner institutions in the Jackson Heart Study collaboration include the University of Mississippi Medical Center, Tougaloo College, the University of Southern Mississippi, Wake Forest University and the G.A. Carmichael Family Health Center.</p><p>(Written from a press release from The LEPR Agency)</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-17/jackson-state-awarded-14-5-million-nih-contract-to-extend-jackson-heart-study-training-center",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/JHS-GTEC-JacksonState.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-17/jackson-state-awarded-14-5-million-nih-contract-to-extend-jackson-heart-study-training-center",
      "pub_date": "Tue, 17 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-17T00:00:00+00:00",
      "summary": "JACKSON – Jackson State University has received a 10-year, $14.5 million federal contract to continue its Jackson Heart Study Graduate Training and Education Center, the university announced Tuesday.",
      "title": "Jackson State awarded $14.5 million NIH contract to extend Jackson Heart Study training center - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-17/nettleton-man-charged-with-sexual-battery-of-child-under-14": {
      "author": "Therese Apel",
      "content_html": "<p>LEE COUNTY — A 25-year-old Nettleton man has been charged with two counts of sexual battery of a child under 14 following an investigation into alleged abuse involving a child younger than 6, Lee County Sheriff Jim Johnson said in a Facebook release Tuesday.</p><p>The Lee County Sheriff’s Office said it was notified by Child Protective Services of possible sexual abuse involving a young child. The agency’s Criminal Investigation Division launched an inquiry, during which allegations of sexual assault against a child surfaced.</p><p>Johnson alleged that Casey Drake Moore committed sexual acts against the child on at least two occasions in Lee County. Authorities also developed information suggesting a similar incident may have occurred in another jurisdiction and said they are sharing information with officials there to assist in a separate investigation.</p><p>Moore was arrested Feb. 13 and charged with two counts of sexual battery of a child under 14. A Lee County Justice Court judge set his bond at $500,000.</p><p>The investigation remains ongoing, and additional charges may be filed as new information becomes available.</p><p>The sheriff’s office expressed appreciation to Child Protective Services and the Easter Seals of Mississippi Child Advocacy Center for their assistance in the case.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-17/nettleton-man-charged-with-sexual-battery-of-child-under-14",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/Screenshot-2026-02-17-132012.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-17/nettleton-man-charged-with-sexual-battery-of-child-under-14",
      "pub_date": "Tue, 17 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-17T00:00:00+00:00",
      "summary": "LEE COUNTY — A 25-year-old Nettleton man has been charged with two counts of sexual battery of a child under 14 following an investigation into alleged abuse involving a child younger than 6, Lee County Sheriff Jim Johnson said in a Facebook release Tuesday.",
      "title": "Nettleton Man Charged With Sexual Battery of Child Under 14 - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-17/oxford-lafayette-community-assistance-fund-launched-to-aid-winter-storm-fern-recovery": {
      "author": "Therese Apel",
      "content_html": "<p>OXFORD — Community leaders, churches and nonprofit organizations in Oxford and Lafayette County have launched a coordinated relief effort to assist residents recovering from Winter Storm Fern.</p><p>The Oxford-Lafayette Community Assistance Fund was created as a collaborative response to provide financial assistance to individuals and families facing storm-related hardship. Organizers say the effort is designed to bridge the gap while residents wait for potential state or federal assistance.</p><p>Rather than establishing a single centralized donation site, participating churches and nonprofit partners are working through their own networks and channels to coordinate giving and distribute aid quickly where it is most needed.</p><p>Initial assistance will focus on urgent needs affecting safety and housing stability, including electrical repairs, plumbing repairs, tree removal and debris hazards. Organizers said additional categories of support may be added as needs are assessed and resources grow.</p><p>Residents of the city of Oxford or Lafayette County experiencing verified storm-related hardship may request assistance through a community intake process. Walk-up intake hours will be held from 9 a.m. to noon Feb. 18 through Feb. 28 at the Old OPC Building, located under the Blue Oxford Water tower at 310 S. 15th St.</p><p>Requests may also be submitted online at https://tinyurl.com/fernhelp or by calling 662-234-1100.</p><p>Applications will be reviewed by a collaborative assessment team led by Doors of Hope in partnership with the North Mississippi Exchange Family Center. The team will verify eligibility, prioritize urgent safety concerns and match approved cases with available resources. When possible, payments will be made directly to licensed vendors or service providers for verified repairs.</p><p>Participating church partners include Oxford-University United Methodist Church , First Baptist Church Oxford , First Presbyterian Church and St. Peter’s Episcopal Church . Community and nonprofit partners include Doors of Hope and the North Mississippi Exchange Family Center .</p><p>Organizers are also building a network of licensed local vendors to assist with recovery work, prioritizing electrical and plumbing repairs and tree removal. Community members may submit vendor information through an online form. Participation in the network does not guarantee work assignments but allows businesses to be considered as recovery needs arise.</p><p>Organizations interested in joining the coordinated fundraising effort may contact Chris McAlilly, lead pastor of Oxford-University United Methodist Church, at [email protected] .</p><p>Organizers said the goal of the fund is to help neighbors recover, rebuild and remain safely housed through a shared community response.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-17/oxford-lafayette-community-assistance-fund-launched-to-aid-winter-storm-fern-recovery",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/01/622124330_1240416211531849_9211823942130337927_n.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-17/oxford-lafayette-community-assistance-fund-launched-to-aid-winter-storm-fern-recovery",
      "pub_date": "Tue, 17 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-17T00:00:00+00:00",
      "summary": "OXFORD — Community leaders, churches and nonprofit organizations in Oxford and Lafayette County have launched a coordinated relief effort to assist residents recovering from Winter Storm Fern.",
      "title": "Oxford-Lafayette Community Assistance Fund Launched to Aid Winter Storm Fern Recovery - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-17/random-acts-of-kindness-day-encourages-small-gestures-with-big-impact": {
      "author": "Therese Apel",
      "content_html": "<p>A cup of coffee paid for in the drive-thru line. A handwritten note left on a coworker’s desk. A stranger offering to carry groceries.</p><p>Those simple moments are at the heart of Random Acts of Kindness Day, observed annually on Feb. 17, a day dedicated to encouraging people to intentionally spread compassion in their communities.</p><p>Founded in 1995 in Denver, Colorado, by the nonprofit Random Acts of Kindness Foundation, the observance has grown into an international movement promoting everyday generosity. The organization later expanded the celebration into Random Acts of Kindness Week, emphasizing that kindness should extend far beyond a single day.</p><p>“Make Kindness the Norm, Not the Exception,” the foundation urges on its website, highlighting the social and emotional benefits of thoughtful actions.</p><p>Research cited by the organization suggests kindness carries measurable health benefits. Acts of generosity can release hormones such as oxytocin and serotonin, which are associated with reduced stress and increased happiness. According to statistics shared by the foundation, people who regularly engage in kind behavior have 23% lower cortisol levels, and a 2020 survey found that 63% of adults reported improved mental health both from receiving and giving kindness.</p><p>Organizers say kindness also strengthens relationships in schools, workplaces and neighborhoods, helping build trust and empathy while breaking down social barriers.</p><p>The movement has attracted more than 261,000 self-described “RAKtivists” in 89 countries, according to RandomActsOfKindness.org . Participants receive a “Daily Dose of Kindness®” email with ideas and inspiration for incorporating compassion into everyday life.</p><p>While the observance is modern, advocates note that kindness itself is timeless. From community volunteers to global humanitarian figures, history has repeatedly shown how small actions can leave lasting impressions.</p><p>Supporters of the day say participation does not require money or grand gestures. Holding a door, offering encouragement, checking on a neighbor or simply listening can create a ripple effect.</p><p>Random Acts of Kindness Day serves as a reminder that meaningful change often begins with ordinary people choosing to act with care — one small gesture at a time.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-17/random-acts-of-kindness-day-encourages-small-gestures-with-big-impact",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/shutterstock_1095186722.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-17/random-acts-of-kindness-day-encourages-small-gestures-with-big-impact",
      "pub_date": "Tue, 17 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-17T00:00:00+00:00",
      "summary": "A cup of coffee paid for in the drive-thru line. A handwritten note left on a coworker’s desk. A stranger offering to carry groceries.",
      "title": "Random Acts of Kindness Day Encourages Small Gestures With Big Impact - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-17/saltillo-man-charged-with-felony-marijuana-trafficking-hydrocodone-possession-after-tupelo-stop": {
      "author": "Morgan Howard",
      "content_html": "<p>TUPELO — A Saltillo man was arrested and charged with felony marijuana trafficking and felony possession of hydrocodone after a traffic stop in Tupelo and a follow-up search at a residence, according to the North Mississippi Narcotics Unit.</p><p>Agents said they stopped a 2022 Ford Bronco on Feb. 10 on North Gloster Street for an equipment violation and identified the driver as Octavious Nathaniel Coleman, 38, of Saltillo.</p><p>Investigators said probable cause was developed during the stop, and a vehicle search led to the seizure of about one pound of suspected marijuana and several dosage units of suspected hydrocodone.</p><p>After the stop, agents executed a search warrant at a residence on Mandi Drive in Saltillo, where they said they found more than 15 pounds of suspected marijuana, additional dosage units of suspected hydrocodone, two firearms and $76,970 in U.S. currency.</p><p>Coleman was charged with felony trafficking of marijuana and felony possession of hydrocodone.</p><p>Lee County Justice Court Judge Marilyn Reed denied bond because Coleman was already out on a felony bond on a previous charge at the time of his arrest, officials said.</p><p>Authorities said the investigation remains ongoing and additional charges may be filed.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-17/saltillo-man-charged-with-felony-marijuana-trafficking-hydrocodone-possession-after-tupelo-stop",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/Screenshot-2026-02-17-143334.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-17/saltillo-man-charged-with-felony-marijuana-trafficking-hydrocodone-possession-after-tupelo-stop",
      "pub_date": "Tue, 17 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-17T00:00:00+00:00",
      "summary": "TUPELO — A Saltillo man was arrested and charged with felony marijuana trafficking and felony possession of hydrocodone after a traffic stop in Tupelo and a follow-up search at a residence, according to the North Mississippi Narcotics Unit.",
      "title": "Saltillo man charged with felony marijuana trafficking, hydrocodone possession after Tupelo stop - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-17/tupelo-police-investigate-shooting-that-injured-juvenile-on-fillmore-drive": {
      "author": "Morgan Howard",
      "content_html": "<p>Tupelo police are investigating a Friday night shooting that injured a juvenile in the 2100 block of Fillmore Drive.</p><p>Officers said they responded at about 10:13 p.m. Feb. 13 after the juvenile arrived at North Mississippi Medical Center by private vehicle with a gunshot wound.</p><p>According to a preliminary investigation, the juvenile had been attending a gathering at a home in the area when multiple shots were fired outside the residence.</p><p>Police said the victim was taken to the hospital before officers arrived and remains under medical care. Authorities said no additional medical details will be released.</p><p>Officers processed the residence and surrounding area for evidence, and detectives are continuing to investigate the circumstances of the shooting, police said.</p><p>No arrests have been made. Because a juvenile is involved, police said no additional identifying information will be released.</p><p>Anyone with information is asked to contact Tupelo police at 662-841-6491 or Crime Stoppers of Northeast Mississippi at 1-800-773-TIPS.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-17/tupelo-police-investigate-shooting-that-injured-juvenile-on-fillmore-drive",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/634708411_1361606992663433_8544543539978437859_n.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-17/tupelo-police-investigate-shooting-that-injured-juvenile-on-fillmore-drive",
      "pub_date": "Tue, 17 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-17T00:00:00+00:00",
      "summary": "Tupelo police are investigating a Friday night shooting that injured a juvenile in the 2100 block of Fillmore Drive.",
      "title": "Tupelo police investigate shooting that injured juvenile on Fillmore Drive - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-17/update-man-found-dead-outside-jackson-apartment-complex-on-raymond-road-identified": {
      "author": "Morgan Howard",
      "content_html": "<p>A man found dead outside of an apartment complex in Jackson has been identified by the coroner.</p><p>Man Found Shot to Death in Jackson Apartment Complex Parking Lot</p><p>According to JPD, the victim was identified as 30-year-old Kynjarious Rockingham.</p><p>He was found dead yesterday in the 1600 block of Raymond Road.</p><p>This is an ongoing investigation. If you have any information in reference to this case, please contact the Jackson Police Department at 601-960-1234 or Crime Stoppers at 601-355-TIPS (8477).</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-17/update-man-found-dead-outside-jackson-apartment-complex-on-raymond-road-identified",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2025/04/police-lights-1.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-17/update-man-found-dead-outside-jackson-apartment-complex-on-raymond-road-identified",
      "pub_date": "Tue, 17 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-17T00:00:00+00:00",
      "summary": "A man found dead outside of an apartment complex in Jackson has been identified by the coroner.",
      "title": "UPDATE: Man found dead outside Jackson apartment complex on Raymond Road Identified - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-18/como-man-sentenced-to-5-years-in-federal-prison-for-cocaine-distribution": {
      "author": "Therese Apel",
      "content_html": "<p>ABERDEEN — A Como man was sentenced Tuesday to five years in federal prison after pleading guilty to distributing cocaine, federal officials announced.</p><p>Irish Lee, 49, was sentenced to 60 months in prison followed by three years of supervised release by Senior U.S. District Judge Michael P. Mills. Lee was remanded to the custody of the U.S. Marshals Service following the hearing.</p><p>According to court records, Lee previously pleaded guilty Nov. 13, 2025, to cocaine distribution. He was charged in a federal indictment that also named Christopher Mack as a co-defendant. Mack has also pleaded guilty to distribution of cocaine and is scheduled to be sentenced March 19.</p><p>U.S. Attorney Scott F. Leary and FBI Special Agent in Charge Robert Eikhoff announced the sentence.</p><p>Leary said the case is part of the Homeland Security Task Force initiative, a multiagency effort targeting drug trafficking, cartels and related crimes. The Mississippi task force includes agents from the FBI, Homeland Security Investigations, the Bureau of Alcohol, Tobacco, Firearms and Explosives and the Drug Enforcement Administration, working alongside the U.S. Attorney’s Office.</p><p>“Through historic interagency collaboration, the HSTF directs the full might of United States law enforcement towards identifying, investigating and prosecuting such crimes,” Leary said in a statement.</p><p>Eikhoff said illegal drugs such as cocaine harm communities and vowed continued enforcement efforts.</p><p>“The FBI, the Cleveland Police Department, the Homeland Security Task Force and our law enforcement partners will continue to work tirelessly to pursue individuals like Mr. Lee who bring these harmful substances into our communities,” Eikhoff said.</p><p>Assistant U.S. Attorney Chad Doleac prosecuted the case.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-18/como-man-sentenced-to-5-years-in-federal-prison-for-cocaine-distribution",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2023/06/pexels-ekaterina-bolovtsova-6077447-scaled.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-18/como-man-sentenced-to-5-years-in-federal-prison-for-cocaine-distribution",
      "pub_date": "Wed, 18 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-18T00:00:00+00:00",
      "summary": "ABERDEEN — A Como man was sentenced Tuesday to five years in federal prison after pleading guilty to distributing cocaine, federal officials announced.",
      "title": "Como Man Sentenced to 5 Years in Federal Prison for Cocaine Distribution - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-18/father-charged-with-child-neglect-after-6-year-old-injured-in-greenville-shooting": {
      "author": "Morgan Howard",
      "content_html": "<p>GREENVILLE – A 6-year-old boy was injured Monday after he shot himself with a handgun, and his father has been arrested on a child neglect charge, according to Greenville police.</p><p>Officers responded about 5:40 p.m. Feb. 16 to Delta Health Systems at 1400 E. Union Avenue after a report of a juvenile with a gunshot wound, the Greenville Police Department said.</p><p>Police said they spoke with the child’s father, Justin Lowe Sr., who told officers his son shot himself with his 9mm handgun. The father told investigators he had gotten up to use the restroom when he heard a gunshot, then ran into the room and found his son had been shot in the leg.</p><p>The child was taken to the emergency room and was later transported to another medical facility for additional treatment. Police said the injury was considered non-life-threatening.</p><p>Investigators arrested Lowe on one count of child neglect. He is being held at the Washington County Regional Correctional Facility pending an initial court appearance.</p><p>All suspects are presumed innocent unless proven guilty.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-18/father-charged-with-child-neglect-after-6-year-old-injured-in-greenville-shooting",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/633906093_122206505000047818_771689681205204335_n.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-18/father-charged-with-child-neglect-after-6-year-old-injured-in-greenville-shooting",
      "pub_date": "Wed, 18 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-18T00:00:00+00:00",
      "summary": "GREENVILLE – A 6-year-old boy was injured Monday after he shot himself with a handgun, and his father has been arrested on a child neglect charge, according to Greenville police.",
      "title": "Father charged with child neglect after 6-year-old injured in Greenville shooting - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-18/jackson-woman-arrested-in-fatal-shooting-at-chapel-ridge-apartments": {
      "author": "Therese Apel",
      "content_html": "<p>UPDATE: On Wednesday, Jamecia Harper appeared before a Municipal Court Judge and received a $50K bond for the charge of Convicted Felon with a Firearm, and no bond on the Murder charge.</p><p>JACKSON — A 27-year-old Jackson woman has been arrested and charged with murder in connection with a fatal shooting earlier this week at an apartment complex on Raymond Road, police said.</p><p>Jackson Police Department officials said Jamecia Harper, 27, was taken into custody by Robbery/Homicide Unit detectives for her alleged involvement in the killing. Harper is charged with murder and felon in possession of a firearm.</p><p>The victim was identified as Kynjarious Rockingham, 30.</p><p>Precinct 1 officers were dispatched about 12:30 a.m. Feb. 16 to the Chapel Ridge Apartments in the 1600 block of Raymond Road after receiving a report of a deceased person in the parking lot.</p><p>When officers arrived, they found an adult male lying on the ground. Detectives with the Robbery/Homicide Unit, the Mobile Crime Unit and the Hinds County coroner responded to the scene.</p><p>Investigators determined Rockingham had suffered at least one gunshot wound and died from his injuries.</p><p>Authorities have not released a possible motive in the case. It was not immediately clear whether Harper has an attorney or when she is expected to appear in court.</p><p>The shooting marked the city’s seventh homicide of the year, according to police.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-18/jackson-woman-arrested-in-fatal-shooting-at-chapel-ridge-apartments",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/Screenshot-2026-02-18-075332.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-18/jackson-woman-arrested-in-fatal-shooting-at-chapel-ridge-apartments",
      "pub_date": "Wed, 18 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-18T00:00:00+00:00",
      "summary": "UPDATE: On Wednesday, Jamecia Harper appeared before a Municipal Court Judge and received a $50K bond for the charge of Convicted Felon with a Firearm, and no bond on the Murder charge.",
      "title": "Jackson Woman Charged in Fatal Shooting at Chapel Ridge Apartments - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-18/jones-county-crash-suspect-faces-dui-charges-ice-detainer-leads-to-transfer-from-detention-facility": {
      "author": "Morgan Howard",
      "content_html": "<p>JONES COUNTY — A driver arrested in an overnight crash on U.S. Highway 29 North that damaged Dixie Electric Power Association equipment and left hundreds without electricity was later taken into federal custody after an immigration detainer was discovered in court.</p><p>The Jones County Sheriff’s Department said it assisted the Mississippi Highway Patrol at a crash scene near 1961 Highway 29 North at the intersection of Justin Adams Drive.</p><p>Deputy Lou Lowe arrived and took the driver, Richard Castillo, 30, into custody pending the arrival of state troopers, the sheriff’s department said. Authorities said neither Castillo nor a passenger in the vehicle was injured.</p><p>Dixie EPA infrastructure was damaged when a power pole was broken and power lines fell across the roadway, the sheriff’s department said. The outage affected hundreds of Dixie EPA members.</p><p>Troopers arrested Castillo and charged him with DUI first offense, no insurance and failure to keep lane, authorities said. He was booked into the Jones County Adult Detention Facility pending an initial appearance in Jones County Justice Court.</p><p>Dixie EPA linemen and support crews worked to repair the damage and restore service, according to the sheriff’s department. Jones County Fire District 1 volunteer units also responded and assisted with traffic control.</p><p>Authorities said an Immigration and Customs Enforcement detainer was discovered when Castillo appeared in Jones County court before Judge Grant Hedgepeth. The sheriff’s department said Castillo was later picked up by ICE at the Jones County Adult Detention Facility and released to federal custody.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-18/jones-county-crash-suspect-faces-dui-charges-ice-detainer-leads-to-transfer-from-detention-facility",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/Screenshot-2026-02-18-153218.png",
      "link": "https://darkhorsepressnow.com/news/2026-02-18/jones-county-crash-suspect-faces-dui-charges-ice-detainer-leads-to-transfer-from-detention-facility",
      "pub_date": "Wed, 18 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-18T00:00:00+00:00",
      "summary": "JONES COUNTY — A driver arrested in an overnight crash on U.S. Highway 29 North that damaged Dixie Electric Power Association equipment and left hundreds without electricity was later taken into federal custody after an immigration detainer was discovered in court.",
      "title": "Jones County crash suspect faces DUI charges; ICE detainer leads to transfer from detention facility - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-18/natchez-woman-charged-in-atv-theft-investigation-on-scheffel-road": {
      "author": "Morgan Howard",
      "content_html": "<p>NATCHEZ — A Natchez woman has been charged in an ongoing investigation into the theft and recovery of an all-terrain vehicle from property on Scheffel Road, according to the Adams County Sheriff’s Office.</p><p>Sheriff’s officials said Amanda Breland, 40, was charged with grand larceny, trespassing and malicious mischief.</p><p>Deputies arrested Breland about 4 p.m. Tuesday, Feb. 17, after she was seen walking on Ogden Road in Adams County, the sheriff’s office said. She was taken into custody without incident and booked at the Adams County Sheriff’s Office.</p><p>Authorities said the charges are connected to an investigation into a stolen ATV that was recovered on Scheffel Road. Investigators determined the property was unlawfully entered and fencing was damaged to gain access and remove the vehicle, the sheriff’s office said.</p><p>The case remains an active investigation, and additional arrests are expected as investigators work to identify and pursue others involved.</p><p>Anyone with information is asked to contact the Adams County Sheriff’s Office at 601-442-2752 or Adams County E911.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-18/natchez-woman-charged-in-atv-theft-investigation-on-scheffel-road",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/634665675_775120608978829_2770222495695225443_n.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-18/natchez-woman-charged-in-atv-theft-investigation-on-scheffel-road",
      "pub_date": "Wed, 18 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-18T00:00:00+00:00",
      "summary": "NATCHEZ — A Natchez woman has been charged in an ongoing investigation into the theft and recovery of an all-terrain vehicle from property on Scheffel Road, according to the Adams County Sheriff’s Office.",
      "title": "Natchez woman charged in ATV theft investigation on Scheffel Road - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-18/pony-ride-day-set-for-april-4-at-strong-river-equine-center-in-brandon": {
      "author": "Therese Apel",
      "content_html": "<p>BRANDON — Families looking for an afternoon of outdoor fun or looking for an introduction into the world of horses can head to Brandon on April 4 for Pony Ride Day at Strong River Equine Center.</p><p>The three-hour event is scheduled from noon to 3 p.m. at the equine center, 5150 Highway 18, and will feature pony rides, food and photos for children.</p><p>Organizers said rides will be available for $4 each, with multiple horses on hand to accommodate participants. The event is designed to provide a safe and welcoming experience for children, whether it’s their first pony ride or they are already familiar with horses.</p><p>In addition to pony rides, families can purchase hamburgers and hot dogs during the event. Vintage-inspired photos with horses will also be offered as keepsakes.</p><p>Strong River Equine Center also offers birthday parties, horse boarding and English and Western riding lessons throughout the year.</p><p>For more information, call 505-235-2215 or 601-813-4128.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-18/pony-ride-day-set-for-april-4-at-strong-river-equine-center-in-brandon",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/635149417_1301697081767713_2817711368088087291_n.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-18/pony-ride-day-set-for-april-4-at-strong-river-equine-center-in-brandon",
      "pub_date": "Wed, 18 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-18T00:00:00+00:00",
      "summary": "BRANDON — Families looking for an afternoon of outdoor fun or looking for an introduction into the world of horses can head to Brandon on April 4 for Pony Ride Day at Strong River Equine Center.",
      "title": "Pony Ride Day Set for April 4 at Strong River Equine Center in Brandon - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-18/salvation-army-to-host-1920s-themed-senior-prom-in-jackson": {
      "author": "Therese Apel",
      "content_html": "<p>JACKSON — Senior citizens in the Jackson area are invited to step back into the Roaring ’20s this weekend during a vintage-themed prom hosted by The Salvation Army.</p><p>The event, titled “Southern Glamour of the 1920s: A Night of Vintage Elegance,” is scheduled for Saturday from 2 to 5 p.m. at The Salvation Army, 570 E. Beasley Road. The prom is sponsored by CenterWell Senior Primary Care.</p><p>Organizers say the afternoon celebration is designed specifically for older adults and will feature 1920s-inspired décor, music, light refreshments and dancing. Attendees are encouraged to wear vintage attire reflecting the era.</p><p>The Senior Prom is part of the organization’s ongoing efforts to serve and uplift older residents in the Jackson community by providing opportunities for fellowship and social connection.</p><p>“Our seniors are a treasured part of our community,” said Major Timothy Delaney, commanding officer of The Salvation Army in Jackson. “This event is a wonderful opportunity to honor them, celebrate their stories, and provide a space filled with dignity, fun and fellowship.”</p><p>The Salvation Army said the event aims to offer a safe and welcoming environment where seniors can build friendships and create lasting memories.</p><p>For more information about the Senior Prom or other programs, call 601-982-4881.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-18/salvation-army-to-host-1920s-themed-senior-prom-in-jackson",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/shutterstock_1707307105.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-18/salvation-army-to-host-1920s-themed-senior-prom-in-jackson",
      "pub_date": "Wed, 18 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-18T00:00:00+00:00",
      "summary": "JACKSON — Senior citizens in the Jackson area are invited to step back into the Roaring ’20s this weekend during a vintage-themed prom hosted by The Salvation Army.",
      "title": "Salvation Army to Host 1920s-Themed Senior Prom in Jackson - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-18/southern-pines-waives-reduces-dog-adoption-fees-during-weekend-event": {
      "author": "Therese Apel",
      "content_html": "<p>HATTIESBURG — Adoption fees for dogs and puppies will be waived or reduced this weekend at Southern Pines Animal Shelter as the shelter works to place dozens of animals in permanent homes.</p><p>The fee promotion runs Thursday through Sunday at three locations in Hattiesburg, making it “easier and more affordable than ever” for families to adopt, shelter officials said.</p><p>“It may be surprising, but January is one of our busiest puppy seasons in Hattiesburg,” said Amanda Paris, shelter director. “Our shelter is full of adorable puppies and adult dogs of all shapes, sizes and personalities, and they’re just waiting for you.”</p><p>Adoptable dogs and puppies will be available with reduced or waived fees at the shelter, 1901 N. 31st Ave., from noon to 5 p.m. Thursday through Sunday. Additional adoption events will be held Saturday and Sunday from 11 a.m. to 4 p.m. at PetSmart in Hattiesburg, and Sunday from 11 a.m. to 4 p.m. at Petco in Hattiesburg.</p><p>Saturday’s event at PetSmart coincides with “Adopt Joy,” a partnership with PetSmart Charities aimed at connecting families with pets. Shelter officials said research shows pet ownership can benefit cognitive, physical and emotional wellness and help children learn values such as patience and compassion.</p><p>All adoptions include age-appropriate vaccinations, spay or neuter surgery, a microchip, 30 days of pet health insurance and a sample bag of food. The shelter said the reduced fees cover those services.</p><p>Founded in 1952, Southern Pines operates a no-kill shelter that cares for more than 4,000 lost and unwanted dogs and cats each year. The organization also runs a transport program, thrift shops in Hattiesburg and Oak Grove and a low-cost veterinary clinic.</p><p>Shelter hours are noon to 5 p.m. Thursday through Tuesday. The shelter is closed Wednesdays.</p><p>Officials said those unable to adopt can support the effort through donations to assist with the care of animals awaiting homes.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-18/southern-pines-waives-reduces-dog-adoption-fees-during-weekend-event",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/Screenshot-2026-02-18-083014.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-18/southern-pines-waives-reduces-dog-adoption-fees-during-weekend-event",
      "pub_date": "Wed, 18 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-18T00:00:00+00:00",
      "summary": "HATTIESBURG — Adoption fees for dogs and puppies will be waived or reduced this weekend at Southern Pines Animal Shelter as the shelter works to place dozens of animals in permanent homes.",
      "title": "Southern Pines Waives, Reduces Dog Adoption Fees During Weekend Event - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-18/starkville-derby-dachshund-race-set-for-record-turnout-april-25": {
      "author": "Therese Apel",
      "content_html": "<p>STARKVILLE — The fourth annual Starkville Derby, billed as the world’s largest dachshund race, is expected to draw more than 250 racing dogs from over 20 states and crowds in the tens of thousands when it returns April 25.</p><p>Organizers of the Starkville Derby say this year’s event will be its largest yet, with competitors traveling from as far away as Rhode Island and Washington state. Past champions have come from outside Mississippi, including winners from Georgia in 2023 and 2024 and a Texas dog named Forest last year.</p><p>In addition to the races, the Derby features the Boardtown Pizza and Pints Arts Festival, with nearly 200 approved food and art vendors. Other attractions include live music, a children’s zone, flyovers, the Old Dominick Call to Post, Mutt Juleps and an appearance by the Oscar Mayer Wienermobile.</p><p>“We are so excited to welcome even more of our friends to the next edition of the world’s largest wiener dog race,” said Alden Thornhill, founder and host of the event. “Our team can’t wait to welcome so many new folks, both two- and four-legged, to the greatest show on turf on April 25th.”</p><p>The Derby has received multiple statewide and regional honors, including recognition from the Mississippi Tourism Association as Best Large Festival, the Mississippi Main Street Association as Best Creative Large Event and designation as a Top 20 Signature Event by the Southeast Tourism Society.</p><p>Founded in 2023 by a group of friends seeking to create a spring festival in Starkville, the event supports the Oktibbeha County Humane Society and has raised more than $150,000 for shelter pets, according to organizers.</p><p>The multi-camera HD broadcast of the races will begin at 11 a.m. CDT on the event’s YouTube channel and Facebook page. Organizers say the festival has generated millions of social media impressions while becoming one of Mississippi’s largest arts festivals.</p><p>More information is available at thestarkvillederby.com.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-18/starkville-derby-dachshund-race-set-for-record-turnout-april-25",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/starkville-derby-e1771424241243.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-18/starkville-derby-dachshund-race-set-for-record-turnout-april-25",
      "pub_date": "Wed, 18 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-18T00:00:00+00:00",
      "summary": "STARKVILLE — The fourth annual Starkville Derby, billed as the world’s largest dachshund race, is expected to draw more than 250 racing dogs from over 20 states and crowds in the tens of thousands when it returns April 25.",
      "title": "Starkville Derby dachshund race set for record turnout April 25 - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-18/student-taken-into-custody-after-handgun-found-in-vehicle-at-alcorn-central-high-school": {
      "author": "Morgan Howard",
      "content_html": "<p>ALCORN COUNTY — A student was taken into custody after a handgun was found inside a vehicle that entered Alcorn Central High School’s campus, according to the Alcorn School District.</p><p>District officials said the school received a tip Thursday morning about a potential safety concern involving a vehicle coming onto campus. School and district personnel responded and approached the vehicle as soon as it entered school grounds, officials said.</p><p>The district said the vehicle was searched and a handgun was located inside. The firearm was immediately seized, and the student was taken into custody by the Alcorn County Sheriff’s Department.</p><p>Based on information available, the district said officials believe the incident was isolated. The district said no additional details would be released because the matter is now under investigation by law enforcement.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-18/student-taken-into-custody-after-handgun-found-in-vehicle-at-alcorn-central-high-school",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2022/04/megan-lee-T8nLapDk1zM-unsplash-scaled.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-18/student-taken-into-custody-after-handgun-found-in-vehicle-at-alcorn-central-high-school",
      "pub_date": "Wed, 18 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-18T00:00:00+00:00",
      "summary": "ALCORN COUNTY — A student was taken into custody after a handgun was found inside a vehicle that entered Alcorn Central High School’s campus, according to the Alcorn School District.",
      "title": "Student taken into custody after handgun found in vehicle at Alcorn Central High School - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-18/suspect-in-raymond-road-homicide-given-no-bond-on-murder-charge": {
      "author": "Morgan Howard",
      "content_html": "<p>JACKSON – A suspect in Jackson’s seventh homicide of the year appeared in municipal court Wednesday and was ordered held without bond on a murder charge, according to the Jackson Police Department.</p><p>Police said Jamecia Harper appeared before a municipal court judge on Feb. 18, 2026, in connection with Homicide No. 7, which investigators have linked to a case in the 1600 block of Raymond Road.</p><p>Authorities said Harper received a $50,000 bond on a charge of convicted felon in possession of a firearm and was denied bond on the murder charge.</p><p>The case remains under investigation. Anyone with information is asked to contact the Jackson Police Department at 601-960-1234 or Crime Stoppers at 601-355-TIPS (8477).</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-18/suspect-in-raymond-road-homicide-given-no-bond-on-murder-charge",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/Screenshot-2026-02-18-075332.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-18/suspect-in-raymond-road-homicide-given-no-bond-on-murder-charge",
      "pub_date": "Wed, 18 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-18T00:00:00+00:00",
      "summary": "JACKSON – A suspect in Jackson’s seventh homicide of the year appeared in municipal court Wednesday and was ordered held without bond on a murder charge, according to the Jackson Police Department.",
      "title": "Suspect in Raymond Road homicide given no bond on murder charge - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-18/teen-arrested-charged-with-capital-murder-in-fatal-grove-circle-shooting": {
      "author": "Therese Apel",
      "content_html": "<p>UPDATE: On Wednesday, Javeon Wilson appeared before a Municipal Court Judge and received a $250K bond for the charge of Aggravated Assault and no bond for the Capital Murder charge.</p><p>JACKSON — A 17-year-old has been arrested and charged with capital murder in connection with a February shooting at a Jackson apartment complex that left one man dead and another injured, police said.</p><p>Jackson Police Department officials announced that Javeon Wilson, 17, has been taken into custody by the department’s Robbery/Homicide Unit. Wilson is charged with capital murder and aggravated assault in the death of Glen Blackwell III and the wounding of a second victim.</p><p>Wilson was booked into city holding and is awaiting his initial court appearance.</p><p>The shooting occurred Feb. 12 at an apartment complex on Grove Circle near North State Street. Precinct 4 officers responded to reports that several people had been shot. Robbery/Homicide detectives were called to the scene.</p><p>Investigators determined that two individuals were injured during the incident and were transported by ambulance to local hospitals. Hospital staff later informed detectives that one of the victims, Glen Blackwell III, died from his injuries. The second victim was treated for non-life-threatening injuries.</p><p>Police said the suspects were initially described as five to six unknown males wearing masks who fled the scene on foot. At the time of the initial release, no arrests had been made.</p><p>Authorities said the motive for the shooting appeared to be robbery. The investigation remains active.</p><p>Anyone with information is asked to contact the Jackson Police Department at 601-960-1234 or Crime Stoppers at 601-355-TIPS (8477).</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-18/teen-arrested-charged-with-capital-murder-in-fatal-grove-circle-shooting",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/Screenshot-2026-02-18-075808.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-18/teen-arrested-charged-with-capital-murder-in-fatal-grove-circle-shooting",
      "pub_date": "Wed, 18 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-18T00:00:00+00:00",
      "summary": "UPDATE: On Wednesday, Javeon Wilson appeared before a Municipal Court Judge and received a $250K bond for the charge of Aggravated Assault and no bond for the Capital Murder charge.",
      "title": "Teen Charged With Capital Murder in Fatal Grove Circle Shooting - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-18/three-arrested-after-joint-narcotics-operation-in-forrest-lamar-county": {
      "author": "Morgan Howard",
      "content_html": "<p>FORREST COUNTY — Three people were taken into custody Tuesday after a joint narcotics operation by the Forrest County Sheriff’s Office and the Lamar County Sheriff’s Office led to the seizure of suspected methamphetamine, marijuana and multiple firearms, authorities said.</p><p>Investigators from the two agencies executed search warrants Feb. 17 at two locations: one in the 2600 block of Oak Grove Road and another in the 700 block of Duane Street.</p><p>During the searches, agents recovered about 10 ounces of suspected methamphetamine, 18 pounds of suspected marijuana and 12 firearms, authorities said. Officials said the suspects were believed to be involved in drug activity impacting both Forrest and Lamar counties.</p><p>Those arrested were identified as:</p><p>Lorenzo Price, charged with aggravated trafficking of methamphetamine;</p><p>Dorothy Jackson, charged with trafficking of marijuana while in possession of a firearm; and</p><p>Jalavion Haynes, charged with possession with intent to distribute ecstasy while in possession of a firearm.</p><p>Authorities said the seized items will be submitted to the Mississippi Crime Laboratory for testing and analysis. Officials said the investigation remains ongoing.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-18/three-arrested-after-joint-narcotics-operation-in-forrest-lamar-county",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/Screenshot-2026-02-18-154044.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-18/three-arrested-after-joint-narcotics-operation-in-forrest-lamar-county",
      "pub_date": "Wed, 18 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-18T00:00:00+00:00",
      "summary": "FORREST COUNTY — Three people were taken into custody Tuesday after a joint narcotics operation by the Forrest County Sheriff’s Office and the Lamar County Sheriff’s Office led to the seizure of suspected methamphetamine, marijuana and multiple firearms, authorities said.",
      "title": "Three arrested after joint narcotics operation in Forrest, Lamar County - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-18/tupelo-man-sentenced-to-25-years-after-guilty-plea-in-2023-killing": {
      "author": "Morgan Howard",
      "content_html": "<p>TUPELO – A man has been sentenced to 25 years in prison after pleading guilty to second-degree murder in the 2023 death of Montavious Jemar Clifton, according to the First Circuit District Attorney’s Office.</p><p>Prosecutors said Jaedin Jacques Hatchett entered the guilty plea Feb. 12. Hatchett had been indicted on a second-degree murder charge in connection with Clifton’s death on March 5, 2023.</p><p>Circuit Court Judge John R. White sentenced Hatchett to 25 years in the custody of the Mississippi Department of Corrections, the district attorney’s office said. Prosecutors said Hatchett will be required to serve the full 25-year term and will not be eligible for parole or early release.</p><p>The district attorney’s office said an additional 15 years were suspended, and Hatchett will be required to complete five years of post-release supervision after he is released from prison.</p><p>The case was investigated by the Tupelo Police Department. Assistant District Attorney Sadie Gardner prosecuted the case.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-18/tupelo-man-sentenced-to-25-years-after-guilty-plea-in-2023-killing",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/637824765_1532218862242957_461448563448770491_n.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-18/tupelo-man-sentenced-to-25-years-after-guilty-plea-in-2023-killing",
      "pub_date": "Wed, 18 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-18T00:00:00+00:00",
      "summary": "TUPELO – A man has been sentenced to 25 years in prison after pleading guilty to second-degree murder in the 2023 death of Montavious Jemar Clifton, according to the First Circuit District Attorney’s Office.",
      "title": "Tupelo man sentenced to 25 years after guilty plea in 2023 killing - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-18/wednesday-weather-mostly-cloudy-and-warm-with-near-record-highs": {
      "author": "Mary Apel",
      "content_html": "<p>It appears we’ll have our next significant rain chances as we go into the weekend. Monitor updates concerning this system for changes related to storm coverage and rainfall.</p><p>Highs in the 70s nearing 80 later today with occasional sunshine peeking through the clouds.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-18/wednesday-weather-mostly-cloudy-and-warm-with-near-record-highs",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/Weather-11.jpg",
      "link": "https://darkhorsepressnow.com/news/2026-02-18/wednesday-weather-mostly-cloudy-and-warm-with-near-record-highs",
      "pub_date": "Wed, 18 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-18T00:00:00+00:00",
      "summary": "It appears we’ll have our next significant rain chances as we go into the weekend. Monitor updates concerning this system for changes related to storm coverage and rainfall.",
      "title": "Wednesday Weather: Mostly cloudy and warm with near record highs - Darkhorse Press"
    },
    "https://darkhorsepressnow.com/news/2026-02-18/woman-charged-after-domestic-stabbing-in-lamar-county": {
      "author": "Morgan Howard",
      "content_html": "<p>LAMAR COUNTY – A 48-year-old woman has been charged with aggravated assault in a domestic violence case after deputies said a man was stabbed during a fight Monday night at an apartment on Shears Road.</p><p>Deputies responded around 9 p.m. Feb. 16, 2026, after a reported stabbing, according to authorities. Investigators said a 38-year-old man suffered a stab wound to the abdomen and was transported by ambulance to a local hospital, where he underwent surgery.</p><p>Authorities identified the woman as Demetra Holloway, 48. Deputies said Holloway suffered a cut to her hand during the incident and was also taken to a local hospital for treatment.</p><p>After she was released, Holloway was transported to the Lamar County Jail and charged with aggravated assault/domestic violence, authorities said. Bond was set at $25,000.</p>",
      "guid": "https://darkhorsepressnow.com/news/2026-02-18/woman-charged-after-domestic-stabbing-in-lamar-county",
      "image_url": "https://darkhorsepressnow.com/wp-content/uploads/2026/02/Screenshot-2026-02-18-115413.png",
      "link": "https://darkhorsepressnow.com/news/2026-02-18/woman-charged-after-domestic-stabbing-in-lamar-county",
      "pub_date": "Wed, 18 Feb 2026 00:00:00 +0000",
      "pub_dt_iso": "2026-02-18T00:00:00+00:00",
      "summary": "LAMAR COUNTY – A 48-year-old woman has been charged with aggravated assault in a domestic violence case after deputies said a man was stabbed during a fight Monday night at an apartment on Shears Road.",
      "title": "Woman charged after domestic stabbing in Lamar County - Darkhorse Press"
    }
  },
  "last_run_utc": "2026-02-19T08:24:03.126587+00:00",
  "seen_urls": [
    "https://darkhorsepressnow.com/news/2026-02-18/three-arrested-after-joint-narcotics-operation-in-forrest-lamar-county",
    "https://darkhorsepressnow.com/news/2026-02-18/suspect-in-raymond-road-homicide-given-no-bond-on-murder-charge",
    "https://darkhorsepressnow.com/news/2026-02-18/jones-county-crash-suspect-faces-dui-charges-ice-detainer-leads-to-transfer-from-detention-facility",
    "https://darkhorsepressnow.com/news/2026-02-18/father-charged-with-child-neglect-after-6-year-old-injured-in-greenville-shooting",
    "https://darkhorsepressnow.com/news/2026-02-18/woman-charged-after-domestic-stabbing-in-lamar-county",
    "https://darkhorsepressnow.com/news/2026-02-18/tupelo-man-sentenced-to-25-years-after-guilty-plea-in-2023-killing",
    "https://darkhorsepressnow.com/news/2026-02-18/natchez-woman-charged-in-atv-theft-investigation-on-scheffel-road",
    "https://darkhorsepressnow.com/news/2026-02-18/student-taken-into-custody-after-handgun-found-in-vehicle-at-alcorn-central-high-school",
    "https://darkhorsepressnow.com/news/2026-02-18/pony-ride-day-set-for-april-4-at-strong-river-equine-center-in-brandon",
    "https://darkhorsepressnow.com/news/2026-02-18/salvation-army-to-host-1920s-themed-senior-prom-in-jackson",
    "https://darkhorsepressnow.com/news/2026-02-18/southern-pines-waives-reduces-dog-adoption-fees-during-weekend-event",
    "https://darkhorsepressnow.com/news/2026-02-18/como-man-sentenced-to-5-years-in-federal-prison-for-cocaine-distribution",
    "https://darkhorsepressnow.com/news/2026-02-18/starkville-derby-dachshund-race-set-for-record-turnout-april-25",
    "https://darkhorsepressnow.com/news/2026-02-18/teen-arrested-charged-with-capital-murder-in-fatal-grove-circle-shooting",
    "https://darkhorsepressnow.com/news/2026-02-18/jackson-woman-arrested-in-fatal-shooting-at-chapel-ridge-apartments",
    "https://darkhorsepressnow.com/news/2026-02-18/wednesday-weather-mostly-cloudy-and-warm-with-near-record-highs",
    "https://darkhorsepressnow.com/news/2026-02-17/saltillo-man-charged-with-felony-marijuana-trafficking-hydrocodone-possession-after-tupelo-stop",
    "https://darkhorsepressnow.com/news/2026-02-17/tupelo-police-investigate-shooting-that-injured-juvenile-on-fillmore-drive",
    "https://darkhorsepressnow.com/news/2026-02-17/inmate-dies-after-being-found-unresponsive-in-alcorn-county-jail-cell",
    "https://darkhorsepressnow.com/news/2026-02-17/nettleton-man-charged-with-sexual-battery-of-child-under-14",
    "https://darkhorsepressnow.com/news/2026-02-17/jackson-police-seek-missing-32-year-old-man-last-seen-sunday",
    "https://darkhorsepressnow.com/news/2026-02-17/clinton-nature-center-to-host-spring-break-bird-camp-for-ages-9-12",
    "https://darkhorsepressnow.com/news/2026-02-17/update-man-found-dead-outside-jackson-apartment-complex-on-raymond-road-identified",
    "https://darkhorsepressnow.com/news/2026-02-17/jackson-state-awarded-14-5-million-nih-contract-to-extend-jackson-heart-study-training-center",
    "https://darkhorsepressnow.com/news/2026-02-17/jackson-police-investigate-fatal-hit-and-run-involving-man-in-wheelchair-on-mcdowell-road",
    "https://darkhorsepressnow.com/news/2026-02-17/arkansas-fugitive-found-in-rankin-county-after-controlled-drug-buy",
    "https://darkhorsepressnow.com/news/2026-02-17/driver-dies-after-vehicle-crashes-into-natchez-church",
    "https://darkhorsepressnow.com/news/2026-02-17/random-acts-of-kindness-day-encourages-small-gestures-with-big-impact",
    "https://darkhorsepressnow.com/news/2026-02-17/harrison-county-deputies-seek-suspect-in-attempted-business-break-in",
    "https://darkhorsepressnow.com/news/2026-02-17/oxford-lafayette-community-assistance-fund-launched-to-aid-winter-storm-fern-recovery",
    "https://darkhorsepressnow.com/news/2026-02-16/rodeo-royalty-bullfighters-visit-st-dominic-nicu-during-dixie-national-week",
    "https://darkhorsepressnow.com/news/2026-02-16/police-seek-publics-help-finding-missing-101-year-old-gulfport-man",
    "https://darkhorsepressnow.com/news/2026-02-16/gulfport-teen-charged-with-aggravated-assault-in-shooting-of-14-year-old",
    "https://darkhorsepressnow.com/news/2026-02-16/public-asked-to-help-identify-individual-in-recent-vicksburg-shooting",
    "https://darkhorsepressnow.com/news/2026-02-16/silver-alert-issued-for-missing-63-year-old-vicksburg-man",
    "https://darkhorsepressnow.com/news/2026-02-16/man-shot-multiple-times-in-jackson-drives-himself-to-safety",
    "https://darkhorsepressnow.com/news/2026-02-16/adams-county-deputies-recover-dirt-bike-reported-stolen-in-louisiana-in-2022",
    "https://darkhorsepressnow.com/news/2026-02-16/biloxi-police-seek-help-identifying-suspect-in-petit-larceny-case",
    "https://darkhorsepressnow.com/news/2026-02-16/natchez-man-found-dead-after-vehicle-crashes-into-tree",
    "https://darkhorsepressnow.com/news/2026-02-16/ocean-springs-police-seek-woman-wanted-on-felony-exploitation-charge",
    "https://darkhorsepressnow.com/news/2026-02-16/woman-arrested-on-felony-drug-and-child-endangerment-charges-at-fulton-safety-checkpoint",
    "https://darkhorsepressnow.com/news/2026-02-16/two-ef1-tornadoes-confirmed-in-lincoln-county-nws-storm-surveys-continue",
    "https://darkhorsepressnow.com/news/2026-02-16/man-found-shot-to-death-in-jackson-apartment-complex-parking-lot",
    "https://darkhorsepressnow.com/news/2026-02-16/presidents-day-weather-temps-warming-to-the-60s",
    "https://darkhorsepressnow.com/news/2026-02-16/celebrate-the-day-do-something-kind-for-the-grouch-in-your-life",
    "https://darkhorsepressnow.com/news/2026-02-16/missing-in-mississippi-vickie-ellington-attala-county-2",
    "https://darkhorsepressnow.com/news/2026-02-14/mbi-probes-officer-involved-shooting-near-crestview-street-in-jackson",
    "https://darkhorsepressnow.com/news/2026-02-13/natchez-man-arrested-on-statutory-rape-warrant-in-adams-county",
    "https://darkhorsepressnow.com/news/top-story/2026-02-13/vehicle-crashes-into-indianola-walmart-four-injured",
    "https://darkhorsepressnow.com/news/2026-02-13/reward-offered-for-missing-french-bulldog-last-seen-near-old-rice-road-in-canton",
    "https://darkhorsepressnow.com/news/2026-02-13/jackson-police-seek-publics-help-identifying-suspects-in-attempted-copper-theft",
    "https://darkhorsepressnow.com/news/top-story/2026-02-13/human-trafficking-investigation-in-pascagoula-leads-to-arrests-charges-against-66-year-old-man",
    "https://darkhorsepressnow.com/news/2026-02-13/waynesboro-man-arrested-after-near-head-on-encounter-with-jones-county-deputy"
  ]
}